[
  {
    "id": "b2371630211f6167",
    "question_text": "Stars spend most of their lives on the main sequence, fusing hydrogen into helium. What determines where a star falls on the main sequence — its luminosity and surface temperature?",
    "options": {
      "A": "The star's mass — more massive stars have higher core temperatures and pressures, driving faster fusion rates that produce higher luminosity and hotter surface temperatures, placing them at the upper left of the H-R diagram",
      "B": "The star's distance from the center of its galaxy, which determines the local density of interstellar gas available for accretion and thereby controls the star's luminosity and surface temperature",
      "C": "The star's age — all stars begin their main-sequence lives as dim, cool objects and gradually brighten and heat up as hydrogen is converted to helium, steadily increasing the mean molecular weight of the core",
      "D": "The chemical composition of the star's atmosphere, particularly the abundance ratios of metals to hydrogen and helium, is the dominant factor that determines the star's position on the HR diagram because atmospheric opacity controls how much radiation escapes from the stellar surface, setting both its apparent color and total energy output"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.364637,
    "y": 0.898578,
    "z": 0.958236,
    "source_article": "main sequence",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "main sequence",
      "Hertzsprung-Russell diagram",
      "stellar mass",
      "stellar luminosity"
    ]
  },
  {
    "id": "221ef84d495074eb",
    "question_text": "The cosmic microwave background (CMB) radiation fills the entire observable universe with a nearly perfect blackbody spectrum at 2.725 K. What is the CMB?",
    "options": {
      "A": "Thermal radiation emitted by interstellar dust grains distributed throughout the Milky Way's disk and halo, heated to a few kelvins by starlight absorption and re-emitting in the microwave band — this galactic cirrus emission would appear isotropic from within the disk because dust is present in every direction, mimicking the observed uniformity of the CMB across the sky",
      "B": "The redshifted remnant of the hot radiation that filled the early universe, released approximately 380,000 years after the Big Bang when the universe cooled enough for electrons and protons to combine into neutral hydrogen — making the universe transparent to photons for the first time",
      "C": "Radio noise generated by the combined synchrotron emission of all radio galaxies in the observable universe, superimposed to create an apparently smooth background",
      "D": "Radiation produced by dark matter annihilation reactions occurring uniformly throughout intergalactic space, where weakly interacting massive particles (WIMPs) collide and convert their rest mass into photons that have been thermalized by repeated scattering with the intergalactic medium to produce the observed blackbody spectrum"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.09304,
    "y": 0.7864,
    "z": 0.800677,
    "source_article": "cosmic microwave background",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "cosmic microwave background",
      "recombination",
      "Big Bang",
      "blackbody radiation"
    ]
  },
  {
    "id": "31334c027ecb9588",
    "question_text": "A white dwarf is the remnant core of a low- to intermediate-mass star. What prevents a white dwarf from collapsing further under its own gravity?",
    "options": {
      "A": "Ongoing nuclear fusion in the white dwarf's core generates outward radiation pressure",
      "B": "The white dwarf's rapid rotation creates centrifugal force that balances gravity",
      "C": "Electron degeneracy pressure — a quantum mechanical effect arising from the Pauli exclusion principle, which prevents electrons from occupying the same quantum state and resists further compression regardless of temperature",
      "D": "Magnetic pressure from the white dwarf's extremely strong magnetic field pushes outward against gravity"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.356705,
    "y": 0.884534,
    "z": 0.231546,
    "source_article": "white dwarf",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "white dwarf",
      "electron degeneracy pressure",
      "Pauli exclusion principle",
      "stellar remnant"
    ]
  },
  {
    "id": "64eabc7ecf301e8f",
    "question_text": "When we observe a galaxy whose light has been traveling for 10 billion years, we see it as it was 10 billion years ago. What fundamental property of light makes astronomical observation equivalent to looking back in time?",
    "options": {
      "A": "Light slows down progressively as it travels through the increasingly dense intergalactic medium over billions of years, creating a cumulative time delay between emission and detection that is proportional to the distance traveled — this is why the most distant objects appear to show the greatest time offset between their actual state and what we observe",
      "B": "Gravitational lensing by intervening galaxy clusters bends and delays the light path from distant objects, adding curvature to photon trajectories that makes distant galaxies appear older than they actually are because the photons took a longer, curved route through space rather than traveling in straight lines",
      "C": "Advanced telescopes use adaptive optics systems combined with computational reconstruction algorithms that extrapolate the past states of astronomical objects from their current emission spectra, effectively reconstructing their appearance at earlier epochs by modeling their likely evolutionary history using stellar population synthesis codes",
      "D": "Light travels at a finite speed ($c \\approx 3 \\times 10^8$ m/s), so the image we receive from a distant object shows it as it was when that light was emitted — greater distance means greater lookback time"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.065277,
    "y": 0.89995,
    "z": 0.669621,
    "source_article": "speed of light",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "speed of light",
      "lookback time",
      "light travel time",
      "observational cosmology"
    ]
  },
  {
    "id": "4bbaef6da79e203c",
    "question_text": "Type Ia supernovae are used as 'standard candles' to measure cosmic distances. What makes them useful as distance indicators?",
    "options": {
      "A": "Their peak luminosities are remarkably uniform because each results from the thermonuclear detonation of a white dwarf near the Chandrasekhar limit (~1.4 $M_\\odot$) — comparing their known intrinsic brightness to their observed apparent brightness yields distance via the inverse-square law",
      "B": "They produce identical amounts of neutrinos regardless of their environment or progenitor history, and these neutrinos can be counted by underground detectors to establish a distance estimate via the inverse-square law of neutrino flux",
      "C": "They always occur exclusively in elliptical galaxies with well-characterized stellar populations, making their host galaxies identifiable at any distance through photometric surveys that measure the galaxy's color and morphology",
      "D": "They all emit at the same characteristic radio frequency determined by the nuclear physics of carbon detonation, allowing very long baseline interferometric measurements to precisely determine the distance through the frequency shift relative to the known rest-frame emission line, analogous to how hydrogen 21-cm line surveys map galactic structure"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.180563,
    "y": 0.959668,
    "z": 0.586157,
    "source_article": "Type Ia supernova",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Type Ia supernova",
      "standard candle",
      "Chandrasekhar limit",
      "distance ladder",
      "inverse-square law"
    ]
  },
  {
    "id": "3f0f6cabe0f8d0ef",
    "question_text": "Neutron stars can spin at rates exceeding 700 rotations per second (millisecond pulsars). How do neutron stars achieve such extreme rotation rates?",
    "options": {
      "A": "Neutron stars are born spinning slowly at roughly one rotation per hour and are gradually accelerated to millisecond periods by dark energy exerting a tangential torque on their surface — the repulsive cosmological constant creates differential stress on the neutron star's crust that converts radial expansion energy into rotational kinetic energy over billions of years of accumulated angular acceleration",
      "B": "Conservation of angular momentum during core collapse — the massive stellar core shrinks from ~Earth-size to ~city-size (~10 km radius), and since angular momentum $L = I\\omega$ is conserved, the dramatic decrease in moment of inertia $I$ produces an enormous increase in angular velocity $\\omega$",
      "C": "Neutron stars generate their own rotation through asymmetric radiation emission that produces a net recoil torque perpendicular to the magnetic dipole axis",
      "D": "Magnetic field lines from nearby companion stars and interstellar medium thread through the neutron star's magnetosphere, wrapping around its surface and transferring angular momentum through magnetic torque coupling that gradually spins the neutron star up to millisecond periods, similar to how electromagnetic braking works in reverse"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.350258,
    "y": 0.871098,
    "z": 0.401556,
    "source_article": "neutron star",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "neutron star",
      "pulsar",
      "conservation of angular momentum",
      "core collapse"
    ]
  },
  {
    "id": "a3e10079f04e9450",
    "question_text": "The Hertzsprung-Russell diagram plots stellar luminosity against surface temperature. Red giant stars occupy the upper right — high luminosity but cool surface temperature. How can a cool star be so luminous?",
    "options": {
      "A": "Red giants are closer to Earth than main-sequence stars, making them appear brighter",
      "B": "Red giants emit primarily in the ultraviolet, which our instruments detect as high luminosity",
      "C": "Although each square meter of a red giant's surface emits less energy than a hotter star (by Stefan-Boltzmann: $F = \\sigma T^4$), red giants have enormously expanded radii (up to ~100× the Sun's), giving them vastly more surface area — the total luminosity $L = 4\\pi R^2 \\sigma T^4$ is high because $R^2$ more than compensates for the lower $T^4$",
      "D": "Red giants have a second internal energy source beyond nuclear fusion that supplements their luminosity"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.328301,
    "y": 0.880683,
    "z": 0.854599,
    "source_article": "red giant",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "red giant",
      "Stefan-Boltzmann law",
      "stellar luminosity",
      "stellar radius",
      "H-R diagram"
    ]
  },
  {
    "id": "d7a9f488ecfc4140",
    "question_text": "The observable universe is approximately 93 billion light-years in diameter, yet the universe is only about 13.8 billion years old. How can the observable universe be larger than the distance light could have traveled in 13.8 billion years?",
    "options": {
      "A": "Light traveled significantly faster in the early universe when the matter density was much lower and there was less gravitational drag on photons from intervening mass concentrations — as the universe aged and structure formed, increasing gravity progressively slowed photons to their current speed of $c$, so early photons covered far more distance per unit time than photons emitted today",
      "B": "The measurement is fundamentally incorrect — the observable universe is actually only 27.6 billion light-years across, corresponding to twice the age of the universe multiplied by the speed of light, and all claims of a larger diameter result from confusing comoving coordinates with proper distances in an expanding Robertson-Walker metric",
      "C": "Gravitational lensing by the cumulative mass of all galaxy clusters along every line of sight magnifies the apparent angular size of the universe by a factor of approximately three, creating the illusion that the observable universe is considerably larger than the simple light-travel-time calculation would suggest",
      "D": "The expansion of space itself has stretched the distances between objects during the time light was traveling — objects that emitted light 13.8 billion years ago have since been carried much farther away by the expansion, so their current distance is much greater than the light travel time would suggest"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.01,
    "y": 0.866287,
    "z": 0.666597,
    "source_article": "expanding universe",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "expanding universe",
      "comoving distance",
      "cosmological expansion",
      "observable universe"
    ]
  },
  {
    "id": "2320b18788edca8c",
    "question_text": "Gravitational lensing occurs when a massive object bends the path of light from a more distant source. Einstein's general relativity predicts twice the deflection angle that Newtonian gravity would predict. Why?",
    "options": {
      "A": "In general relativity, light follows geodesics through curved spacetime — mass curves both space AND time, and both curvatures contribute to the deflection. Newtonian gravity, treating light as particles in flat space subject only to gravitational acceleration, captures only the spatial curvature component, yielding half the correct value",
      "B": "Einstein's general theory of relativity includes the cosmological constant $\\Lambda$, which represents dark energy and provides an additional attractive force on photons that Newton's gravitational theory completely lacks — this extra force contributes precisely the additional deflection angle needed to match the observed factor-of-two discrepancy, and it explains why the bending effect is stronger near galaxies with higher local dark energy density",
      "C": "Relativistic photons have twice the effective gravitational mass of Newtonian corpuscular light particles because of the mass-energy equivalence $E = mc^2$, doubling the gravitational deflection angle",
      "D": "General relativity accounts for the magnetic component of the gravitational field — an analog of the magnetic force in electromagnetism — which Newton's purely scalar theory of gravity completely ignores, and this gravitomagnetic contribution precisely doubles the bending angle for rapidly moving particles like photons"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.116416,
    "y": 0.850129,
    "z": 0.339398,
    "source_article": "gravitational lensing",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "gravitational lensing",
      "general relativity",
      "spacetime curvature",
      "light deflection"
    ]
  },
  {
    "id": "b9c083c4e9ea0b66",
    "question_text": "Cepheid variable stars pulsate with periods that are tightly correlated with their intrinsic luminosity (the period-luminosity relation). What physical mechanism causes Cepheid pulsation?",
    "options": {
      "A": "Cepheids are members of close binary star systems whose gravitational tidal interactions periodically compress and expand the primary star's outer envelope, driving the observed luminosity variations — the pulsation period is set by the binary orbital period, and more luminous (more massive) Cepheids tend to have wider orbits with longer periods, naturally producing the observed period-luminosity correlation",
      "B": "The κ-mechanism (opacity valve) — in a specific ionization zone (primarily He II → He III), compression increases opacity, trapping radiation and heating the gas, which drives expansion. Upon expansion, the gas cools, opacity drops, radiation escapes, and the star contracts again, creating a self-sustaining oscillation cycle",
      "C": "Cepheids periodically ignite and extinguish nuclear fusion reactions in a thin shell surrounding their helium cores, causing oscillations in energy output",
      "D": "Solar-like convective cells on the Cepheid's surface, analogous to granulation on the Sun but vastly larger in scale, create periodic brightness variations as giant convective plumes rise and fall through the star's photosphere with a characteristic turnover time that depends on the star's surface gravity and luminosity, producing the tight period-luminosity relationship observed by Henrietta Leavitt"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.351709,
    "y": 0.895347,
    "z": 0.687192,
    "source_article": "Cepheid variable",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Cepheid variable",
      "κ-mechanism",
      "stellar pulsation",
      "opacity",
      "period-luminosity relation"
    ]
  },
  {
    "id": "0bf478ec3e8dbf7e",
    "question_text": "Active galactic nuclei (AGN) can outshine their entire host galaxy by factors of 100 or more, yet they emit this energy from a region smaller than the Solar System. What powers them?",
    "options": {
      "A": "Thermonuclear fusion of hydrogen in an extremely dense stellar cluster at the galaxy's center",
      "B": "The galaxy's central stars undergo simultaneous supernova explosions, creating a sustained energy burst",
      "C": "Matter falling toward a supermassive black hole forms a hot accretion disk — gravitational potential energy is converted to radiation as infalling matter is viscously heated, achieving energy conversion efficiencies of ~10-40% of $mc^2$, far exceeding nuclear fusion's ~0.7%",
      "D": "Dark matter annihilation at the galaxy's center releases gamma rays that are reprocessed into the observed AGN emission"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.232104,
    "y": 0.792818,
    "z": 0.600741,
    "source_article": "active galactic nucleus",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "active galactic nucleus",
      "accretion disk",
      "supermassive black hole",
      "gravitational potential energy"
    ]
  },
  {
    "id": "77f693383a2a91d9",
    "question_text": "The cosmic distance ladder uses a sequence of methods to measure distances at increasing scales. Why can't a single method measure distances across the entire observable universe?",
    "options": {
      "A": "All distance measurement methods in astronomy are equally accurate at all scales from nearby stars to the most distant quasars, so the concept of a hierarchical distance ladder is unnecessary — the only reason different techniques are used is historical convention and instrument availability, not any fundamental limitation in the range or precision of individual methods",
      "B": "Observational equipment such as ground-based optical telescopes and space-based infrared observatories can only focus at one specific distance at a time due to the finite depth of field of their optical systems, requiring astronomers to switch between fundamentally different methods when observing at different focal distances rather than using a single technique continuously",
      "C": "International governmental treaties restrict access to the largest and most powerful telescopes (such as extremely large telescopes with 30+ meter apertures) that would be needed for direct trigonometric parallax measurements of distant galaxies, forcing astronomers to rely on less direct methods that introduce systematic errors at each step of the ladder",
      "D": "Each method has a limited range — parallax works only for nearby stars (~few kpc), Cepheids reach nearby galaxies (~30 Mpc), and Type Ia supernovae extend to cosmological distances (~Gpc). Each rung must be calibrated against the previous one, creating a hierarchical chain of overlapping methods"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.059823,
    "y": 0.977112,
    "z": 0.757842,
    "source_article": "cosmic distance ladder",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "cosmic distance ladder",
      "parallax",
      "standard candle",
      "distance measurement"
    ]
  },
  {
    "id": "927806a139a3f4f4",
    "question_text": "The Chandrasekhar limit (~1.4 solar masses) is the maximum mass of a stable white dwarf supported by electron degeneracy pressure. What happens physically as a white dwarf approaches this mass?",
    "options": {
      "A": "Electrons are forced to occupy higher and higher energy states, approaching relativistic speeds — relativistic degeneracy pressure increases more slowly with density ($P \\propto \\rho^{4/3}$) than non-relativistic ($P \\propto \\rho^{5/3}$), eventually becoming insufficient to counterbalance gravitational collapse",
      "B": "The white dwarf's core temperature increases monotonically with compression until carbon and oxygen nuclear fusion reignites in its center, generating outward thermal pressure that halts further gravitational contraction and establishes a new hydrostatic equilibrium at a higher mass",
      "C": "The Pauli exclusion principle breaks down at the extreme densities found in white dwarfs above the Chandrasekhar mass because the quantum wavefunctions of adjacent electrons begin to overlap, allowing multiple electrons to share identical quantum states",
      "D": "Gravitational waves carry away orbital energy and angular momentum from the white dwarf if it is in a binary system, causing it to gradually spiral inward and compress below the Chandrasekhar limit — this gravitational radiation reaction reduces the white dwarf's effective mass support more rapidly than electron degeneracy pressure can compensate, leading to inevitable collapse at any mass above about 1.0 solar masses"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.295891,
    "y": 0.889629,
    "z": 0.054308,
    "source_article": "Chandrasekhar limit",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Chandrasekhar limit",
      "relativistic degeneracy",
      "white dwarf stability",
      "equation of state"
    ]
  },
  {
    "id": "7d62fd9673542448",
    "question_text": "Observations of distant Type Ia supernovae in 1998 revealed that the expansion of the universe is accelerating. What cosmological ingredient is required to explain this acceleration within general relativity?",
    "options": {
      "A": "A massive concentration of ordinary baryonic matter located beyond the edge of the observable universe exerts a gravitational pull on all visible matter, drawing galaxies outward in every direction with increasing force at greater distances — this 'Great Attractor' model explains the observed acceleration because more distant galaxies experience a stronger pull and therefore appear to accelerate away from us more rapidly",
      "B": "A component with negative pressure (dark energy or a cosmological constant $\\Lambda$) — in general relativity, pressure contributes to gravity, and sufficiently negative pressure creates a repulsive gravitational effect that drives accelerated expansion",
      "C": "Antimatter galaxies scattered throughout the cosmos whose gravitational interaction with ordinary matter is repulsive rather than attractive, pushing surrounding galaxies apart",
      "D": "A modification to the inverse-square law of gravity at cosmological scales, where Newtonian gravity transitions from attractive to repulsive beyond a characteristic length scale of approximately one gigaparsec, naturally producing the observed accelerating expansion without requiring any new form of energy — this modified gravity approach predicts deviations from general relativity at distances beyond ~1 Gpc"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.100282,
    "y": 0.844423,
    "z": 0.347012,
    "source_article": "dark energy",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "dark energy",
      "accelerating expansion",
      "cosmological constant",
      "negative pressure",
      "Friedmann equations"
    ]
  },
  {
    "id": "497131b53d7b5490",
    "question_text": "Stellar nucleosynthesis in massive stars produces elements up to iron (Fe-56) in their cores, but not heavier. Why does fusion stop at iron?",
    "options": {
      "A": "Iron nuclei are physically too large to fit inside the stellar core at the extreme pressures and temperatures present during the final stages of silicon shell burning — the nuclear radius of iron-56 exceeds the average inter-nuclear spacing, preventing the close approach needed for further fusion reactions to proceed",
      "B": "The temperature required to initiate iron fusion exceeds the core temperature achievable by any star, including the most massive stars known — even at core temperatures above $10^{10}$ kelvin, the Coulomb barrier for iron-iron fusion is insurmountable because the nuclear charge ($Z = 26$) creates an electrostatic repulsion that cannot be overcome by thermal kinetic energy under any realistic stellar conditions",
      "C": "Iron-56 has the highest binding energy per nucleon of any nucleus — fusing iron into heavier elements requires energy input rather than releasing energy, so iron fusion cannot sustain the star against gravitational collapse",
      "D": "Iron is not produced by stellar nucleosynthesis at all — it is a primordial element synthesized exclusively during Big Bang nucleosynthesis in the first three minutes after the initial singularity, and all iron found in the universe today was created during that epoch before being dispersed into the interstellar medium"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.379509,
    "y": 0.788475,
    "z": 0.696761,
    "source_article": "iron peak",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "iron peak",
      "binding energy per nucleon",
      "stellar nucleosynthesis",
      "nuclear fusion limit"
    ]
  },
  {
    "id": "18529d46d15c8d76",
    "question_text": "The Eddington luminosity sets an upper limit on a star's brightness by balancing radiation pressure against gravitational attraction. Some objects, such as ultraluminous X-ray sources (ULXs), appear to exceed this limit. What does super-Eddington luminosity imply about the accretion geometry?",
    "options": {
      "A": "The Eddington limit applies strictly only to spherically symmetric accretion — super-Eddington luminosity is physically impossible",
      "B": "Super-Eddington sources violate conservation of energy, so the observations must be measurement errors",
      "C": "Super-Eddington luminosity is caused by gravitational lensing that amplifies the apparent brightness of normal sources",
      "D": "The Eddington limit assumes spherically symmetric, isotropic radiation pressure — non-spherical accretion geometries (such as geometrically thick disks, beamed outflows, or photon-bubble instabilities) can channel radiation along preferred directions, allowing the total luminosity to exceed the spherical Eddington value while maintaining local equilibrium along the accretion flow"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.234762,
    "y": 0.8509,
    "z": 0.335828,
    "source_article": "Eddington luminosity",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Eddington luminosity",
      "super-Eddington accretion",
      "radiation pressure",
      "accretion geometry",
      "ultraluminous X-ray source"
    ]
  },
  {
    "id": "a535ff04593e65cf",
    "question_text": "Gamma-ray bursts (GRBs) are the most energetic explosions in the universe, releasing ~$10^{44}$ J in seconds. The 'compactness problem' initially seemed to rule out cosmological distances for GRBs. What is this problem and how is it resolved?",
    "options": {
      "A": "The enormous gamma-ray luminosity from a compact source implies such high photon density that photon-photon pair production ($\\gamma\\gamma \\to e^+e^-$) should create an opaque fireball, preventing gamma rays from escaping — this is resolved by ultra-relativistic bulk motion (Lorentz factors $\\Gamma \\sim 100$-$1000$) of the emitting material, which reduces the photon density in the comoving frame and collimates the emission into a narrow beam",
      "B": "GRBs appear more compact than they actually are due to gravitational lensing by intervening galaxy clusters",
      "C": "The compactness problem proves that GRBs must originate within the Milky Way, not at cosmological distances",
      "D": "GRBs are too bright to be cosmological because the implied energy would exceed the total mass-energy of any known astrophysical object"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.130792,
    "y": 0.837052,
    "z": 0.558359,
    "source_article": "gamma-ray burst",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "gamma-ray burst",
      "compactness problem",
      "relativistic beaming",
      "Lorentz factor",
      "pair production"
    ]
  },
  {
    "id": "5d64b02870d13093",
    "question_text": "The Tully-Fisher relation correlates a spiral galaxy's luminosity with its rotation velocity. What underlying physical principle explains this correlation?",
    "options": {
      "A": "Faster-rotating spiral galaxies are systematically closer to Earth due to a selection effect in galaxy surveys, making them appear brighter simply because of their reduced distance rather than any intrinsic connection between rotation speed and stellar luminosity — this Malmquist-type observational bias creates a spurious correlation that has been misinterpreted as a genuine physical relationship between mass and light output",
      "B": "Galaxy luminosity is proportional to stellar mass, and rotation velocity reflects total (dark + baryonic) mass through virial equilibrium — more massive galaxies have both more stars (higher luminosity) and deeper gravitational potential wells (higher rotation velocity), creating the observed correlation",
      "C": "A galaxy's rotation velocity determines the bulk Doppler shift of its integrated starlight through relativistic beaming effects — the approaching side of the rotating disk appears blue-shifted and brightened, while the receding side is red-shifted and dimmed, and this asymmetry is misinterpreted by photometric surveys as higher total luminosity for faster-rotating galaxies",
      "D": "The Tully-Fisher correlation is purely coincidental with no underlying physical basis, arising from statistical artifacts in small galaxy samples"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.216547,
    "y": 0.89882,
    "z": 0.586166,
    "source_article": "Tully-Fisher relation",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Tully-Fisher relation",
      "galaxy rotation",
      "dark matter halo",
      "virial theorem",
      "distance indicator"
    ]
  },
  {
    "id": "60190e1849b90b64",
    "question_text": "Primordial nucleosynthesis (Big Bang nucleosynthesis, BBN) produced the lightest elements in the first few minutes after the Big Bang. The predicted abundances of deuterium, helium-3, helium-4, and lithium-7 depend sensitively on one cosmological parameter. Which parameter?",
    "options": {
      "A": "The cosmological constant $\\Lambda$, which controls the late-time expansion rate of the universe, is the key parameter governing primordial element abundances because it determines how quickly the temperature dropped below the nuclear reaction threshold, setting the duration of the nucleosynthetic epoch and the final yields of helium, deuterium, and lithium",
      "B": "The mass of the Higgs boson, which sets the quark masses and therefore determines the binding energies of all nuclei through the strong nuclear force, controlling which fusion reactions are energetically favorable during primordial nucleosynthesis",
      "C": "The baryon-to-photon ratio $\\eta$ — a higher ratio means more baryons available for nuclear reactions, producing more helium-4 and less deuterium, since deuterium is an intermediate that gets fused into helium more efficiently at higher baryon density",
      "D": "The total amount of cold dark matter in the universe, which catalyzes nuclear reactions in the early universe through gravitational compression of baryonic matter into dense pockets where nucleosynthesis proceeds more efficiently"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.199355,
    "y": 0.784508,
    "z": 0.801477,
    "source_article": "Big Bang nucleosynthesis",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Big Bang nucleosynthesis",
      "baryon-to-photon ratio",
      "primordial abundances",
      "deuterium",
      "helium-4"
    ]
  },
  {
    "id": "ef912307059a8e65",
    "question_text": "Gravitational wave detectors like LIGO measure spacetime distortions of order $\\Delta L/L \\sim 10^{-21}$. For LIGO's 4-km arms, this corresponds to a displacement smaller than $10^{-18}$ meters — less than one-thousandth the diameter of a proton. How does LIGO achieve such extraordinary sensitivity?",
    "options": {
      "A": "LIGO uses a single continuous-wave laser beam emitted from one end of a 4-kilometer vacuum tube, bounced off a highly reflective mirror at the far end, and returned to the source where the round-trip travel time is measured to picosecond precision using atomic clock technology — a passing gravitational wave would change the arm length by $\\sim 10^{-18}$ m, altering the round-trip time by approximately $10^{-26}$ seconds, which is detected as a phase shift in the returning laser signal compared to the reference clock, and multiple consecutive measurements are averaged to reduce timing noise below the quantum limit",
      "B": "LIGO directly photographs the spatial distortion of its vacuum tubes caused by passing gravitational waves using ultra-high-resolution CCD cameras positioned along the length of each arm — these cameras detect the physical bending and stretching of the steel vacuum enclosure at the sub-atomic level, and by comparing sequential images taken at nanosecond intervals, the detector can reconstruct the gravitational wave's amplitude and frequency profile as it propagates through the instrument, producing the characteristic chirp waveform associated with binary black hole mergers",
      "C": "LIGO detects gravitational waves through the thermal energy they deposit in the detector arms as the wave passes through — the periodic compression and stretching of the arm material converts gravitational wave energy into heat through internal friction, and this minuscule temperature change ($\\sim 10^{-15}$ kelvin) is measured by arrays of superconducting transition-edge bolometers mounted along each arm that operate at millikelvin temperatures, providing the sensitivity needed to detect astrophysical gravitational wave signals above the thermal noise floor",
      "D": "LIGO uses a Michelson interferometer with Fabry-Pérot cavities in each arm — a laser beam is split and sent down perpendicular arms, and a gravitational wave differentially stretches one arm while compressing the other, creating a phase shift in the recombined beams that appears as an interference pattern change. The Fabry-Pérot cavities effectively multiply the arm length by ~300, and quantum noise reduction techniques (squeezed light) push sensitivity to the quantum limit"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.07746,
    "y": 0.858106,
    "z": 0.342656,
    "source_article": "LIGO",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "LIGO",
      "gravitational wave detection",
      "Michelson interferometer",
      "Fabry-Pérot cavity",
      "laser interferometry"
    ]
  },
  {
    "id": "f87112a85bc6c4c0",
    "question_text": "Stars on the main sequence generate energy through nuclear fusion. What is the primary fusion process powering a star like our Sun?",
    "options": {
      "A": "The proton-proton chain, which fuses hydrogen nuclei into helium-4 through a series of intermediate steps, releasing energy as positrons, neutrinos, and gamma rays",
      "B": "The CNO cycle, which uses carbon, nitrogen, and oxygen as catalysts and dominates only in stars significantly more massive than the Sun due to its steep temperature dependence",
      "C": "The triple-alpha process, which fuses three helium nuclei into carbon-12 and occurs primarily in red giant cores after hydrogen exhaustion, not during main-sequence hydrogen burning",
      "D": "Direct proton-proton annihilation with electrons, converting hydrogen atoms directly into pure radiant energy without producing any heavier elements as nuclear byproducts in the process"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.381929,
    "y": 0.858976,
    "z": 0.974572,
    "source_article": "stellar nucleosynthesis",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "stellar nucleosynthesis",
      "proton-proton chain",
      "main sequence",
      "solar energy"
    ]
  },
  {
    "id": "e5f2ea2008109055",
    "question_text": "The Hertzsprung-Russell diagram plots stars by luminosity versus temperature. Where on this diagram do most stars spend the majority of their lives?",
    "options": {
      "A": "In the red giant branch at upper right, where stars spend 90% of their total lifetime as cool, luminous giants before briefly contracting to the main sequence during their final evolutionary stages",
      "B": "On the main sequence, a diagonal band running from hot luminous upper-left to cool dim lower-right, where stars fuse hydrogen to helium in hydrostatic equilibrium",
      "C": "In the white dwarf region at lower left, where most stars begin their lives as compact hot objects before expanding outward to become giants and supergiants",
      "D": "In the instability strip, oscillating between giant and dwarf states throughout their entire lives, spending equal time at every point on the HR diagram"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.377499,
    "y": 0.910903,
    "z": 1.0,
    "source_article": "HR diagram",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "HR diagram",
      "main sequence",
      "stellar evolution",
      "hydrostatic equilibrium"
    ]
  },
  {
    "id": "c75b51279fc423c3",
    "question_text": "The cosmic microwave background (CMB) radiation, discovered by Penzias and Wilson in 1965, is thermal radiation filling the observable universe. What does the CMB represent physically?",
    "options": {
      "A": "Infrared radiation emitted by dust grains in the Milky Way's interstellar medium, which has been misidentified as cosmological in origin by scientists who have consistently failed to account for the galactic foreground contamination in their observations",
      "B": "Radio signals from all the stars in the observable universe blended together into a uniform background hiss that increases in intensity as telescope sensitivity improves",
      "C": "The redshifted thermal radiation from the epoch of recombination (~380,000 years after the Big Bang), when the universe cooled enough for electrons and protons to form neutral hydrogen, allowing photons to travel freely",
      "D": "Cerenkov radiation produced by cosmic ray particles exceeding the speed of light in the intergalactic medium, creating a uniform blue glow that only appears as microwaves due to the extreme cosmological redshift applied over billions of light-years of travel"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.064547,
    "y": 0.80348,
    "z": 0.733426,
    "source_article": "cosmic microwave background",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "cosmic microwave background",
      "recombination",
      "Big Bang",
      "thermal radiation"
    ]
  },
  {
    "id": "e8dfc6b2c0393ef0",
    "question_text": "A neutron star is the remnant left after the supernova collapse of a massive star. What physical principle prevents a neutron star from collapsing further into a black hole?",
    "options": {
      "A": "Thermal radiation pressure from ongoing nuclear fusion reactions in the neutron star's core, which continuously generates enormous outward pressure exactly as it does in a main-sequence star, preventing any further gravitational compression through sustained thermonuclear energy generation in the ultra-dense interior",
      "B": "The centrifugal force from the neutron star's extremely rapid rotation, which alone provides all of the structural support needed to resist gravitational collapse regardless of the star's total mass, rotation period, or internal composition, making all spinning neutron stars permanently stable",
      "C": "Electromagnetic repulsion between the positively charged surfaces of adjacent neutrons, which acts like a rigid crystalline lattice preventing any further compression of the stellar material, creating an impenetrable barrier against gravitational forces through electrostatic interactions between the nuclear particles",
      "D": "Neutron degeneracy pressure — a quantum mechanical effect arising from the Pauli exclusion principle, which prevents identical fermions (neutrons) from occupying the same quantum state, creating a pressure that resists further gravitational compression"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.323835,
    "y": 0.841989,
    "z": 0.156077,
    "source_article": "neutron star",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "neutron star",
      "degeneracy pressure",
      "Pauli exclusion principle",
      "stellar remnants"
    ]
  },
  {
    "id": "bd7ae598532806e7",
    "question_text": "Edwin Hubble's 1929 observation established a foundational relationship in cosmology. What did Hubble discover about distant galaxies?",
    "options": {
      "A": "That galaxies are receding from us with velocities proportional to their distances, implying the universe is expanding — a relationship now called Hubble's Law (v = H₀d)",
      "B": "That all galaxies are moving toward a single point in space called the Great Attractor at identical speeds regardless of distance, proving the universe is contracting",
      "C": "That galaxies are stationary and the observed redshifts are caused by photon aging — light losing energy over cosmic distances through a 'tired light' mechanism rather than actual motion",
      "D": "That the Milky Way is the only galaxy in the observable universe and all observed 'nebulae' are actually gas clouds located within our own galaxy rather than separate external island universes at cosmological distances"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.060746,
    "y": 0.896042,
    "z": 0.726023,
    "source_article": "Hubble's Law",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Hubble's Law",
      "expanding universe",
      "cosmological redshift",
      "velocity-distance relation"
    ]
  },
  {
    "id": "5a8a3a3c7eab6bca",
    "question_text": "Type Ia supernovae serve as 'standard candles' for measuring cosmic distances. Why are they useful as distance indicators?",
    "options": {
      "A": "Because they occur only in galaxies at previously known fixed distances that were carefully catalogued and measured by other independent methods before the supernovae exploded, making the entire distance measurement process trivially circular and self-referential",
      "B": "Because they result from white dwarfs accreting matter until reaching the Chandrasekhar limit (~1.4 M☉), producing explosions with remarkably uniform peak luminosities that can be calibrated as distance indicators",
      "C": "Because each supernova emits a unique radio frequency signature that directly encodes its distance in parsecs within the signal's modulation pattern, readable by radio telescopes",
      "D": "Because they are visible only within the Local Group of galaxies and cannot be detected beyond 10 megaparsecs, limiting their usefulness to the nearest cosmic neighborhood"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.16344,
    "y": 0.95844,
    "z": 0.511369,
    "source_article": "Type Ia supernova",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Type Ia supernova",
      "standard candle",
      "Chandrasekhar limit",
      "distance ladder"
    ]
  },
  {
    "id": "c153f2e2cb770693",
    "question_text": "Gravitational lensing occurs when light from distant objects is bent by massive foreground objects. What distinguishes strong lensing from weak lensing?",
    "options": {
      "A": "Strong lensing uses only electromagnetic lenses built into telescope optics at the focal plane, while weak lensing refers to natural gravitational effects occurring in deep space — the terms describe purely instrumental telescope design choices and optical engineering specifications, not distinct astrophysical phenomena observable in nature",
      "B": "Strong lensing occurs only for radio waves while weak lensing affects only visible light, because gravitational deflection depends critically on the photon's wavelength in exactly the same way that dispersion occurs in a glass prism — shorter wavelengths are bent more strongly than longer wavelengths by the gravitational field of any massive foreground object",
      "C": "Strong lensing produces dramatic, directly observable distortions — multiple images, arcs, or Einstein rings of background sources — while weak lensing produces subtle statistical shape distortions detectable only by averaging over many background galaxies",
      "D": "Strong lensing applies exclusively to nearby objects within the Milky Way galaxy while weak lensing applies only to objects located outside the galaxy at extragalactic distances — the distinction is purely one of geometric distance from the observer rather than reflecting any meaningful difference in the magnitude of gravitational deflection or image distortion"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.136968,
    "y": 0.842456,
    "z": 0.483109,
    "source_article": "gravitational lensing",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "gravitational lensing",
      "strong lensing",
      "weak lensing",
      "general relativity"
    ]
  },
  {
    "id": "1d74862305cc0cc5",
    "question_text": "Pulsars are rapidly rotating neutron stars that emit beams of electromagnetic radiation. What mechanism produces the observed regular pulses?",
    "options": {
      "A": "The neutron star physically pulsates in size, expanding and contracting like a Cepheid variable, and the brightness changes are caused by the changing surface area emitting thermal radiation",
      "B": "The pulses are caused by the neutron star orbiting a companion star at extremely high speed and being periodically eclipsed by its massive binary partner during each rapid orbital revolution around their shared center of mass",
      "C": "Charged particles spiraling along magnetic field lines lose energy near the magnetic poles, and the entire star occasionally flashes as stored magnetic energy is released in explosive reconnection events",
      "D": "The neutron star's magnetic axis is misaligned with its rotation axis, so the beam of radiation emitted along the magnetic poles sweeps past Earth like a lighthouse beam with each rotation"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.287892,
    "y": 0.879204,
    "z": 0.419486,
    "source_article": "pulsar",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "pulsar",
      "lighthouse model",
      "magnetic axis",
      "neutron star rotation"
    ]
  },
  {
    "id": "f98f785834b6bbfc",
    "question_text": "The observable universe has a finite size despite the Big Bang not being an explosion from a central point. Why is there a limit to how far we can observe?",
    "options": {
      "A": "Because the universe has a finite age (~13.8 billion years) and light travels at a finite speed, so we can only see objects whose light has had time to reach us — the particle horizon defines this boundary, currently at ~46.5 billion light-years due to expansion",
      "B": "Because the universe is enclosed inside a physical wall made of exotic matter at its outermost edge, beyond which absolutely no space exists at all, and this impenetrable wall completely blocks all electromagnetic radiation from any source beyond it from ever reaching us, creating a hard boundary to the observable cosmos",
      "C": "Because telescopes have a maximum possible angular resolution determined by the quantum uncertainty principle, and no technological advancement or engineering improvement can ever extend astronomical observations beyond approximately one billion light-years regardless of aperture size, wavelength, or observing technique",
      "D": "Because all objects beyond a certain distance are moving away faster than light and have therefore ceased to exist entirely, having been destroyed by exceeding the cosmic speed limit"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.0552,
    "y": 0.841133,
    "z": 0.549975,
    "source_article": "observable universe",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "observable universe",
      "particle horizon",
      "cosmic expansion",
      "finite age"
    ]
  },
  {
    "id": "8d695c64065293c6",
    "question_text": "The interstellar medium (ISM) contains various phases of gas and dust between stars. What role does the ISM play in the lifecycle of stars?",
    "options": {
      "A": "The ISM is completely inert and plays absolutely no role in star formation whatsoever — stars form exclusively through the direct gravitational collapse of dark matter halos without any involvement of ordinary baryonic gas, dust, or molecular material at any stage of the formation or evolutionary process from protostar to main-sequence",
      "B": "The ISM provides the raw material for star formation: molecular clouds within the ISM collapse under gravity to form protostars, and when stars die, their enriched material returns to the ISM — creating a galactic recycling process that progressively increases metallicity",
      "C": "The ISM consists entirely of ionized antimatter left over from the Big Bang, and contact between ISM antimatter and stellar matter is what powers supernova explosions through matter-antimatter annihilation",
      "D": "The ISM absorbs and permanently destroys all electromagnetic radiation passing through it at every wavelength simultaneously, making stars located beyond approximately 100 light-years completely invisible to any telescope regardless of its sensitivity, aperture, wavelength coverage, or observational technique employed by astronomers"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.318407,
    "y": 0.873058,
    "z": 0.839773,
    "source_article": "interstellar medium",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "interstellar medium",
      "star formation",
      "galactic chemical evolution",
      "molecular clouds"
    ]
  },
  {
    "id": "a03d998fd3d4afd0",
    "question_text": "Dark energy, which constitutes approximately 68% of the total energy density of the universe, was discovered through observations of distant Type Ia supernovae. What is the observed effect attributed to dark energy?",
    "options": {
      "A": "The formation of large-scale cosmic voids where dark energy has pushed all matter to the outer edges, creating perfectly empty spherical regions of exactly equal size distributed uniformly throughout the universe",
      "B": "The gradual deceleration and eventual reversal of cosmic expansion, which will cause the universe to collapse back to a singularity within approximately 10 billion years",
      "C": "The accelerating expansion of the universe — distant supernovae appear dimmer than expected for a decelerating universe, indicating that the expansion rate is increasing over time rather than slowing down",
      "D": "The complete halting of all star formation throughout the universe starting approximately 5 billion years ago, as dark energy suppresses gravitational collapse of molecular clouds at all scales"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.125581,
    "y": 0.853588,
    "z": 0.561327,
    "source_article": "dark energy",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "dark energy",
      "accelerating expansion",
      "Type Ia supernovae",
      "cosmological constant"
    ]
  },
  {
    "id": "e4e5f4294b477d73",
    "question_text": "Active galactic nuclei (AGN) are among the most luminous persistent objects in the universe. What powers the enormous energy output of an AGN?",
    "options": {
      "A": "Extremely rapid nuclear fusion of heavy elements including iron, gold, and uranium at the galaxy's center, where temperatures and pressures far exceed those found inside normal stellar cores, creating sustained thermonuclear reactions in superheavy nuclei",
      "B": "The simultaneous explosion of millions of supernovae concentrated in the galactic core, creating a sustained chain reaction of stellar detonations",
      "C": "A network of artificially constructed energy collectors built by advanced extraterrestrial civilizations to harvest starlight from billions of stars, as proposed by the Dyson sphere hypothesis extended and adapted to operate at galactic scales",
      "D": "Accretion of matter onto a supermassive black hole — gravitational potential energy is converted to radiation as infalling material forms a hot accretion disk, producing luminosities that can outshine the entire host galaxy"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.255365,
    "y": 0.787735,
    "z": 0.69439,
    "source_article": "active galactic nuclei",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "active galactic nuclei",
      "accretion disk",
      "supermassive black hole",
      "AGN luminosity"
    ]
  },
  {
    "id": "c45f067ab87edc0e",
    "question_text": "The Chandrasekhar limit determines the maximum mass of a stable white dwarf. What happens physically when a white dwarf exceeds this limit?",
    "options": {
      "A": "Electron degeneracy pressure can no longer support the star against gravitational collapse — the white dwarf either undergoes thermonuclear detonation (Type Ia supernova) or collapses further to form a neutron star, depending on the scenario",
      "B": "The white dwarf simply becomes a larger, more massive white dwarf with no qualitative change in its internal physics, because degeneracy pressure scales linearly with mass without any upper limit",
      "C": "The white dwarf immediately evaporates through Hawking radiation, as any stellar remnant above the Chandrasekhar mass spontaneously converts all its mass into thermal photons within microseconds",
      "D": "The excess mass is ejected in a steady stellar wind that precisely maintains the white dwarf at exactly the Chandrasekhar limit indefinitely, through a self-regulating feedback mechanism"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.300105,
    "y": 0.886172,
    "z": 0.051519,
    "source_article": "Chandrasekhar limit",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Chandrasekhar limit",
      "white dwarf",
      "electron degeneracy",
      "Type Ia supernova"
    ]
  },
  {
    "id": "be0157443147331b",
    "question_text": "Stellar parallax is the apparent shift in a star's position as Earth orbits the Sun. Why was parallax historically difficult to measure, and what does it directly yield?",
    "options": {
      "A": "Parallax is easily visible to the naked eye for all stars and was measured accurately by ancient Greek astronomers using simple geometric tools, providing reliable distances to stars throughout the entire Milky Way disk without requiring any telescopic instruments, mathematical modeling, or space-based satellite observatories",
      "B": "Parallax angles for even the nearest stars are extremely small (less than 1 arcsecond), requiring precise astrometry — the measured angle directly yields the star's distance, with 1 arcsecond of parallax corresponding to a distance of 1 parsec (3.26 light-years)",
      "C": "Parallax measures a star's surface temperature rather than its distance, by detecting the angular size of the star's photosphere as it expands and contracts due to pulsation over the course of Earth's orbit",
      "D": "Parallax was abandoned in the 17th century after Newton proved that light travels instantaneously and therefore no angular displacement can occur due to Earth's orbital motion around the Sun"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.149914,
    "y": 0.987814,
    "z": 0.670019,
    "source_article": "stellar parallax",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "stellar parallax",
      "parsec",
      "astrometry",
      "distance measurement"
    ]
  },
  {
    "id": "799fbf6c73f80289",
    "question_text": "The Jeans instability criterion determines when a gas cloud will collapse to form stars. What two competing forces does the Jeans criterion balance?",
    "options": {
      "A": "Electromagnetic radiation pressure pushing outward versus dark energy pulling inward, with gravitational collapse occurring when dark energy dominates over radiation pressure on molecular cloud scales within the interstellar medium",
      "B": "The strong nuclear force binding nuclei together versus the weak nuclear force driving radioactive decay, with the Jeans mass being the atomic mass at which these forces are exactly equal",
      "C": "Gravitational attraction pulling the cloud inward versus thermal (gas) pressure pushing outward — collapse occurs when the cloud's mass exceeds the Jeans mass, meaning gravity overwhelms thermal support",
      "D": "Magnetic pressure from the galaxy's large-scale coherent field versus tidal forces from the nearest supermassive black hole, with the Jeans length being the critical distance at which tidal disruption forces overcome magnetic confinement"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.269807,
    "y": 0.85695,
    "z": 0.512915,
    "source_article": "Jeans instability",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Jeans instability",
      "gravitational collapse",
      "thermal pressure",
      "star formation criteria"
    ]
  },
  {
    "id": "e00d26b133f6cc8f",
    "question_text": "The cosmic distance ladder uses successive methods to measure distances at increasing scales. What is the correct ordering of distance measurement techniques from nearest to farthest?",
    "options": {
      "A": "Hubble's Law redshifts, then Type Ia supernovae, then Cepheid period-luminosity, then radar ranging: starting with the most distant cosmological measurements and systematically working inward to calibrate increasingly local distance measurement techniques in reverse order from farthest to nearest",
      "B": "Cepheid variables → radar ranging → Type Ia supernovae → stellar parallax: mixing up the sequence so that each rung measures distances shorter than the previous one",
      "C": "All methods work equally well at all distances with identical precision — there is no 'ladder' because every technique can independently measure any distance from 1 AU to 10 billion light-years",
      "D": "Radar ranging (solar system) → stellar parallax (nearby stars) → Cepheid period-luminosity relation (nearby galaxies) → Type Ia supernovae (cosmological distances): each rung calibrates the next, extending measurement reach progressively outward"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.080961,
    "y": 0.99,
    "z": 0.775155,
    "source_article": "cosmic distance ladder",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "cosmic distance ladder",
      "calibration",
      "Cepheids",
      "standard candles"
    ]
  },
  {
    "id": "717d44d36f3edc0c",
    "question_text": "The virial theorem relates a gravitationally bound system's kinetic and potential energies. How is the virial theorem applied to estimate the total mass of galaxy clusters?",
    "options": {
      "A": "By measuring the velocities of galaxies within the cluster — the virial theorem states that for a relaxed system, 2⟨K⟩ + ⟨U⟩ = 0, so the velocity dispersion reveals the total gravitational mass, which consistently exceeds the visible mass, providing evidence for dark matter",
      "B": "By counting the total number of stars visible in the cluster and multiplying by the Sun's mass, with no consideration of galaxy velocities, gas content, or any invisible matter components",
      "C": "By measuring the cluster's total luminosity in visible light and assuming a universal mass-to-light ratio of exactly one solar mass per solar luminosity for all stellar populations regardless of their age, metallicity, star formation history, or initial mass function, ignoring dark matter entirely",
      "D": "By measuring the gravitational redshift of light escaping the cluster's potential well and converting this directly to mass using a formula derived from special relativity alone without any general relativistic corrections"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.159355,
    "y": 0.84473,
    "z": 0.50728,
    "source_article": "virial theorem",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "virial theorem",
      "galaxy cluster mass",
      "dark matter evidence",
      "velocity dispersion"
    ]
  },
  {
    "id": "e394994ad00f81f5",
    "question_text": "Primordial nucleosynthesis (Big Bang nucleosynthesis, BBN) produced the lightest elements in the first few minutes after the Big Bang. What elements were synthesized, and why did BBN stop at lithium-7?",
    "options": {
      "A": "BBN produced all elements up to iron-56, just as stellar nucleosynthesis does, because conditions in the early universe were essentially identical to those in stellar cores for the first billion years",
      "B": "BBN produced primarily hydrogen (~75%) and helium-4 (~25%) by mass, with trace amounts of deuterium, helium-3, and lithium-7 — it stopped because the universe expanded and cooled too rapidly for heavier nuclei to form, and there is no stable nucleus at mass 5 or 8 to bridge to heavier elements",
      "C": "BBN produced only pure hydrogen with no heavier elements at all — all helium in the universe was produced later inside the first generation of stars during the epoch of reionization",
      "D": "BBN produced equal quantities of all 92 naturally occurring elements in exactly solar abundance ratios, distributing them uniformly throughout the primordial plasma"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.226196,
    "y": 0.76,
    "z": 0.786376,
    "source_article": "Big Bang nucleosynthesis",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Big Bang nucleosynthesis",
      "primordial abundances",
      "mass-5 gap",
      "deuterium"
    ]
  },
  {
    "id": "5c161f17b4c91623",
    "question_text": "Gravitational wave astronomy began with LIGO's 2015 detection of GW150914. What was the source of this first detected gravitational wave signal?",
    "options": {
      "A": "Gravitational wave resonances in the early universe created standing wave patterns with a fixed wavelength determined by the graviton mass, and galaxies formed preferentially at the nodes of these primordial gravitational wave harmonics throughout all of cosmic history from recombination onward",
      "B": "Dark energy's repulsive force creates evenly spaced voids in the galaxy distribution at a scale determined entirely by the cosmological constant's value, with the BAO scale being a direct and unambiguous measurement of the dark energy equation of state parameter without requiring any additional calibration",
      "C": "The merger of two stellar-mass black holes (~36 and ~29 solar masses) spiraling inward and coalescing, producing a characteristic 'chirp' signal that matched general relativity's predictions with extraordinary precision",
      "D": "Magnetic fields generated during the Big Bang organized primordial matter into regularly spaced filaments with a characteristic separation determined by the magnetic coherence length, and galaxies subsequently formed along these magnetized filaments following the field geometry"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.081483,
    "y": 0.815039,
    "z": 0.426367,
    "source_article": "gravitational waves",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "gravitational waves",
      "LIGO",
      "black hole merger",
      "GW150914"
    ]
  },
  {
    "id": "209e68188980fe5d",
    "question_text": "The Eddington luminosity sets an upper limit on the sustained luminosity of an accreting object. What physical balance defines this limit?",
    "options": {
      "A": "The balance between gravitational potential energy release from infalling matter heating the accretion disk and thermal conduction losses through the disk's outer boundary into the surrounding interstellar medium",
      "B": "The balance between the buoyancy force of hot gas rising through the accretion column and the Coriolis force deflecting material sideways due to the object's rotation",
      "C": "The balance between the rate of matter-antimatter pair production in the accretion disk and the rate of pair annihilation, which determines the maximum sustainable luminosity",
      "D": "The balance between outward radiation pressure on infalling material (primarily via Thomson scattering of photons off electrons) and inward gravitational force — above this luminosity, radiation pressure halts accretion"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.206572,
    "y": 0.834621,
    "z": 0.419013,
    "source_article": "Eddington luminosity",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Eddington luminosity",
      "radiation pressure",
      "Thomson scattering",
      "accretion limit"
    ]
  },
  {
    "id": "7835d8968b2a1401",
    "question_text": "Cosmic inflation, proposed by Alan Guth in 1981, posits a brief period of exponential expansion in the very early universe. What observational problem does inflation solve that the standard Big Bang model alone cannot?",
    "options": {
      "A": "Inflation solves the horizon problem — why the CMB temperature is uniform to ~1 part in 10⁵ across regions that would not have been in causal contact in the standard Big Bang model, by stretching a tiny causally connected patch to encompass the entire observable universe",
      "B": "The star's color determines disruption — red stars are always disrupted while blue stars are always swallowed whole, because the strength of the tidal force depends primarily on the star's surface temperature, spectral class, and color index rather than on any gravitational parameters involving the black hole's mass or the orbital pericenter distance",
      "C": "All stars are always swallowed whole regardless of the black hole's mass or the star's orbital parameters, because the gravitational field near a black hole is perfectly uniform and exerts absolutely no differential tidal force on any extended object at any distance from the event horizon, making tidal disruption physically impossible",
      "D": "Whether the star is rotating prograde or retrograde relative to the black hole's spin axis — prograde stars are always tidally disrupted while retrograde stars are always captured intact because frame-dragging effects from the black hole's angular momentum completely cancel all tidal forces in the retrograde direction"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.052743,
    "y": 0.807016,
    "z": 0.746343,
    "source_article": "cosmic inflation",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "cosmic inflation",
      "horizon problem",
      "CMB uniformity",
      "Alan Guth"
    ]
  },
  {
    "id": "a0d7c570de38595c",
    "question_text": "Tidal disruption events (TDEs) occur when a star passes too close to a supermassive black hole. What determines whether a star is disrupted versus swallowed whole?",
    "options": {
      "A": "CMB photons passing through the hot intracluster medium are absorbed and re-emitted at a completely different frequency determined by the temperature of the intracluster gas, creating a characteristic emission line that is distance-independent because all galaxy clusters have identical gas temperatures regardless of their total mass, redshift, dynamical state, or formation history — this uniform temperature is a consequence of a universal thermodynamic equilibrium established during structure formation",
      "B": "Whether the tidal radius (where the black hole's tidal force exceeds the star's self-gravity) lies outside or inside the event horizon — for lower-mass black holes the tidal radius exceeds the Schwarzschild radius, disrupting the star visibly; for the most massive black holes, stars cross the event horizon intact before tidal forces can tear them apart",
      "C": "The SZ effect is a gravitational redshift of CMB photons as they climb out of the galaxy cluster's gravitational potential well, and it is distance-independent because the gravitational field depends only on the total enclosed mass of the cluster, which is assumed to be constant for all clusters at all redshifts — this makes every cluster produce an identical spectral distortion regardless of its location, mass, or dynamical state, simplifying cluster cosmology enormously",
      "D": "Galaxy clusters absorb CMB photons from the cosmic background radiation field and re-emit them at much lower radio wavelengths through synchrotron radiation from relativistic electrons spiraling along intracluster magnetic field lines, producing a distinctive non-thermal radio halo that is distance-independent because synchrotron luminosity depends only on magnetic field strength and electron energy density, which are universally identical"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.259731,
    "y": 0.896766,
    "z": 0.46724,
    "source_article": "tidal disruption events",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "tidal disruption events",
      "tidal radius",
      "Schwarzschild radius",
      "supermassive black hole"
    ]
  },
  {
    "id": "8e4c9867267c0013",
    "question_text": "The Sunyaev-Zel'dovich (SZ) effect is used to detect galaxy clusters. What physical process produces this effect, and why is it distance-independent?",
    "options": {
      "A": "The SZ effect is a gravitational redshift of CMB photons as they climb out of the cluster's gravitational potential well, and it is distance-independent because the gravitational field depends only on mass, which is constant",
      "B": "Galaxy clusters emit their own microwave radiation that mimics the CMB but at a slightly different temperature, and this emission is distance-independent because all clusters have identical temperatures regardless of mass or redshift",
      "C": "CMB photons passing through the hot intracluster medium gain energy via inverse Compton scattering off energetic electrons, creating a characteristic spectral distortion — this is distance-independent because it measures the integrated electron pressure along the line of sight, not the cluster's flux",
      "D": "Galaxy clusters absorb CMB photons and re-emit them at radio wavelengths through synchrotron radiation from relativistic electrons spiraling in magnetic fields"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.132117,
    "y": 0.828037,
    "z": 0.512798,
    "source_article": "Sunyaev-Zel'dovich effect",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Sunyaev-Zel'dovich effect",
      "inverse Compton scattering",
      "CMB distortion",
      "cluster detection"
    ]
  },
  {
    "id": "cf13372779cb051d",
    "question_text": "Baryon acoustic oscillations (BAOs) imprint a characteristic scale in the large-scale distribution of galaxies. What physical process created this preferred scale?",
    "options": {
      "A": "Reionization was caused by the decay of radioactive dark matter particles into ionizing photons at a constant rate throughout cosmic history, and it is constrained by the absence of specific radioactive isotopes in the oldest observed carbonaceous chondrite meteorites in the inner solar system, placing the epoch of reionization conclusively at redshift z ≈ 3 — well after the first galaxies had already formed and evolved through multiple stellar generations",
      "B": "Ultraviolet radiation from the first stars and galaxies gradually ionized the neutral hydrogen that filled the entire universe after recombination — the Gunn-Peterson trough (complete Lyman-alpha absorption observed in the spectra of high-redshift quasars) and CMB polarization measurements from the Planck satellite indicate that reionization was largely complete by z ≈ 6, spanning roughly the redshift range z ≈ 6-15",
      "C": "Magnetic fields from the Big Bang organized primordial matter into regularly spaced filaments with a characteristic separation determined by the magnetic coherence length, and galaxies formed along these magnetized filaments",
      "D": "Before recombination, baryons and photons were coupled in a plasma where gravitational collapse competed with radiation pressure, creating acoustic oscillations — at recombination, these sound waves froze in, leaving a preferred clustering scale of ~490 million light-years (the sound horizon) imprinted in the matter distribution"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.081703,
    "y": 0.80197,
    "z": 0.652798,
    "source_article": "baryon acoustic oscillations",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "baryon acoustic oscillations",
      "sound horizon",
      "recombination",
      "large-scale structure"
    ]
  },
  {
    "id": "b86a46e086aff600",
    "question_text": "The epoch of reionization marks a major phase transition in the universe's history. What process drove reionization, and what observational evidence constrains when it occurred?",
    "options": {
      "A": "Ultraviolet radiation from the first stars and galaxies gradually ionized the neutral hydrogen that filled the universe after recombination — the Gunn-Peterson trough (complete Lyman-alpha absorption in high-z quasar spectra) and CMB polarization measurements indicate reionization was largely complete by z ≈ 6, spanning roughly z ≈ 6-15",
      "B": "Reionization was caused by the decay of radioactive dark matter particles into ionizing photons, and it is constrained by the absence of radioactive isotopes in the oldest observed meteorites, placing the epoch at z ≈ 3",
      "C": "Reionization never occurred — the universe has contained only ionized hydrogen since the Big Bang, and the concept of a neutral hydrogen epoch is a theoretical prediction that has been observationally disproven by the uniform transparency of the intergalactic medium at all redshifts",
      "D": "Cosmic ray particles from supermassive black hole jets ionized the entire universe simultaneously and instantaneously at z = 1, as evidenced by the sharp cutoff in galaxy number counts at that redshift"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.147988,
    "y": 0.791725,
    "z": 0.670067,
    "source_article": "reionization",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "reionization",
      "Gunn-Peterson trough",
      "Lyman-alpha",
      "first stars"
    ]
  },
  {
    "id": "8d6ae36f39835803",
    "question_text": "The r-process (rapid neutron capture) synthesizes approximately half of all elements heavier than iron. What astrophysical site has been confirmed as an r-process source, and what was the key observation?",
    "options": {
      "A": "Solar flares on Sun-like stars have been conclusively confirmed as the dominant r-process nucleosynthesis site, with detailed spectroscopic analysis of the Sun's corona revealing the ongoing synthesis of gold, platinum, and other heavy elements during each eleven-year solar maximum cycle",
      "B": "Neutron star mergers were confirmed as an r-process site when the 2017 gravitational wave event GW170817 was accompanied by a kilonova (AT2017gfo) whose optical/infrared spectrum showed signatures of freshly synthesized r-process elements including lanthanides",
      "C": "White dwarf surfaces accumulate r-process elements from the interstellar medium, and this was confirmed by detecting heavy elements in the spectra of nearby white dwarfs, proving that accretion rather than nucleosynthesis is the source of all heavy elements",
      "D": "The Big Bang itself produced all r-process elements during the first microsecond, and this was confirmed by the uniform distribution of heavy elements throughout the universe at all redshifts with no evolution over cosmic time"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.297235,
    "y": 0.803513,
    "z": 0.63424,
    "source_article": "r-process nucleosynthesis",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "r-process nucleosynthesis",
      "neutron star merger",
      "kilonova",
      "GW170817"
    ]
  },
  {
    "id": "5313d7a9c8eb9ab5",
    "question_text": "The Tolman-Oppenheimer-Volkoff (TOV) limit is the neutron star analogue of the Chandrasekhar limit for white dwarfs. How does the TOV limit differ from the Chandrasekhar limit in its underlying physics?",
    "options": {
      "A": "The Chandrasekhar limit uses Newtonian gravity with non-relativistic electron degeneracy pressure, while the TOV limit uses only Newtonian gravity with non-relativistic neutron degeneracy pressure — the two limits differ only in which particle species provides the degeneracy pressure (electrons versus neutrons) and there are no relativistic corrections involved in either calculation, making both derivations purely classical exercises in Newtonian gravitational physics and simple quantum statistical mechanics",
      "B": "The TOV limit is exactly equal to the Chandrasekhar limit (1.4 solar masses) because both arise from identical physics applied to identical particle species, and any observed neutron stars above 1.4 solar masses are measurement errors",
      "C": "The Chandrasekhar limit uses Newtonian gravity with special-relativistic electron degeneracy pressure, while the TOV limit requires full general relativity because neutron star densities approach nuclear density — GR corrections increase the effective gravitational pull, lowering the maximum stable mass below what Newtonian calculations would predict",
      "D": "The TOV limit is infinite — there is no upper mass limit for neutron stars because neutron degeneracy pressure increases without bound as mass increases, and neutron stars of any mass are theoretically stable"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.246983,
    "y": 0.883255,
    "z": 0.0,
    "source_article": "TOV limit",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "TOV limit",
      "Chandrasekhar limit",
      "general relativity",
      "neutron star structure"
    ]
  },
  {
    "id": "660e9a1e62c24a4b",
    "question_text": "The Sachs-Wolfe effect explains part of the temperature anisotropies in the cosmic microwave background. What are the two components of this effect, and what physical processes do they describe?",
    "options": {
      "A": "The ordinary Sachs-Wolfe effect describes gravitational lensing of CMB photons by galaxy clusters, while the integrated Sachs-Wolfe effect describes the same lensing by dark matter filaments — both modify the CMB's apparent angular power spectrum through deflection rather than energy change",
      "B": "The primary Sachs-Wolfe effect describes CMB photons being absorbed and re-emitted by interstellar dust in the Milky Way, while the secondary effect describes the same process occurring in other galaxies along the line of sight — both are foreground contamination rather than cosmological signals",
      "C": "The Sachs-Wolfe effect has only one component: the Doppler shift of CMB photons caused by Earth's motion through space, which produces a dipole anisotropy but no higher-order temperature fluctuations",
      "D": "The ordinary (early) Sachs-Wolfe effect: photons from denser regions at last scattering are gravitationally redshifted as they climb out of potential wells, creating temperature fluctuations. The integrated Sachs-Wolfe (ISW) effect: photons traversing time-varying gravitational potentials (which occur when dark energy dominates and potentials decay) gain or lose net energy, producing additional large-scale CMB anisotropies"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.122269,
    "y": 0.793104,
    "z": 0.48855,
    "source_article": "Sachs-Wolfe effect",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "Sachs-Wolfe effect",
      "integrated Sachs-Wolfe",
      "CMB anisotropy",
      "gravitational potential"
    ]
  },
  {
    "id": "41cca9d4457362e0",
    "question_text": "A light-year is a unit of distance commonly used in astronomy. What does one light-year represent?",
    "options": {
      "A": "The distance that light travels in one year through the vacuum of space — approximately 9.46 trillion kilometers (5.88 trillion miles)",
      "B": "The time light takes to travel from the Sun to the nearest star, defining a unit of astronomical time",
      "C": "The energy output of the Sun over one year, measured in joules as a luminosity unit",
      "D": "The mass of photons emitted by a star in one year, via Einstein's E=mc²"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.107589,
    "y": 0.974276,
    "z": 0.708352,
    "source_article": "light-year",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "light-year",
      "astronomical distance",
      "speed of light"
    ]
  },
  {
    "id": "6746805a5aea084c",
    "question_text": "Red giant stars are significantly larger and more luminous than main-sequence stars of the same mass. What internal process drives a star to become a red giant?",
    "options": {
      "A": "The star captures additional mass from a nearby companion star, physically growing larger through accretion onto its surface — red giants are always members of binary systems",
      "B": "After core hydrogen is exhausted, hydrogen fusion continues in a shell around an inert helium core — the shell burning generates enormous energy that causes the outer envelope to expand dramatically and cool, producing a large red star",
      "C": "The star's magnetic field reverses polarity, causing the outer layers to be repelled outward by magnetic pressure while the core simultaneously contracts under its own gravity",
      "D": "Nuclear reactions in the core switch from fusion to fission, splitting heavy elements into lighter ones, and the excess energy from fission drives the expansion of the stellar envelope"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.39,
    "y": 0.855001,
    "z": 0.814905,
    "source_article": "red giant",
    "domain_ids": [
      "astrophysics",
      "physics"
    ],
    "concepts_tested": [
      "red giant",
      "shell burning",
      "stellar evolution",
      "hydrogen shell fusion"
    ]
  }
]