[
  {
    "id": "76ab685c1c63923d",
    "question_text": "Plant cells and animal cells both have mitochondria, but only plant cells have chloroplasts. What is the fundamental reason that plant cells still need mitochondria despite having chloroplasts?",
    "options": {
      "A": "Chloroplasts convert light energy into glucose, but mitochondria are required to efficiently convert that glucose into ATP through oxidative phosphorylation — the cell's universal energy currency for all its processes",
      "B": "Mitochondria are needed to break down the excess molecular oxygen produced by photosynthetic light reactions in chloroplasts, which would otherwise accumulate to toxic concentrations and damage cellular components",
      "C": "Chloroplasts can only function during daylight hours when photons are available, and mitochondria serve solely as a nighttime backup energy system with no metabolic role during the day",
      "D": "Mitochondria produce the CO₂ that chloroplasts require as their primary carbon substrate for the Calvin cycle, and chloroplasts in turn produce the O₂ that mitochondria consume in oxidative phosphorylation, forming a necessary closed metabolic loop within each plant cell that ensures neither organelle becomes limited by its gaseous substrates"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.950966,
    "y": 0.0621,
    "z": 0.353631,
    "source_article": "photosynthesis",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "photosynthesis",
      "cellular respiration",
      "mitochondria",
      "chloroplast",
      "ATP"
    ]
  },
  {
    "id": "4ddca29c85973afc",
    "question_text": "Antibiotics like penicillin kill bacteria but do not harm human cells. What structural difference between bacterial and human cells makes this selective toxicity possible?",
    "options": {
      "A": "Bacteria are much smaller than human cells, giving them a dramatically higher surface-area-to-volume ratio that allows antibiotics to penetrate their plasma membranes far more easily — this size-dependent permeability difference is the primary basis for selective toxicity, as human cells are simply too large for antibiotic molecules to reach effective intracellular concentrations",
      "B": "Bacteria have cell walls made of peptidoglycan — a structure entirely absent in human cells — and penicillin specifically blocks peptidoglycan synthesis, destroying the bacterial wall while leaving human cells unaffected",
      "C": "Human cells have a more efficient innate immune defense system that actively neutralizes antibiotic molecules before they can accumulate to damaging intracellular concentrations",
      "D": "Human cells store antibiotics in specialized lysosomes where acidic hydrolases rapidly degrade the drug molecules before they can interact with cellular targets, whereas bacteria lack this lysosomal detoxification pathway and cannot break down or sequester antibiotic compounds, leaving them fully exposed to the drug's effects"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.876032,
    "y": 0.319977,
    "z": 0.653562,
    "source_article": "peptidoglycan",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "peptidoglycan",
      "cell wall",
      "antibiotic mechanism",
      "selective toxicity"
    ]
  },
  {
    "id": "4c436d8d79d44e69",
    "question_text": "During DNA replication, one new strand (the leading strand) is synthesized continuously, while the other (the lagging strand) is synthesized in short Okazaki fragments. What causes this asymmetry?",
    "options": {
      "A": "The lagging strand uses a different, slower DNA polymerase isoform than the leading strand",
      "B": "DNA polymerase can only synthesize one strand at a time, so it must alternate between the two",
      "C": "The two parental strands are antiparallel, but DNA polymerase can only add nucleotides in the 5'→3' direction — so only one strand template runs in the correct orientation for continuous synthesis toward the replication fork",
      "D": "Helicase unwinds the two strands at different rates, forcing one strand to be copied in bursts"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.805955,
    "y": 0.349325,
    "z": 0.587293,
    "source_article": "DNA replication",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "DNA replication",
      "Okazaki fragments",
      "antiparallel strands",
      "DNA polymerase directionality"
    ]
  },
  {
    "id": "d02f4872d769587b",
    "question_text": "Enzymes dramatically accelerate chemical reactions in living cells. What is the primary mechanism by which they achieve this?",
    "options": {
      "A": "Enzymes supply additional energy from ATP hydrolysis to push reactions over the activation energy barrier — each enzyme molecule hydrolyzes one ATP per catalytic cycle to provide the energy input needed to force substrates through the transition state, which is why enzyme activity is always dependent on cellular ATP concentration",
      "B": "Enzymes increase the local temperature of their immediate surroundings through exothermic conformational changes during substrate binding, which speeds up molecular collisions and increases the fraction of substrate molecules with sufficient kinetic energy to overcome the reaction barrier",
      "C": "Enzymes shift the thermodynamic equilibrium of the reaction toward the products by selectively binding and stabilizing product molecules, effectively removing them from the equilibrium and driving the reaction forward according to Le Chatelier's principle, thereby increasing the net product yield",
      "D": "Enzymes lower the activation energy by stabilizing the transition state, making it easier for substrates to reach the transition state without changing the reaction's equilibrium"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.871209,
    "y": 0.197977,
    "z": 0.855001,
    "source_article": "enzyme catalysis",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "enzyme catalysis",
      "activation energy",
      "transition state",
      "reaction kinetics"
    ]
  },
  {
    "id": "393c70819f7ca71f",
    "question_text": "The cell membrane is described as a 'fluid mosaic.' Why is the membrane described as 'fluid' rather than rigid?",
    "options": {
      "A": "Phospholipids are held together only by noncovalent hydrophobic interactions, allowing individual lipid molecules and embedded proteins to move laterally within the plane of the bilayer",
      "B": "The membrane is composed of water-soluble glycoprotein molecules that dissolve into the aqueous cytoplasm and reform continuously at the cell surface",
      "C": "Membrane proteins constantly rotate between the inner and outer leaflets of the bilayer through rapid transverse diffusion ('flip-flop') movements, cycling from the cytoplasmic face to the extracellular face hundreds of times per second, giving the membrane its dynamic, fluid character",
      "D": "The membrane lacks any structural proteins or cytoskeletal attachments, making it inherently unstable and freely flowing like an oil slick on water"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.824963,
    "y": 0.270891,
    "z": 0.789378,
    "source_article": "fluid mosaic model",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "fluid mosaic model",
      "phospholipid bilayer",
      "membrane fluidity",
      "lateral diffusion"
    ]
  },
  {
    "id": "c138e208bc31795d",
    "question_text": "Sickle cell disease is caused by a single amino acid change (glutamic acid → valine) at position 6 of the β-globin chain. Why does this one substitution have such a dramatic effect on red blood cell shape?",
    "options": {
      "A": "Valine is much larger than glutamic acid in terms of its van der Waals radius and steric volume, causing severe steric clashes with neighboring amino acid residues in the β-globin chain that prevent hemoglobin from folding into its normal quaternary structure — these misfolded hemoglobin molecules aggregate into insoluble inclusion bodies that mechanically deform the red blood cell membrane into the characteristic sickle shape",
      "B": "Glutamic acid is hydrophilic and charged, while valine is hydrophobic — this creates a 'sticky' hydrophobic patch on the hemoglobin surface that causes deoxygenated hemoglobin molecules to polymerize into rigid fibers, distorting the cell into a sickle shape",
      "C": "The substitution eliminates hemoglobin's ability to bind molecular oxygen entirely, causing the cell to collapse under osmotic stress as dehydration concentrates the intracellular contents",
      "D": "Valine at position 6 forms an intermolecular disulfide bond with a cysteine residue on neighboring hemoglobin molecules, cross-linking adjacent hemoglobin tetramers into rigid crystalline arrays within the red blood cell — these disulfide-bonded hemoglobin crystals are incompatible with the biconcave disk shape and force the cell into an elongated sickle configuration"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.826943,
    "y": 0.391863,
    "z": 0.885431,
    "source_article": "sickle cell disease",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "sickle cell disease",
      "hemoglobin",
      "protein structure-function",
      "hydrophobic interaction",
      "point mutation"
    ]
  },
  {
    "id": "8398d727d34caa5d",
    "question_text": "B cells produce antibodies that bind specific antigens with extraordinary diversity — the human immune system can generate over 10¹¹ different antibody specificities. How is this diversity generated from a limited genome?",
    "options": {
      "A": "Each B cell contains a unique genome created by random point mutations during embryonic development",
      "B": "Antibody genes are inherited in millions of pre-arranged variants, one for each possible antigen",
      "C": "V(D)J recombination randomly selects and joins gene segments from separate variable (V), diversity (D), and joining (J) pools during B cell development, creating a unique antibody gene in each cell",
      "D": "B cells acquire antibody genes from the pathogens they encounter through horizontal gene transfer"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.652821,
    "y": 0.407851,
    "z": 0.667211,
    "source_article": "V(D)J recombination",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "V(D)J recombination",
      "antibody diversity",
      "adaptive immunity",
      "immunoglobulin gene rearrangement"
    ]
  },
  {
    "id": "97057ae9f51cb0f5",
    "question_text": "Both mitosis and meiosis involve chromosome segregation, but meiosis produces genetically diverse daughter cells while mitosis produces identical copies. What unique event in meiosis I is primarily responsible for this diversity?",
    "options": {
      "A": "Sister chromatid separation at the metaphase plate during anaphase, where the cohesin protein complex holding sister chromatids together is cleaved by separase, allowing individual chromatids to migrate toward opposite poles of the cell — this separation is the primary source of genetic diversity because random errors in chromatid partitioning introduce novel combinations of alleles into daughter cells",
      "B": "DNA replication during the S phase prior to meiosis introduces copying errors at a much higher rate than during mitotic S phase, because the meiotic DNA polymerase proofreading machinery is deliberately downregulated to increase the mutation rate and generate genetic diversity among the resulting gametes",
      "C": "Cytokinesis at the end of meiosis I divides the cell into two daughter cells of unequal size, and this asymmetric division randomly partitions organelles, mRNA transcripts, and regulatory proteins between the daughters, creating the genetic diversity characteristic of meiotic products",
      "D": "Crossing over (homologous recombination) between non-sister chromatids of homologous chromosomes during prophase I, which exchanges genetic material between maternal and paternal chromosomes"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.648271,
    "y": 0.28851,
    "z": 0.50087,
    "source_article": "meiosis",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "meiosis",
      "crossing over",
      "genetic recombination",
      "homologous chromosomes"
    ]
  },
  {
    "id": "a1e2fdd198575ce2",
    "question_text": "The lac operon in E. coli is only expressed when lactose is present AND glucose is absent. Why does glucose suppress lac operon expression even when lactose is available?",
    "options": {
      "A": "When glucose is abundant, cAMP levels drop, so the catabolite activator protein (CAP) cannot bind the lac promoter — without CAP activation, RNA polymerase has negligible affinity for the promoter even if the lac repressor is removed by allolactose",
      "B": "Glucose directly binds to the active site of β-galactosidase, the primary enzyme product of the lac operon, competitively inhibiting its ability to hydrolyze lactose — this product-level feedback inhibition makes lac operon expression metabolically futile when glucose is present, causing the cell to downregulate transcription through an mRNA stability-dependent mechanism",
      "C": "Glucose competes directly with allolactose for the allosteric binding site on the lac repressor protein, keeping the repressor locked in its high-affinity conformation on the operator sequence and preventing transcription",
      "D": "High intracellular glucose concentrations denature the polycistronic lac mRNA through osmotic stress, preventing ribosome binding and translation of the lacZ, lacY, and lacA gene products"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.899161,
    "y": 0.251068,
    "z": 0.683701,
    "source_article": "lac operon",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "lac operon",
      "catabolite repression",
      "cAMP-CAP complex",
      "gene regulation"
    ]
  },
  {
    "id": "c2a70ca245c3d6f6",
    "question_text": "Phylogenetic trees constructed from different genes sometimes show conflicting evolutionary relationships between the same set of species. What is the most common biological explanation for such gene tree discordance?",
    "options": {
      "A": "The molecular clock runs at vastly different rates in different evolutionary lineages due to variation in generation time, population size, and DNA repair efficiency, making branch length estimates from molecular data unreliable across different genes — these rate heterogeneities create artifactual discordance between gene trees that reflects methodological limitations rather than genuine biological processes",
      "B": "Incomplete lineage sorting — when ancestral polymorphisms persist through rapid speciation events, different genes may sort into descendant lineages in patterns that don't match the species tree",
      "C": "All genes must produce identical phylogenetic trees since they share the same evolutionary history; discordance always indicates sequencing or alignment errors",
      "D": "Gene duplication followed by differential loss of paralogs in descendant lineages always produces gene trees that perfectly match the species tree, so any observed discordance must indicate errors in sequence alignment, ortholog identification, or phylogenetic inference methods rather than genuine biological conflict"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.572015,
    "y": 0.206828,
    "z": 0.750069,
    "source_article": "incomplete lineage sorting",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "incomplete lineage sorting",
      "phylogenetics",
      "gene tree discordance",
      "coalescent theory",
      "multispecies coalescent"
    ]
  },
  {
    "id": "611aaa4c3e2475a4",
    "question_text": "CRISPR-Cas9 can be directed to cut virtually any DNA sequence by changing the guide RNA. What determines the specificity of where Cas9 cuts in the genome?",
    "options": {
      "A": "Cas9 scans for sequences that are heavily methylated, as methylation marks indicate genes to be edited",
      "B": "The guide RNA randomly binds throughout the genome until it encounters a complementary sequence by diffusion",
      "C": "The ~20-nucleotide guide RNA base-pairs with a complementary DNA target, but Cas9 only cleaves if the target is immediately adjacent to a protospacer adjacent motif (PAM) — both guide complementarity and PAM presence are required for cutting",
      "D": "Cas9 recognizes specific histone modifications at the target locus, and the guide RNA merely stabilizes binding"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.812547,
    "y": 0.49,
    "z": 0.684443,
    "source_article": "CRISPR-Cas9",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "CRISPR-Cas9",
      "guide RNA",
      "PAM sequence",
      "genome editing",
      "DNA targeting"
    ]
  },
  {
    "id": "7e7eaaab0fb47348",
    "question_text": "C4 photosynthesis evolved independently in over 60 plant lineages, primarily in hot, arid, or tropical environments. What specific problem does C4 photosynthesis solve that C3 photosynthesis cannot handle efficiently?",
    "options": {
      "A": "C3 plants cannot absorb enough photosynthetically active light energy in bright tropical sunlight because their photosystem II reaction centers become permanently photoinhibited above a certain irradiance threshold, and the D1 protein repair cycle cannot keep pace with photodamage in full-sun environments — C4 photosynthesis solves this by distributing the light reactions across two different cell types with distinct light-harvesting antenna complexes",
      "B": "C3 plants lose excessive amounts of water through transpiration because their stomata must remain open for much longer periods to acquire sufficient CO₂ for carbon fixation, and C4 photosynthesis was selected primarily as a water-conservation strategy that reduces stomatal conductance requirements by concentrating CO₂ internally using phosphoenolpyruvate carboxylase's higher affinity for CO₂",
      "C": "C4 plants require substantially less nitrogen to construct their photosynthetic enzyme machinery because they can operate with lower concentrations of RuBisCO in their bundle sheath cells, reducing the total nitrogen investment per unit of carbon fixed and providing an advantage in nitrogen-poor tropical soils",
      "D": "In C3 plants, RuBisCO's oxygenase activity (photorespiration) increases dramatically at high temperatures, wasting fixed carbon — C4 plants concentrate CO₂ around RuBisCO using a biochemical pump, suppressing photorespiration"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.872171,
    "y": 0.052113,
    "z": 0.702555,
    "source_article": "C4 photosynthesis",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "C4 photosynthesis",
      "photorespiration",
      "RuBisCO",
      "carbon concentrating mechanism"
    ]
  },
  {
    "id": "e2051372dd615157",
    "question_text": "Prions cause fatal neurodegenerative diseases such as Creutzfeldt-Jakob disease despite containing no nucleic acid. How does a prion propagate and spread infection without DNA or RNA?",
    "options": {
      "A": "The misfolded prion protein (PrPSc) acts as a conformational template that converts normally folded copies of the same protein (PrPC) into the pathogenic shape — this autocatalytic misfolding propagates the infection without any genetic material",
      "B": "Prions actually contain a small, highly stable RNA molecule that has evaded detection by standard nucleic acid extraction and hybridization methods due to its extremely tight association with the misfolded protein coat — this cryptic RNA encodes the minimal replication instructions needed for prion propagation and was recently identified through deep sequencing of ultracentrifuge-purified prion preparations",
      "C": "Prion diseases are actually autoimmune disorders in which the patient's own immune cells, particularly microglia and infiltrating T lymphocytes, attack and destroy neurons while the 'infectious agent' designation is a misnomer",
      "D": "Prions hijack host ribosomes to translate new prion proteins directly from the information encoded in their misfolded tertiary structure, bypassing the need for an mRNA template"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.855907,
    "y": 0.381138,
    "z": 0.579787,
    "source_article": "prion",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "prion",
      "protein misfolding",
      "PrPSc",
      "conformational templating",
      "protein-only hypothesis"
    ]
  },
  {
    "id": "9bbf742b39223968",
    "question_text": "Most mitochondrial proteins are encoded by nuclear DNA and imported post-translationally, yet a small set of genes (~37 in humans) remain in the mitochondrial genome. What evolutionary process explains this gene distribution?",
    "options": {
      "A": "Mitochondria synthesize all of their own proteins using their internal ribosomal machinery inherited from the ancestral α-proteobacterial endosymbiont, but they also maintain redundant backup copies of every mitochondrial gene in the host cell nucleus as a fail-safe mechanism — if mitochondrial DNA is damaged by reactive oxygen species generated during oxidative phosphorylation, the nuclear backup copies can be transcribed and their protein products imported into mitochondria to maintain respiratory chain function",
      "B": "Over evolutionary time, most genes from the ancestral endosymbiotic α-proteobacterium were transferred to the host nucleus through endosymbiotic gene transfer, while a small core of genes — primarily those encoding highly hydrophobic membrane-embedded electron transport chain subunits — were retained because they are difficult to import across mitochondrial membranes",
      "C": "The nuclear genome originally contained all the genes necessary for mitochondrial function before the endosymbiotic event, and mitochondria later acquired a small subset of genes through horizontal gene transfer from environmental bacteria",
      "D": "Mitochondrial DNA encodes all essential mitochondrial proteins required for oxidative phosphorylation, the TCA cycle, fatty acid β-oxidation, and mitochondrial gene expression, while the nuclear-encoded proteins targeted to mitochondria are merely supplementary factors that modulate but are not essential for any core mitochondrial metabolic functions — this explains why mitochondrial DNA mutations have such severe phenotypic effects in mitochondrial diseases"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.737895,
    "y": 0.173818,
    "z": 0.056785,
    "source_article": "endosymbiotic theory",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "endosymbiotic theory",
      "endosymbiotic gene transfer",
      "mitochondrial genome evolution",
      "hydrophobicity hypothesis"
    ]
  },
  {
    "id": "f6d3338b5c136be3",
    "question_text": "Epigenetic modifications regulate gene expression without altering DNA sequence. What feature fundamentally distinguishes epigenetic silencing by DNA methylation from regulation by transcription factors?",
    "options": {
      "A": "DNA methylation only affects intergenic regions, repetitive elements, and transposable element sequences scattered throughout the genome and has no influence whatsoever on gene promoters or regulatory elements — the observed correlation between promoter methylation and gene silencing is an artifact of bisulfite sequencing protocols that cannot distinguish between 5-methylcytosine and 5-hydroxymethylcytosine, the latter of which is actually associated with active transcription",
      "B": "Transcription factors require continuous physical presence at the promoter to maintain gene expression states, and their effects are immediately reversed when the transcription factor is degraded or sequestered — whereas DNA methylation is fundamentally different because it is transient, lasting only minutes before demethylase enzymes remove the methyl groups, requiring constant re-methylation by de novo methyltransferases",
      "C": "DNA methylation is mitotically heritable — maintenance methyltransferase (DNMT1) recognizes hemimethylated CpG sites after replication and methylates the daughter strand, perpetuating the silencing pattern through cell divisions without requiring the original inducing signal",
      "D": "DNA methylation works by physically severing the phosphodiester backbone of the DNA double helix at methylated cytosine residues, creating single-strand breaks that prevent RNA polymerase from transcribing through the methylated region — these breaks are repaired when the gene needs to be reactivated, restoring the intact template"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.706658,
    "y": 0.415477,
    "z": 0.399563,
    "source_article": "epigenetics",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "epigenetics",
      "DNA methylation",
      "DNMT1",
      "epigenetic inheritance",
      "CpG methylation"
    ]
  },
  {
    "id": "450b0325f5204db4",
    "question_text": "Cancer cells exhibit the Warburg effect — they preferentially use glycolysis and lactic acid fermentation even in the presence of oxygen, despite oxidative phosphorylation yielding ~18 times more ATP per glucose molecule. What is the primary advantage of this metabolic strategy for rapidly dividing cells?",
    "options": {
      "A": "Cancer cells universally have defective mitochondria incapable of oxidative phosphorylation",
      "B": "Lactic acid secretion acidifies the tumor microenvironment, which is the primary selective advantage of aerobic glycolysis",
      "C": "Aerobic glycolysis reduces mitochondrial reactive oxygen species production, protecting cancer cell DNA from oxidative damage",
      "D": "Glycolytic intermediates are diverted into anabolic biosynthetic pathways — the pentose phosphate pathway (nucleotides), serine synthesis (amino acids, one-carbon metabolism), and citrate export (lipid synthesis) — providing the carbon building blocks that rapidly dividing cells need for biomass production"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.906538,
    "y": 0.102312,
    "z": 0.604595,
    "source_article": "Warburg effect",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "Warburg effect",
      "cancer metabolism",
      "aerobic glycolysis",
      "anabolic metabolism",
      "biosynthetic precursors"
    ]
  },
  {
    "id": "1e6daa7cc5d31d5f",
    "question_text": "In the Wnt/β-catenin signaling pathway, β-catenin is continuously synthesized but rapidly degraded when Wnt ligand is absent. What molecular mechanism keeps β-catenin levels low in the absence of Wnt?",
    "options": {
      "A": "A destruction complex containing APC, Axin, GSK-3β, and CK1 phosphorylates β-catenin, tagging it for ubiquitination by β-TrCP and proteasomal degradation — Wnt signaling disassembles this complex, allowing β-catenin to accumulate and enter the nucleus",
      "B": "β-catenin is sequestered in the endoplasmic reticulum and cleared by autophagy in the absence of Wnt",
      "C": "Without Wnt, β-catenin mRNA is degraded by specific microRNAs, preventing its translation entirely",
      "D": "β-catenin is exported from the cell through exosome secretion when Wnt is absent"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.832054,
    "y": 0.372476,
    "z": 0.839084,
    "source_article": "Wnt signaling",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "Wnt signaling",
      "β-catenin destruction complex",
      "ubiquitin-proteasome pathway",
      "GSK-3β",
      "APC"
    ]
  },
  {
    "id": "b3a0cb9be97760e0",
    "question_text": "During embryonic development, a single morphogen gradient (such as Bicoid in Drosophila) can specify multiple distinct cell fates along a body axis. How does a smooth, continuous concentration gradient produce sharp boundaries between different cell types?",
    "options": {
      "A": "Each cell type along the body axis requires a specific absolute number of morphogen molecules (not a concentration) bound to its surface receptors, and random Poisson fluctuations in the stochastic arrival of individual morphogen molecules at each cell create sharp boundaries between adjacent cell fates by partitioning cells into discrete groups that received exactly the required number of molecules during a critical developmental time window — this stochastic counting mechanism explains why embryonic pattern formation is remarkably robust despite molecular noise",
      "B": "Different target genes have enhancers with different binding affinities for the morphogen — high-affinity enhancers are activated at low concentrations (far from the source), while low-affinity enhancers require high concentrations (near the source), creating concentration-dependent thresholds that are sharpened by mutual cross-repression between the induced genes",
      "C": "The morphogen physically blocks cell migration at specific concentration thresholds by cross-linking surface adhesion molecules, creating mechanical barriers between adjacent cell populations",
      "D": "Sharp boundaries between cell types arise because the morphogen is released from the source in discrete temporal pulses rather than as a continuous steady-state gradient — each pulse activates a different set of target genes depending on the cell's distance from the source, creating a temporal code that converts a graded spatial signal into a series of discrete activation events separated by refractory periods"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.640064,
    "y": 0.331352,
    "z": 0.810544,
    "source_article": "morphogen gradient",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "morphogen gradient",
      "French flag model",
      "threshold gene regulation",
      "Drosophila development",
      "Bicoid"
    ]
  },
  {
    "id": "16ecc3532dafded1",
    "question_text": "Quorum sensing allows bacteria to coordinate gene expression across a population. In Vibrio fischeri bioluminescence, the LuxI/LuxR system activates the lux operon only at high cell density. What creates the density-dependent switch?",
    "options": {
      "A": "At high cell density, rapid oxygen consumption by the crowded bacterial population depletes dissolved O₂ below a critical threshold, triggering an anaerobic metabolic switch that activates bioluminescence genes",
      "B": "Bacteria at high cell density physically contact each other through their outer membrane surfaces, and mechanosensitive ion channels embedded in the inner membrane transduce this mechanical pressure into an intracellular calcium signal that activates a phosphorylation cascade culminating in the transcriptional induction of the lux operon — this contact-dependent signaling mechanism explains why bioluminescence requires a minimum cell density and why dispersed individual cells never luminesce regardless of culture conditions",
      "C": "Each cell constitutively produces a small, membrane-permeable autoinducer (acyl-homoserine lactone, AHL) that accumulates in proportion to cell density — above a threshold concentration, AHL binds the LuxR transcription factor intracellularly, and the LuxR-AHL complex activates lux operon transcription, creating a cooperative density-dependent switch",
      "D": "High cell density depletes nutrients from the surrounding medium, and the resulting starvation stress activates the lux operon through the stringent response via ppGpp accumulation"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.781257,
    "y": 0.227293,
    "z": 0.846972,
    "source_article": "quorum sensing",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "quorum sensing",
      "autoinducer",
      "LuxI/LuxR system",
      "acyl-homoserine lactone",
      "population-level gene regulation"
    ]
  },
  {
    "id": "1c085766e32f57bd",
    "question_text": "Horizontal gene transfer (HGT) is pervasive in prokaryotes but rare in multicellular eukaryotes. What is the fundamental biological reason for this asymmetry?",
    "options": {
      "A": "Eukaryotic DNA uses a fundamentally different sugar-phosphate backbone chemistry (deoxyribose with 5-methylcytosine) that is structurally incompatible with the enzymes and recombination machinery that prokaryotes use for horizontal gene transfer — conjugation pili, transformation uptake sequences, and phage integration factors all require prokaryotic-specific DNA modifications that are absent in eukaryotic chromosomes",
      "B": "Eukaryotic genomes are far too large and complex, with extensive intron sequences, repetitive elements, and heterochromatin packaging, to accommodate the insertion of foreign prokaryotic genes without disrupting essential regulatory elements — the sheer size and organizational complexity of eukaryotic chromosomes creates an insurmountable barrier to stable integration of horizontally transferred DNA",
      "C": "Prokaryotic cells lack a nuclear membrane, making their genomic DNA freely accessible in the cytoplasm to foreign DNA molecules that enter through conjugation, transformation, or transduction — this direct physical accessibility is the primary factor enabling horizontal gene transfer in prokaryotes",
      "D": "In multicellular eukaryotes, the germline is physically sequestered from somatic tissues — even if HGT occurs in somatic cells, those changes cannot be inherited because only germline modifications are passed to offspring (the Weismann barrier)"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.67765,
    "y": 0.313972,
    "z": 0.293562,
    "source_article": "horizontal gene transfer",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "horizontal gene transfer",
      "germline sequestration",
      "Weismann barrier",
      "soma vs germline",
      "evolutionary genetics"
    ]
  },
  {
    "id": "bf554f3d18967ada",
    "question_text": "ATP synthase produces most of the ATP in aerobic cells. What provides the energy that drives this molecular machine?",
    "options": {
      "A": "A proton gradient across the inner mitochondrial membrane drives rotation of ATP synthase's rotor subunit — protons flow down their electrochemical gradient through the enzyme, and this rotational energy mechanically forces ADP and inorganic phosphate together to form ATP",
      "B": "High-energy phosphate groups are transferred directly from NADH molecules to ADP, catalyzed by ATP synthase acting as a phosphotransferase enzyme without any involvement of a transmembrane proton gradient or electrochemical potential across the inner mitochondrial membrane",
      "C": "Heat released by exothermic oxidation reactions in the mitochondrial matrix is captured by ATP synthase's thermosensitive regulatory domain and converted directly into chemical bond energy stored in ATP's terminal phosphoanhydride linkage through a heat-to-chemical energy transduction mechanism",
      "D": "Electrical current flowing through the inner mitochondrial membrane's lipid bilayer powers ATP synthase like a battery-driven motor, with electrons from the electron transport chain moving directly through the enzyme's protein subunits to mechanically drive the synthesis reaction"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.99,
    "y": 0.069702,
    "z": 0.484033,
    "source_article": "chemiosmosis",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "chemiosmosis",
      "ATP synthase",
      "proton motive force",
      "oxidative phosphorylation"
    ]
  },
  {
    "id": "980b6e0861d3d446",
    "question_text": "When a red blood cell is placed in pure water, it swells and eventually bursts. What drives water into the cell?",
    "options": {
      "A": "Atmospheric pressure from the surrounding air pushes water molecules through the membrane's phospholipid bilayer by mechanical compression of the surrounding fluid against the cell surface, forcing water inward regardless of solute concentration differences. This hydrostatic pressure effect overwhelms any osmotic forces and is the primary driver of water movement across all biological membranes in both animal and plant cells under atmospheric conditions",
      "B": "Water moves by osmosis from the region of lower solute concentration (pure water outside) into the region of higher solute concentration (cytoplasm inside), driven by the difference in water potential across the semipermeable membrane. The membrane allows water but not most solutes to pass, so water flows until pressures equalize — but without a rigid cell wall, the flexible red blood cell membrane ruptures before equilibrium is reached",
      "C": "Active transport proteins pump water molecules inward using ATP hydrolysis energy, and the cell lacks the regulatory mechanism to stop this import",
      "D": "Hemoglobin inside the cell creates electrostatic attraction pulling polar water molecules through aquaporin channels by charge interaction"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.901202,
    "y": 0.211584,
    "z": 1.0,
    "source_article": "osmosis",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "osmosis",
      "water potential",
      "semipermeable membrane",
      "hemolysis"
    ]
  },
  {
    "id": "b92f2fe267cb6987",
    "question_text": "In a food chain, only about 10% of energy transfers from one trophic level to the next. Why is most energy lost between levels?",
    "options": {
      "A": "Predators are inefficient hunters who fail to capture approximately 90% of their prey during pursuit attempts, so only the successfully captured organisms contribute energy to the predator's trophic level. This hunting inefficiency is the primary bottleneck in ecological energy flow, and improving predator capture success rates would dramatically increase the amount of energy transferred between trophic levels",
      "B": "Most chemical bonds in prey organisms are constructed from indigestible molecular configurations that pass through the predator's digestive system entirely unprocessed, exiting as chemically unchanged fecal matter. The digestive enzymes of most predators can only break down a small fraction of the diverse chemical bond types present in their prey's tissues, leaving the majority of potential energy locked in undigestible form",
      "C": "Organisms at each level use most of the energy they consume for their own cellular respiration — converting it to heat that dissipates into the environment — and additional energy is lost in indigestible material and metabolic waste, leaving only a fraction available for growth and reproduction that the next level can consume",
      "D": "Gravity pulls nutrients downward through soil layers, making them unavailable to organisms higher in the food web"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.808802,
    "y": 0.038184,
    "z": 0.851322,
    "source_article": "trophic efficiency",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "trophic efficiency",
      "energy flow",
      "cellular respiration",
      "ecological pyramid"
    ]
  },
  {
    "id": "e6150b2491a2bdcc",
    "question_text": "A point mutation changes a single DNA base pair. Why can a 'silent' mutation — one that doesn't change the amino acid sequence — still sometimes affect the organism?",
    "options": {
      "A": "Silent mutations always increase the organism's overall mutation rate in neighboring genes by destabilizing the local chromatin structure around the affected codon, directly exposing adjacent DNA regions to mutagenic damage from reactive oxygen species generated during normal cellular metabolism and oxidative phosphorylation in the mitochondria",
      "B": "Silent mutations alter the organism's blood type by changing surface glycoproteins on red blood cells through a mechanism that is completely independent of protein coding sequence changes, directly modifying the carbohydrate attachment patterns on the extracellular domain of the membrane glycoproteins expressed on the cell surface",
      "C": "Silent mutations eliminate all gene expression from the affected chromosome by triggering whole-chromosome inactivation through a codon-usage surveillance mechanism that continuously monitors the entire genome for any deviation from the ancestral synonymous codon preference pattern established during speciation",
      "D": "Although the amino acid stays the same, the new codon may be translated more slowly if its corresponding tRNA is less abundant, altering protein folding by changing the speed of ribosomal elongation. The mutation can also affect mRNA splicing signals, mRNA stability, or mRNA secondary structure"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.706316,
    "y": 0.426552,
    "z": 0.650608,
    "source_article": "codon usage bias",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "codon usage bias",
      "synonymous mutations",
      "tRNA abundance",
      "mRNA processing"
    ]
  },
  {
    "id": "8cf6b40b653bf32b",
    "question_text": "Bacteria reproduce by binary fission while eukaryotic cells divide by mitosis. What is a key difference in how these two processes handle DNA segregation?",
    "options": {
      "A": "In binary fission, the replicated circular chromosomes are separated primarily by attachment to the growing cell membrane as the cell elongates — no mitotic spindle or kinetochore is involved. In mitosis, a complex spindle apparatus of microtubules attaches to kinetochores on condensed chromosomes and actively pulls sister chromatids to opposite poles",
      "B": "Binary fission uses an actin-based spindle rather than microtubules, but the mechanism is otherwise identical to eukaryotic mitosis",
      "C": "In binary fission, one daughter cell receives the original template DNA and the other receives a completely newly synthesized copy, while in mitosis both daughters always receive one original and one new strand through semiconservative replication. This asymmetric DNA distribution in bacterial division means one daughter inherits the 'master copy' with higher fidelity while the other receives a more error-prone replicated version",
      "D": "Bacteria and eukaryotes use identical spindle-based chromosome segregation mechanisms because the mitotic spindle evolved before the divergence of prokaryotes and eukaryotes from their last universal common ancestor. The FtsZ protein in bacteria is a fully functional tubulin that assembles into a complete mitotic spindle apparatus with kinetochores and asters indistinguishable from eukaryotic spindles"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.784356,
    "y": 0.276628,
    "z": 0.32901,
    "source_article": "binary fission",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "binary fission",
      "mitosis",
      "chromosome segregation",
      "mitotic spindle"
    ]
  },
  {
    "id": "7f968621cacf187a",
    "question_text": "Dolphins and sharks both have streamlined body shapes and fins, yet dolphins are mammals and sharks are fish. What evolutionary process explains their similar body forms?",
    "options": {
      "A": "Dolphins descended directly from an ancient shark lineage that gradually evolved mammalian traits while retaining the ancestral shark body plan",
      "B": "Convergent evolution: similar environmental pressures (moving efficiently through water) independently selected for similar body shapes in unrelated lineages. The streamlined form and fins are analogous structures — superficially similar but arising from different developmental pathways and different ancestral structures, reflecting adaptation to shared physical constraints rather than common ancestry",
      "C": "A single aquatic body plan gene was transferred horizontally from sharks to dolphin ancestors via a marine virus, inserting the shark morphology program into the mammalian genome",
      "D": "Dolphins and sharks share a recent common ancestor that already possessed fins and a streamlined body, making their similarities homologous traits inherited from this shared ancestor rather than independent evolutionary innovations. Their last common ancestor was a fully aquatic organism with the characteristic fusiform body shape, and the apparent differences between the two lineages are superficial modifications of this inherited plan"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.589219,
    "y": 0.19601,
    "z": 0.495867,
    "source_article": "convergent evolution",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "convergent evolution",
      "analogous structures",
      "natural selection",
      "adaptive evolution"
    ]
  },
  {
    "id": "b55d30b74d30d111",
    "question_text": "The Hardy-Weinberg principle states that allele frequencies remain constant across generations under certain conditions. Which factor, if present, would cause allele frequencies to change?",
    "options": {
      "A": "Sexual reproduction involving random mating between individuals, which shuffles existing allele combinations into new genotype configurations each generation without changing the underlying allele frequencies in the population gene pool",
      "B": "A large population size that ensures every allele is represented proportionally in the next generation and prevents random sampling errors from significantly skewing allele representation away from their expected equilibrium frequencies across successive generations",
      "C": "Natural selection favoring individuals with a particular genotype, giving them higher survival and reproductive success — which increases the frequency of the favored allele at the expense of alternatives over successive generations",
      "D": "Diploid inheritance, where each individual carries two copies of every autosomal gene and passes one randomly selected copy to each offspring through Mendelian segregation of homologous chromosomes during meiosis I, ensuring balanced allelic transmission"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.588762,
    "y": 0.133049,
    "z": 0.8112,
    "source_article": "Hardy-Weinberg equilibrium",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "Hardy-Weinberg equilibrium",
      "allele frequency change",
      "natural selection",
      "population genetics"
    ]
  },
  {
    "id": "c649ac8a894fcd44",
    "question_text": "The electron transport chain generates a proton gradient, but oxygen is essential for this process to continue. What specific role does oxygen play?",
    "options": {
      "A": "Oxygen reacts with carbon dioxide in the mitochondrial matrix to form carbonic acid, which dissociates into protons and bicarbonate ions that contribute to maintaining the electrochemical gradient across the inner mitochondrial membrane during periods of high metabolic demand for ATP production by oxidative phosphorylation in actively respiring cells",
      "B": "Oxygen donates high-energy electrons to Complex I at the very beginning of the electron transport chain, initiating the entire cascade of electron transfers that sequentially pump protons from the mitochondrial matrix into the intermembrane space through the three proton-pumping complexes — Complex I, Complex III, and Complex IV — generating the electrochemical gradient",
      "C": "Oxygen activates ATP synthase by binding directly to its regulatory gamma subunit, changing the enzyme's conformation from an inactive closed state to an active open state that permits proton flow through the c-ring rotor mechanism and thereby enables the catalytic synthesis of ATP from ADP and inorganic phosphate at the three catalytic beta subunits",
      "D": "Oxygen serves as the terminal electron acceptor at Complex IV — it accepts electrons at the end of the transport chain and combines with protons to form water. Without oxygen to accept electrons, the chain backs up completely because every carrier remains reduced and cannot accept new electrons from upstream donors"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.98239,
    "y": 0.11371,
    "z": 0.580882,
    "source_article": "terminal electron acceptor",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "terminal electron acceptor",
      "electron transport chain",
      "Complex IV",
      "aerobic respiration"
    ]
  },
  {
    "id": "024445148297a343",
    "question_text": "A nerve impulse arrives at a synapse, and the presynaptic neuron releases neurotransmitter into the synaptic cleft. How is the signal terminated so the postsynaptic neuron doesn't remain permanently activated?",
    "options": {
      "A": "Neurotransmitter molecules are removed from the synaptic cleft by a combination of mechanisms: enzymatic degradation (such as acetylcholinesterase breaking down acetylcholine), reuptake into the presynaptic terminal via transporter proteins, and diffusion away from the synapse. These processes rapidly clear the neurotransmitter, ending receptor stimulation",
      "B": "The electrical resistance of the synaptic cleft increases over time, blocking further signal transmission regardless of neurotransmitter presence",
      "C": "Postsynaptic receptors permanently desensitize after a single binding event and must be entirely replaced by newly synthesized receptor proteins manufactured in the rough endoplasmic reticulum and transported to the membrane before the neuron can respond to another stimulus. This complete receptor turnover process takes approximately 24-48 hours, which is why neurons have a refractory period between successive activations that limits the maximum firing frequency",
      "D": "Gravity causes neurotransmitter molecules to settle to the bottom of the synaptic cleft within milliseconds after release, pulling them away from the postsynaptic membrane receptors located on the upper surface of the receiving neuron. This gravitational sedimentation is the primary mechanism of signal termination at synapses throughout the central and peripheral nervous systems in all vertebrates"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.841423,
    "y": 0.348517,
    "z": 0.982772,
    "source_article": "synaptic transmission",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "synaptic transmission",
      "neurotransmitter clearance",
      "enzymatic degradation",
      "reuptake"
    ]
  },
  {
    "id": "67f8d29616c7ea4f",
    "question_text": "The polymerase chain reaction (PCR) amplifies specific DNA sequences exponentially. Why does PCR require repeated cycles of heating and cooling?",
    "options": {
      "A": "Heating activates dormant nucleotides that are chemically inert at room temperature, converting them from their storage form to a reactive state that DNA polymerase can incorporate into a growing strand. The cooling phase is then needed to stabilize the newly formed phosphodiester bonds before the next round of heating can activate another batch of nucleotide precursors",
      "B": "Heating separates the two complementary DNA strands so primers can bind to their target sequences, and cooling then allows the heat-stable DNA polymerase to synthesize new complementary strands. Each cycle doubles the number of target copies, requiring multiple cycles for exponential amplification from a small starting sample",
      "C": "Temperature cycles create alternating pressure waves through the reaction solution that physically push DNA polymerase along the template strand like a molecular conveyor belt, with each heating phase advancing the enzyme by one nucleotide position along the template and each cooling phase locking the newly added base into its correct Watson-Crick base-paired position",
      "D": "Heating breaks hydrogen bonds between DNA polymerase and its substrate, releasing completed DNA copies from the active site"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.800323,
    "y": 0.318802,
    "z": 0.694269,
    "source_article": "PCR",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "PCR",
      "DNA denaturation",
      "primer annealing",
      "thermal cycling"
    ]
  },
  {
    "id": "331ef86ae12f5327",
    "question_text": "Hamilton's rule predicts when altruistic behavior will evolve in a population. A worker bee sacrifices its own reproduction to help its mother queen. Under what condition does Hamilton's rule predict this behavior is favored by natural selection?",
    "options": {
      "A": "When the colony has existed for over ten generations, allowing cooperative traditions to become genetically encoded through Lamarckian inheritance",
      "B": "When the altruistic behavior provides no fitness benefit and is maintained purely by genetic drift in small populations",
      "C": "When r × B > C — the genetic relatedness (r) between altruist and beneficiary multiplied by the reproductive benefit (B) to the beneficiary exceeds the reproductive cost (C) to the altruist. Because haplodiploidy makes worker bees more related to their sisters (r = 0.75) than to their own potential offspring (r = 0.5), helping the queen produce sisters can propagate the worker's genes more effectively than reproducing directly",
      "D": "When the queen bee physically prevents workers from reproducing through chemical suppression of ovarian development using pheromones, making the comparison between altruism and selfish behavior irrelevant since workers have no alternative reproductive option regardless of genetic relatedness. Under this chemical coercion model, Hamilton's rule is unnecessary because worker sterility is imposed rather than evolved, and the apparent altruism is simply enforced servitude with no inclusive fitness benefit"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.586145,
    "y": 0.040508,
    "z": 0.923666,
    "source_article": "Hamilton's rule",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "Hamilton's rule",
      "kin selection",
      "inclusive fitness",
      "haplodiploidy"
    ]
  },
  {
    "id": "f461ad6b0a0c0d11",
    "question_text": "r-selected species (like bacteria and insects) produce many offspring with minimal parental investment, while K-selected species (like elephants and whales) produce few offspring with extensive care. What ecological condition primarily favors r-selection?",
    "options": {
      "A": "Stable, resource-limited environments where populations consistently remain near carrying capacity and individuals must compete intensely for limited resources, favoring investment in high individual quality and competitive ability over sheer quantity of offspring produced per reproductive event",
      "B": "Environments with frequent, unpredictable disturbances or high mortality where population density is often far below carrying capacity, favoring rapid reproduction to colonize available resources before the next disruption — because producing many inexpensive offspring maximizes the probability that some individuals survive in an unpredictable world",
      "C": "Deep ocean environments where extreme hydrostatic pressure and permanent darkness select for slow metabolic rates that are physically incompatible with rapid reproduction due to thermodynamic constraints on energy allocation at extreme depths, limiting all abyssal organisms to K-selected life history strategies regardless of ecological disturbance regime",
      "D": "Environments with frequent, unpredictable disturbances or high mortality where population density is often far below carrying capacity, favoring rapid reproduction to colonize available resources before the next disruption — because producing many inexpensive offspring maximizes the chance that some survive in an unpredictable world"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.604,
    "y": 0.070381,
    "z": 0.925764,
    "source_article": "r-selection",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "r-selection",
      "K-selection",
      "life history strategy",
      "ecological disturbance"
    ]
  },
  {
    "id": "f41e127ddc39f212",
    "question_text": "Most eukaryotic genes contain introns — non-coding sequences that are transcribed but removed before translation. Why are introns removed from the pre-mRNA by the spliceosome rather than simply not being transcribed?",
    "options": {
      "A": "Introns serve important functions while still in the pre-mRNA: they enable alternative splicing, where different combinations of exons are joined to produce multiple distinct mRNA variants — and therefore multiple different proteins — from a single gene. Introns also contain regulatory elements that influence transcription and can enhance mRNA export from the nucleus. Removing them after transcription allows these functions while still producing a translatable message",
      "B": "RNA polymerase II cannot distinguish intron from exon sequences during transcription because it reads the template strand continuously without recognition of splice boundaries",
      "C": "Introns are transcribed accidentally due to an inherent error rate in RNA polymerase that causes it to overshoot exon boundaries by thousands of nucleotides",
      "D": "Intron sequences encode essential structural proteins translated by specialized nuclear ribosomes before the introns are removed and the exon-only mRNA is exported to cytoplasm"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.698951,
    "y": 0.380356,
    "z": 0.299569,
    "source_article": "RNA splicing",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "RNA splicing",
      "alternative splicing",
      "intron function",
      "gene regulation"
    ]
  },
  {
    "id": "37c897aba437be96",
    "question_text": "Two populations of a single insect species live in the same forest but feed on different host plants. Over time, each population becomes reproductively isolated and forms a new species. What type of speciation is this?",
    "options": {
      "A": "Artificial selection, because human land management forced the insect populations onto different host plants through selective logging and replanting",
      "B": "Sympatric speciation: reproductive isolation evolves between populations that overlap geographically, driven by adaptation to different ecological niches (here, different host plants). Assortative mating by host preference — insects that prefer the same plant tend to mate on it — reduces gene flow between populations, eventually leading to complete reproductive isolation without any physical geographic barrier separating them",
      "C": "Allopatric speciation, because the two host plant species are located in geographically separated parts of the forest and physical distance alone prevents gene flow between the insect populations feeding on each plant species, even though both populations remain within the same overall forest ecosystem. The different plant locations create a de facto geographic barrier that functions identically to a mountain range or river separating two populations into isolated breeding groups",
      "D": "Genetic drift randomly eliminates all variation within each host-adapted group, producing genetically identical but behaviorally incompatible populations"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.556127,
    "y": 0.076524,
    "z": 0.799474,
    "source_article": "sympatric speciation",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "sympatric speciation",
      "host plant adaptation",
      "assortative mating",
      "ecological speciation"
    ]
  },
  {
    "id": "754f8f8c1eb2e9d6",
    "question_text": "In programmed cell death (apoptosis), a cell systematically dismantles itself from within. Why is it important that apoptotic cells are removed quickly by macrophages rather than simply left to disintegrate?",
    "options": {
      "A": "Apoptotic cells release a signaling molecule that permanently stimulates surrounding healthy cells to undergo excessive uncontrolled proliferation, inevitably leading to tumor formation within hours unless the apoptotic cells are physically removed from the tissue by resident immune cells before this mitogenic signal accumulates to dangerous concentrations in the local tissue microenvironment surrounding the dying cell",
      "B": "Apoptotic cell remnants are a primary food source for pathogenic bacteria that specifically colonize dying cells, so rapid clearance prevents infections",
      "C": "If not cleared promptly, late apoptotic cells undergo secondary necrosis — their membranes lose integrity, releasing intracellular contents (DNA, histones, uric acid) that trigger inflammation and can provoke autoimmune responses against self-antigens. Efficient phagocytic clearance via 'eat-me' signals (phosphatidylserine exposure) ensures immunologically silent removal without tissue damage",
      "D": "Apoptotic cells continue consuming oxygen and glucose from surrounding tissue at an accelerated rate during the dying process, creating localized hypoxic and nutrient-depleted zones that damage neighboring healthy cells through metabolic competition for essential resources. This metabolic vampirism by apoptotic cells explains why tissues with high cell turnover rates are particularly vulnerable to ischemic damage"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.913973,
    "y": 0.34566,
    "z": 0.999192,
    "source_article": "apoptosis",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "apoptosis",
      "secondary necrosis",
      "phosphatidylserine",
      "efferocytosis"
    ]
  },
  {
    "id": "ac1db1ce4f5d2968",
    "question_text": "Each time a normal human somatic cell divides, its telomeres shorten slightly. What happens when telomeres become critically short, and why does this process exist?",
    "options": {
      "A": "When telomeres shorten below a critical threshold, the cell immediately activates a ubiquitous backup telomere elongation pathway that all somatic cells possess but keep dormant until needed, restoring telomere length to its original embryonic value within a single cell cycle and allowing unlimited further proliferation without any risk of genomic instability or tumor formation arising from continued cell division",
      "B": "Short telomeres cause the cell to switch permanently from aerobic respiration to anaerobic fermentation, reducing ATP production by 95% and gradually starving the cell",
      "C": "Critically short telomeres trigger release of all stored calcium ions into the extracellular space, poisoning neighboring cells through calcium excitotoxicity",
      "D": "Critically short telomeres expose chromosome ends that resemble DNA double-strand breaks, activating the DNA damage response (primarily p53 and Rb pathways). This triggers either replicative senescence (permanent cell cycle arrest) or apoptosis — preventing further division. This acts as a tumor suppressor mechanism: limiting replication capacity constrains the accumulation of cancer-promoting mutations"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.831817,
    "y": 0.400118,
    "z": 0.641229,
    "source_article": "telomere biology",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "telomere biology",
      "replicative senescence",
      "Hayflick limit",
      "tumor suppression"
    ]
  },
  {
    "id": "cbae18990057669b",
    "question_text": "The human gut microbiome contains trillions of bacteria. Why don't these commensal bacteria trigger the same immune response as pathogenic bacteria?",
    "options": {
      "A": "The intestinal immune system has evolved mechanisms of tolerance: the epithelial barrier physically separates most commensals from immune cells, secretory IgA coats bacteria non-destructively, regulatory T cells (Tregs) actively suppress inflammatory responses to normal flora, and dendritic cells in Peyer's patches sample bacteria and promote tolerogenic rather than inflammatory responses to familiar microbial antigens",
      "B": "Commensal bacteria lack all molecular patterns that the immune system recognizes — they have no lipopolysaccharides, no peptidoglycan, no flagellin, and no CpG DNA motifs — making them completely invisible to every component of both the innate and adaptive immune systems. Without any pathogen-associated molecular patterns on their surfaces, these bacteria are physically undetectable by any immune receptor expressed on any immune cell type in the human body",
      "C": "Commensal bacteria release a chemical compound that shuts down the entire immune system locally within the gut, disabling all immune surveillance in the GI tract",
      "D": "The body cannot distinguish commensals from pathogens — the immune system responds identically to both, but commensals reproduce faster than immune cells can destroy them"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.777332,
    "y": 0.38046,
    "z": 0.757017,
    "source_article": "mucosal immunity",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "mucosal immunity",
      "immune tolerance",
      "regulatory T cells",
      "commensal bacteria"
    ]
  },
  {
    "id": "bc72d3e08e82b01e",
    "question_text": "The Red Queen hypothesis proposes that organisms must constantly evolve just to maintain their current fitness relative to co-evolving species. Which observation best supports this hypothesis?",
    "options": {
      "A": "The existence of sexual reproduction despite its two-fold cost is explained by the Red Queen: recombination generates novel genotype combinations providing moving targets against rapidly evolving parasites that can quickly adapt to common host genotypes",
      "B": "The existence of sexual reproduction despite its two-fold cost compared to asexual reproduction is explained by the Red Queen hypothesis: sexual recombination generates novel genotype combinations each generation, providing a moving target against rapidly evolving parasites that can quickly adapt to common host genotypes. Asexual lineages produce genetically identical offspring that are uniformly vulnerable once a parasite adapts to their genotype",
      "C": "Some organisms like crocodilians have remained morphologically unchanged for hundreds of millions of years, showing that evolutionary stasis is the dominant pattern",
      "D": "Organisms in environments with no predators or parasites evolve most rapidly, demonstrating that biotic interactions actually slow evolution by constraining populations within narrow adaptive peaks"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.598744,
    "y": 0.077908,
    "z": 0.820704,
    "source_article": "Red Queen hypothesis",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "Red Queen hypothesis",
      "coevolution",
      "sexual reproduction advantage",
      "host-parasite arms race"
    ]
  },
  {
    "id": "2fc338e7cc9d3e18",
    "question_text": "Histone modifications (acetylation, methylation, phosphorylation) regulate gene expression by altering chromatin structure. How does histone acetylation typically affect transcription?",
    "options": {
      "A": "Histone acetylation permanently and irreversibly silences gene expression by covalently cross-linking adjacent nucleosomes into a crystalline array that excludes all transcription factors and RNA polymerase complexes from the DNA template for the remainder of the cell's lifetime, regardless of any subsequent signaling events",
      "B": "Histone acetylation has no consistent directional effect on transcription — it activates some genes and silences others with equal probability, and the direction of effect on any particular gene is determined entirely by the cell's circadian phase at the time of modification rather than by any inherent biochemical property of the acetyl mark itself",
      "C": "Histone acetylation generally activates transcription by neutralizing the positive charge on lysine residues in histone tails, weakening the electrostatic interaction between histones and negatively charged DNA — this loosens chromatin structure, making DNA more accessible to transcription factors and RNA polymerase",
      "D": "Histone acetylation activates gene expression by directly recruiting cytoplasmic ribosomes to the chromatin within the nucleus, allowing translation to occur simultaneously with transcription through a coupled transcription-translation mechanism that is identical to the co-transcriptional translation process found in prokaryotic cells lacking a nuclear envelope"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.755782,
    "y": 0.421826,
    "z": 0.494224,
    "source_article": "histone acetylation",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "histone acetylation",
      "chromatin remodeling",
      "epigenetic regulation",
      "histone code"
    ]
  },
  {
    "id": "8ab106dde959a90b",
    "question_text": "Hox genes control body segment identity along the anterior-posterior axis in animals. A mutation in a Drosophila Hox gene can transform one body segment into another (homeotic transformation). What property of Hox gene organization is remarkably conserved from flies to humans?",
    "options": {
      "A": "Hox genes are randomly scattered across all chromosomes with no spatial relationship, and their expression domains are determined entirely by independent enhancer elements on different chromosomes",
      "B": "All Hox genes in every animal species encode identical protein sequences with zero amino acid variation across 600 million years of evolution, from Drosophila to humans",
      "C": "Hox genes function only during embryonic development and are permanently deleted from all somatic cells after embryogenesis through programmed DNA excision",
      "D": "Collinearity: the order of Hox genes along the chromosome corresponds to their expression domains along the body axis — genes at the 3' end of the cluster are expressed in anterior structures, while genes at the 5' end are expressed posteriorly. This spatial and temporal collinearity is conserved from insects to vertebrates, reflecting an ancient genomic organizational principle that couples chromosomal position to developmental deployment along the body axis"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.54332,
    "y": 0.387956,
    "z": 0.463659,
    "source_article": "Hox genes",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "Hox genes",
      "collinearity",
      "evo-devo",
      "body plan evolution"
    ]
  },
  {
    "id": "bbcf0f708b6aa933",
    "question_text": "The minimal genome project (Mycoplasma mycoides JCVI-syn3.0) created a synthetic organism with only 473 genes — the smallest known genome capable of independent growth. What was a surprising finding from this project?",
    "options": {
      "A": "Approximately one-third of the essential genes in the minimal genome have completely unknown functions — they are required for viability but encode proteins with no recognizable homology to any characterized protein in existing databases, revealing fundamental gaps in our understanding of even the simplest cellular life",
      "B": "The synthetic organism could survive and reproduce normally with zero genes whatsoever, using only the lipid membrane and small molecules present in the growth medium to maintain all necessary metabolic activity through purely non-enzymatic chemical reactions catalyzed by trace metal ions dissolved in the surrounding culture medium at physiological concentrations",
      "C": "Every single gene in the minimal genome had a well-characterized function that was predicted correctly by computational bioinformatics analysis before the experimental genome reduction process began, confirming that modern bioinformatics can fully predict essential gene sets from DNA sequence data alone without requiring any experimental validation in living cells",
      "D": "The minimal organism grew faster than the wild-type parent strain because removing all non-essential genes eliminated significant metabolic overhead, conclusively demonstrating that natural genomes are bloated with dispensable genetic material that actively reduces organismal fitness under all environmental conditions that have been tested in laboratory settings"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.737735,
    "y": 0.330623,
    "z": 0.188548,
    "source_article": "synthetic biology",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "synthetic biology",
      "minimal genome",
      "essential genes",
      "functional genomics"
    ]
  },
  {
    "id": "ab0fb57b97a738c8",
    "question_text": "Island biogeography theory (MacArthur and Wilson, 1967) predicts species richness on islands as an equilibrium between immigration and extinction rates. According to the theory, which island would support the most species?",
    "options": {
      "A": "A small, remote island far from the mainland, because geographic isolation prevents competition from mainland species and allows extensive adaptive radiation into unfilled ecological niches without interference from immigrant species that might outcompete endemic forms attempting to diversify into new habitats on the isolated island",
      "B": "A large island near the mainland — larger islands support more species because they have lower extinction rates (more habitat, larger populations, more niches), and proximity to the mainland increases immigration rates. The equilibrium species number is highest when immigration is high and extinction is low",
      "C": "A medium-sized island at intermediate distance from the mainland, because the theory predicts a peak in species richness at intermediate values of both area and isolation due to nonlinear interaction between immigration and extinction rate curves at their optimal intersection point where both processes reach equilibrium simultaneously",
      "D": "A very small island directly adjacent to the mainland, because the extremely high immigration rate overwhelms any extinction effects and drives species richness toward the total mainland species pool size regardless of island area, available resources, habitat diversity, or any other ecological factor that might otherwise limit species number"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.602628,
    "y": 0.01,
    "z": 0.874326,
    "source_article": "island biogeography",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "island biogeography",
      "species-area relationship",
      "immigration-extinction balance",
      "MacArthur-Wilson theory"
    ]
  },
  {
    "id": "62b134a484120599",
    "question_text": "Liquid-liquid phase separation (LLPS) has emerged as a fundamental mechanism for cellular organization. What role does LLPS play in the cell, and why is it biologically significant?",
    "options": {
      "A": "LLPS produces permanent solid crystalline structures in the cytoplasm that serve as the cell's internal skeleton, replacing traditional cytoskeletal filaments with rigid protein crystals for structural support",
      "B": "LLPS is an artifact of in vitro experiments at artificially high protein concentrations and does not occur in living cells under normal physiological conditions where active metabolism prevents condensed phase formation",
      "C": "LLPS creates membraneless organelles — dynamic, liquid-like compartments (such as nucleoli, stress granules, and P-bodies) formed by multivalent protein and RNA interactions. These condensates concentrate specific molecules to enhance biochemical reactions, sequester components to suppress unwanted reactions, and can rapidly assemble or dissolve in response to cellular signals — providing a fast, energy-efficient mechanism for spatiotemporal organization without the need for lipid membranes",
      "D": "LLPS functions exclusively as a pathological process driving neurodegenerative diseases by causing toxic protein aggregation, serving no normal physiological role in healthy cells under any circumstances"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.856262,
    "y": 0.332353,
    "z": 0.770993,
    "source_article": "phase separation",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "phase separation",
      "membraneless organelles",
      "stress granules",
      "cellular organization"
    ]
  },
  {
    "id": "061e666762f7475e",
    "question_text": "Evo-devo research revealed that vastly different animal body plans (insects, vertebrates, mollusks) share a remarkably conserved genetic 'toolkit' for development. What does this conservation imply about the evolution of animal body plan diversity?",
    "options": {
      "A": "All animal body plans are genetically identical at the molecular level, and the morphological differences between phyla are entirely optical illusions created by differential pigmentation patterns overlaid on fundamentally identical underlying anatomical structures that have no structural basis distinguishing one phylum from another at the tissue or organ level",
      "B": "The toolkit genes independently evolved identical sequences in each animal phylum through convergent molecular evolution driven by identical selective pressures in the developmental environment, rather than being inherited from a common ancestor that already possessed these developmental regulators. This convergent origin explains why the protein sequences are similar despite the phyla having diverged hundreds of millions of years ago",
      "C": "Animal body plans became more complex by accumulating more toolkit genes through whole-genome duplications, with each phylum having a strictly larger gene repertoire",
      "D": "Major morphological differences between animal phyla arose primarily through changes in the regulation of shared toolkit genes — when, where, and how much they are expressed — rather than through the invention of entirely new genes. Changes in cis-regulatory elements can dramatically alter body plans while the protein-coding genes themselves remain conserved"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.51,
    "y": 0.312417,
    "z": 0.392715,
    "source_article": "evo-devo",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "evo-devo",
      "genetic toolkit",
      "cis-regulatory evolution",
      "body plan diversity"
    ]
  },
  {
    "id": "060840a57afaef7b",
    "question_text": "The RNA world hypothesis proposes that RNA preceded both DNA and proteins in early life. What evidence most strongly supports the idea that RNA could have served as both the genetic material and the primary catalyst in prebiotic chemistry?",
    "options": {
      "A": "The discovery of ribozymes — RNA molecules that catalyze chemical reactions, including the ribosome, where the peptidyl transferase center that forms peptide bonds is made entirely of RNA, not protein. This demonstrates that RNA can simultaneously store genetic information and catalyze biochemistry. Additionally, the building blocks of DNA (deoxyribonucleotides) are synthesized from RNA precursors (ribonucleotides) by ribonucleotide reductase in all living cells, suggesting RNA chemistry preceded DNA chemistry",
      "B": "Laboratory experiments show that double-stranded DNA spontaneously assembles from free nucleotides without enzymes, proving genetic polymers form easily under prebiotic conditions and therefore preceded RNA",
      "C": "All modern cells use protein enzymes exclusively for every catalytic reaction, with no known examples of catalytic RNA in any living organism, demonstrating protein catalysis is the only feasible form",
      "D": "Fossil evidence shows preserved RNA molecules in 4-billion-year-old Hadean rocks, directly demonstrating that RNA existed before the origin of cellular life"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.774133,
    "y": 0.198515,
    "z": 0.370625,
    "source_article": "RNA world hypothesis",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "RNA world hypothesis",
      "ribozymes",
      "ribosome",
      "prebiotic chemistry"
    ]
  },
  {
    "id": "4c6577c8a3f15866",
    "question_text": "The neutral theory of molecular evolution (Kimura, 1968) proposes that most evolutionary change at the molecular level is driven by genetic drift of selectively neutral mutations rather than natural selection. What key prediction distinguishes the neutral theory from strictly selectionist models?",
    "options": {
      "A": "The neutral theory predicts that functionally constrained regions of the genome like essential protein-coding sequences will evolve faster than unconstrained regions like pseudogenes, because neutral mutations are preferentially targeted to important genomic regions by a molecular mechanism that selectively increases local mutation rates at sites under the strongest purifying selection pressure, concentrating evolutionary change where functional consequences are greatest",
      "B": "The neutral theory predicts a roughly constant rate of molecular evolution (a 'molecular clock') for a given protein across different lineages, because the rate of neutral substitution equals the neutral mutation rate — which is independent of population size, generation time, and selection intensity. This clock-like behavior has been broadly confirmed for many proteins and is the basis of molecular dating techniques in phylogenetics",
      "C": "The neutral theory predicts every mutation has a measurable fitness effect and truly neutral mutations are physically impossible because the genetic code is perfectly optimized by natural selection",
      "D": "The neutral theory predicts large populations evolve faster at the molecular level because they generate more total mutations per generation"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.590315,
    "y": 0.107885,
    "z": 0.682461,
    "source_article": "neutral theory",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "neutral theory",
      "molecular clock",
      "genetic drift",
      "molecular evolution"
    ]
  },
  {
    "id": "07e3a609d10d3183",
    "question_text": "The CRISPR-Cas system in bacteria serves as an adaptive immune system against phages. How does a bacterium 'remember' a past viral infection and use that memory to defend against future attacks?",
    "options": {
      "A": "Bacteria remember infections through antibody-like surface proteins that bind viral coat proteins, encoded by immunoglobulin gene families undergoing somatic hypermutation",
      "B": "After surviving a phage infection, bacteria develop a thicker peptidoglycan cell wall that physically blocks all future phage attachment by increasing the distance between the outer membrane and cytoplasmic membrane beyond the reach of any phage tail fiber. This non-specific mechanical barrier provides broad-spectrum protection against all phage types regardless of their surface recognition specificity, and the increased wall thickness is heritable because the genes controlling peptidoglycan synthesis are permanently upregulated",
      "C": "During initial infection, the bacterium integrates short fragments of phage DNA (protospacers) into its CRISPR array as new spacers between repeated sequences. In subsequent infections, these spacers are transcribed and processed into guide RNAs (crRNAs) that direct Cas nucleases to complementary sequences in invading phage DNA, cleaving it and neutralizing the threat. The system requires PAM recognition to distinguish self from non-self DNA",
      "D": "Bacteria store methylation patterns marking previously encountered phage sequences, and restriction enzymes are reprogrammed to recognize specific phage patterns"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.749115,
    "y": 0.48763,
    "z": 0.690986,
    "source_article": "CRISPR adaptive immunity",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "CRISPR adaptive immunity",
      "spacer acquisition",
      "crRNA",
      "PAM recognition"
    ]
  },
  {
    "id": "4a3aa8fe6290b0c4",
    "question_text": "Transgenerational epigenetic inheritance — where environmentally-induced epigenetic changes in parents affect offspring phenotypes through the germline — has been demonstrated in some organisms. Why is this phenomenon controversial in mammals?",
    "options": {
      "A": "Transgenerational epigenetic inheritance is universally accepted in mammals with no controversy, because hundreds of studies have definitively proven parental exposures routinely reprogram offspring epigenomes",
      "B": "Mammalian DNA is chemically incapable of carrying any epigenetic modifications because the methylation machinery (DNMTs) that exists in plants and invertebrates was lost during the evolution of the mammalian lineage approximately 200 million years ago when the first true mammals diverged from their therapsid reptilian ancestors, leaving mammals with an exclusively genetic (sequence-based) inheritance system",
      "C": "Mammalian DNA is chemically incapable of carrying epigenetic modifications because the methylation machinery was lost during mammalian evolution approximately 200 million years ago",
      "D": "The mammalian lifecycle includes two waves of extensive epigenetic reprogramming — one during gametogenesis and another after fertilization — that erase most epigenetic marks. For transgenerational inheritance to occur, marks must survive both erasure events. Additionally, distinguishing true germline epigenetic inheritance from confounding factors (maternal provisioning, behavioral transmission, in utero exposure of F1 and F2 germline) requires studies reaching the F3 generation, which are technically demanding and rare"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.617176,
    "y": 0.361457,
    "z": 0.386189,
    "source_article": "transgenerational epigenetic inheritance",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "transgenerational epigenetic inheritance",
      "epigenetic reprogramming",
      "germline erasure",
      "F3 generation"
    ]
  },
  {
    "id": "1e3cf1b68184a065",
    "question_text": "Endosymbiotic theory explains the origin of mitochondria and chloroplasts. Beyond the well-known double membrane and bacterial-sized ribosomes, what molecular evidence most convincingly demonstrates that mitochondria descended from an alpha-proteobacterial ancestor?",
    "options": {
      "A": "Mitochondrial genome sequences are most closely related to alpha-proteobacteria (particularly the Rickettsiales order) in phylogenetic analyses, their ribosomes are inhibited by the same antibiotics that target bacterial (but not eukaryotic) ribosomes, and the inner mitochondrial membrane contains cardiolipin — a lipid otherwise found only in bacterial membranes. Additionally, mitochondria replicate by binary fission using FtsZ-related proteins, mirroring bacterial cell division",
      "B": "Mitochondria contain exactly the same genes as free-living alpha-proteobacteria, with no gene loss or transfer to the nucleus since the original endosymbiotic event",
      "C": "Mitochondria can survive and reproduce independently outside eukaryotic cells when cultured in bacterial growth media, demonstrating full metabolic independence",
      "D": "Electron microscopy reveals miniature flagella on mitochondrial outer membranes structurally identical to bacterial flagella, providing visual evidence of ancestry"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.827406,
    "y": 0.078182,
    "z": 0.018109,
    "source_article": "endosymbiotic theory",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "endosymbiotic theory",
      "molecular phylogenetics",
      "alpha-proteobacteria",
      "mitochondrial evolution"
    ]
  },
  {
    "id": "23469782d57532a9",
    "question_text": "The endosymbiotic origin of mitochondria is well-established, but the nature of the host cell that engulfed the alpha-proteobacterial ancestor remains debated. Why is the 'hydrogen hypothesis' (Martin and Müller, 1998) significant?",
    "options": {
      "A": "The hydrogen hypothesis argues that mitochondria evolved from photosynthetic cyanobacteria rather than alpha-proteobacteria, providing an alternative phylogenetic placement for mitochondrial ancestry supported by chloroplast-like genes",
      "B": "The hydrogen hypothesis proposes that the host was an archaeon that depended on hydrogen produced by the alpha-proteobacterial partner for methanogenesis. This metabolic syntrophy — not predation or phagocytosis — drove the symbiosis, implying that the eukaryotic cell arose directly from an archaeal-bacterial merger rather than from a pre-existing proto-eukaryote. This reframes eukaryogenesis as the origin event itself being the endosymbiosis, supported by the discovery that eukaryotes are phylogenetically nested within Archaea (Asgard archaea)",
      "C": "The hydrogen hypothesis demonstrates that mitochondria were never free-living organisms but were always internal compartments of archaeal cells that gradually acquired genomes through random gene transfer into membrane-bound vesicles",
      "D": "The hydrogen hypothesis claims that horizontal gene transfer from mitochondria to the nucleus never occurred, and all mitochondrial proteins are still encoded exclusively by the mitochondrial genome"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.851874,
    "y": 0.044037,
    "z": 0.0,
    "source_article": "hydrogen hypothesis",
    "domain_ids": [
      "biology"
    ],
    "concepts_tested": [
      "hydrogen hypothesis",
      "eukaryogenesis",
      "endosymbiosis",
      "archaeal host"
    ]
  }
]