[
  {
    "id": "c4f090880697f8a2",
    "question_text": "Working memory allows you to hold and manipulate information temporarily (e.g., remembering a phone number while dialing). What brain region is most consistently associated with working memory maintenance?",
    "options": {
      "A": "The prefrontal cortex, particularly the dorsolateral prefrontal cortex (dlPFC), which shows sustained neural activity during the delay period of working memory tasks",
      "B": "The cerebellum, which coordinates all forms of memory storage including working memory, episodic memory, and semantic memory through its extensive connections with the cortex",
      "C": "The occipital lobe, which stores visual information in a permanent and accessible buffer for later retrieval",
      "D": "The brainstem reticular formation, which maintains the arousal levels necessary for memory encoding"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.563792,
    "y": 0.964394,
    "z": 0.695816,
    "source_article": "working memory",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "working memory",
      "prefrontal cortex",
      "delay period activity"
    ]
  },
  {
    "id": "0f2063d4955e76a7",
    "question_text": "Patient H.M. had his medial temporal lobes (including hippocampi) surgically removed to treat epilepsy. What was the most striking cognitive consequence?",
    "options": {
      "A": "He lost the ability to see entirely, revealing that the hippocampal formation is the primary visual processing center responsible for conscious visual perception and the construction of stable visual representations of the external world from retinal input",
      "B": "He lost the ability to form new long-term declarative memories (anterograde amnesia) while retaining previously formed memories and the ability to learn new motor skills, revealing that declarative and procedural memory depend on different brain systems",
      "C": "He lost all memories from his entire life including his own name, native language, and all learned skills, demonstrating that the hippocampus is the sole permanent storage site for every form of memory in the human brain and that bilateral removal eliminates all previously consolidated information",
      "D": "He lost the ability to produce and comprehend spoken language, revealing that the hippocampus rather than Broca's and Wernicke's areas is the true language center"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.585259,
    "y": 0.99,
    "z": 0.570416,
    "source_article": "H.M. case study",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "H.M. case study",
      "anterograde amnesia",
      "declarative vs procedural memory",
      "hippocampus"
    ]
  },
  {
    "id": "7d6961c7410628af",
    "question_text": "The 'cocktail party effect' describes your ability to focus on one conversation in a noisy room. What does this demonstrate about attention?",
    "options": {
      "A": "The auditory system physically blocks sound waves from irrelevant conversations through a peripheral gating mechanism at the cochlear level",
      "B": "The brain processes all simultaneous conversations equally thoroughly and stores every word from every speaker in long-term memory for later retrieval",
      "C": "Selective attention acts as a filter that prioritizes processing of attended information while suppressing unattended input, though some salient information (like your name) can break through the filter",
      "D": "Attention is unnecessary because the brain automatically understands all simultaneous conversations without any selection or filtering process"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.478137,
    "y": 0.928324,
    "z": 0.05478,
    "source_article": "selective attention",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "selective attention",
      "cocktail party effect",
      "attentional filtering"
    ]
  },
  {
    "id": "d325b756d791a7f7",
    "question_text": "A patient with fusiform face area (FFA) damage cannot recognize familiar faces but can recognize objects and read text. What is this condition, and what does it reveal?",
    "options": {
      "A": "Aphasia, a language production and comprehension disorder — this reveals that the fusiform face area is actually the brain's primary language processing region rather than a face-specific area as previously thought",
      "B": "Visual agnosia for all object categories — this reveals that the fusiform face area is responsible for all visual object recognition including faces, tools, animals, and text rather than being face-specific",
      "C": "Blindsight, a condition in which the patient can respond to visual stimuli without conscious awareness of seeing them, revealing that the FFA mediates conscious visual experience",
      "D": "Prosopagnosia — face perception relies on specialized neural machinery (the FFA and associated network) functionally distinct from general object recognition"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.57746,
    "y": 0.977441,
    "z": 0.254015,
    "source_article": "prosopagnosia",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "prosopagnosia",
      "fusiform face area",
      "domain specificity",
      "face perception"
    ]
  },
  {
    "id": "5d014dad52def16d",
    "question_text": "The dual-process theory distinguishes System 1 (fast, automatic) from System 2 (slow, deliberate) thinking. What neural evidence supports this distinction?",
    "options": {
      "A": "Neuroimaging shows intuitive judgments engage subcortical and medial prefrontal regions with minimal effort, while deliberate reasoning recruits lateral prefrontal and parietal cortices associated with cognitive control and working memory — and the anterior cingulate cortex detects conflicts between these systems (as in Stroop tasks)",
      "B": "System 1 and System 2 are completely lateralized to the left and right cerebral hemispheres respectively, with no functional overlap between hemispheres and no interaction through the corpus callosum during decision-making tasks",
      "C": "System 1 operates exclusively during REM sleep processing while System 2 functions only during alert wakefulness, meaning the two systems are temporally segregated and never compete for cognitive resources",
      "D": "Both systems use identical brain regions activated to the same degree with no measurable neural distinction between automatic intuitive processing and effortful deliberate reasoning, because the dual-process distinction is purely behavioral with no underlying neuroanatomical basis according to neuroimaging studies conducted with fMRI, PET, and electrophysiology methods"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.544432,
    "y": 0.927435,
    "z": 0.442956,
    "source_article": "dual-process theory",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "dual-process theory",
      "cognitive control",
      "anterior cingulate cortex",
      "Stroop effect"
    ]
  },
  {
    "id": "33013bf33bcbfeba",
    "question_text": "Cognitive load theory predicts learning is impaired when working memory is overloaded. What limits working memory capacity, and how does expertise modulate it?",
    "options": {
      "A": "Working memory has no fixed capacity limit — apparent performance declines during high-load conditions reflect decreases in motivation and task engagement rather than any genuine architectural constraint on the number of items that can be simultaneously maintained in an active neural state",
      "B": "Working memory is limited to ~4±1 items (Cowan's focus of attention), constrained by the number of items maintainable in an active neural state. Expertise overcomes this through chunking — reorganizing information into larger meaningful units based on long-term memory schemas, so each 'slot' holds more information",
      "C": "Working memory capacity is fixed at exactly 7 items regardless of expertise level, domain knowledge, or strategic chunking, exactly as George Miller conclusively proved in his 1956 paper, which established an absolute and universal limit that has never been revised or refined by subsequent research in cognitive psychology or neuroscience",
      "D": "Working memory capacity is limited only by the speed at which sensory information can enter the brain through the peripheral nervous system, meaning that any apparent capacity limit is actually a bottleneck in perceptual processing at the level of sensory receptors and early cortical areas rather than a central cognitive limitation in the prefrontal cortex"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.476978,
    "y": 0.919379,
    "z": 0.449942,
    "source_article": "working memory capacity",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "working memory capacity",
      "cognitive load theory",
      "chunking",
      "Cowan's model"
    ]
  },
  {
    "id": "387383fe1dcff0fc",
    "question_text": "Mirror neurons fire both when performing and observing an action. What is the current scientific consensus on their role in human cognition?",
    "options": {
      "A": "Mirror neurons are definitively established as the sole neural basis of empathy, language evolution, and autism spectrum disorder, with damage to mirror neuron areas completely abolishing all forms of social cognition",
      "B": "Mirror neurons have never been found in humans — they exist only in macaque monkeys, and all claims about human mirror systems are based entirely on speculative extrapolation from non-human primate data",
      "C": "While mirror-like activity has been observed in human premotor and parietal cortices (via fMRI, MEG, and single-unit recordings in surgical patients), their precise role remains debated — they likely contribute to action understanding but grand claims about empathy, language evolution, and autism remain unsubstantiated",
      "D": "Mirror neurons are a purely theoretical construct that has never been directly observed in any species through single-unit recordings or any other neurophysiological method"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.533443,
    "y": 0.933367,
    "z": 0.350119,
    "source_article": "mirror neurons",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "mirror neurons",
      "action understanding",
      "overclaiming in neuroscience"
    ]
  },
  {
    "id": "028b11aa32e854b3",
    "question_text": "After arm amputation, Ramachandran documented somatosensory cortex reorganization producing phantom limb sensations. What specific pattern did he find?",
    "options": {
      "A": "The visual cortex takes over the deafferented somatosensory territory representing the missing limb, repurposing it for enhanced visual processing of the space where the limb used to be, which explains why amputees report heightened visual acuity in their peripersonal space near the amputation site",
      "B": "New neurons grow through adult neurogenesis to completely replace the lost cortical representation of the amputated limb, regenerating the original somatotopic map within the primary somatosensory cortex over a period of several months following the amputation surgery",
      "C": "The missing limb's cortical representation area in the primary somatosensory cortex becomes permanently silent and unresponsive to any stimulation, remaining as a non-functional cortical zone that never reorganizes or becomes responsive to inputs from any adjacent body representations",
      "D": "The deafferented hand area in S1 is invaded by adjacent cortical representations (face and upper arm areas, per the Penfield homunculus), so touching specific face points evokes precisely mapped referred sensations in the phantom hand"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.582557,
    "y": 0.953864,
    "z": 0.238173,
    "source_article": "cortical reorganization",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "cortical reorganization",
      "phantom limbs",
      "somatosensory plasticity",
      "Ramachandran"
    ]
  },
  {
    "id": "b69e828e41c903d3",
    "question_text": "The default mode network (DMN) is active during rest and mind-wandering but deactivates during focused tasks. What function does it serve, and what clinical significance does its disruption have?",
    "options": {
      "A": "The DMN supports internally-directed processes: self-referential thinking, autobiographical memory, future simulation, theory of mind, and spontaneous thought. Its disrupted connectivity is implicated in Alzheimer's disease (amyloid preferentially deposits in DMN regions), depression (DMN hyperactivity correlates with rumination), and schizophrenia (DMN fails to deactivate during tasks)",
      "B": "The DMN serves only motor planning and movement coordination functions and is primarily disrupted in Parkinson's disease and other basal ganglia disorders",
      "C": "The DMN is a methodological noise artifact of the blood-oxygen-level-dependent fMRI signal, generated by physiological fluctuations in respiration and cardiac cycles rather than by genuine neural activity, and therefore has no meaningful functional significance for cognition",
      "D": "The DMN is active exclusively during deep slow-wave sleep stages and plays no measurable role during waking cognition; its apparent resting-state activity in fMRI studies reflects pre-sleep drowsiness transitions rather than any active cognitive process, as demonstrated by simultaneous EEG-fMRI recordings that consistently show DMN correlates only appear when subjects begin transitioning from wakefulness into the earliest stages of non-REM sleep"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.582274,
    "y": 0.95394,
    "z": 0.69851,
    "source_article": "default mode network",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "default mode network",
      "self-referential processing",
      "Alzheimer's disease",
      "mind-wandering"
    ]
  },
  {
    "id": "8fad684975b1b9a0",
    "question_text": "The somatic marker hypothesis (Damasio) proposes emotional processes guide decision-making. What key evidence comes from the Iowa Gambling Task?",
    "options": {
      "A": "All decisions are fundamentally products of pure rational deliberation, and emotional processes only interfere with optimal decision-making by introducing irrational biases",
      "B": "Patients with vmPFC damage perform normally on IQ tests but make catastrophically poor real-life decisions — on the Iowa Gambling Task, they persistently choose high-risk decks, failing to develop anticipatory skin conductance responses (somatic markers) that guide healthy subjects away from disadvantageous options, showing that rational deliberation alone is insufficient for adaptive decision-making",
      "C": "The amygdala is the sole brain region responsible for all decision-making processes, and damage restricted to the amygdala alone completely eliminates the ability to make any choices, whether emotional or rational, simple or complex; the ventromedial prefrontal cortex merely relays sensory information to the amygdala without performing any independent evaluation or integration of reward values, somatic signals, or emotional associations relevant to the decision at hand",
      "D": "Patients with ventromedial prefrontal cortex damage cannot perform any cognitive tasks whatsoever — including basic arithmetic, language comprehension, visual perception, and working memory tasks — because the vmPFC is the central hub of all higher cognitive processing, and its damage produces global cognitive collapse affecting every domain of intellectual function measured by standardized neuropsychological assessments"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.58839,
    "y": 0.923427,
    "z": 0.12668,
    "source_article": "somatic marker hypothesis",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "somatic marker hypothesis",
      "Iowa Gambling Task",
      "vmPFC",
      "emotion in decision-making"
    ]
  },
  {
    "id": "d1922e738511abf9",
    "question_text": "Predictive coding theory proposes the brain actively generates predictions rather than passively receiving sensory input. What is the key computational mechanism?",
    "options": {
      "A": "The brain passively waits for complete sensory information to arrive before forming any perceptual interpretation, building representations only from bottom-up sensory data without generating prior expectations",
      "B": "The brain simply stores all incoming sensory data without any interpretation, filtering, or prediction, functioning as a passive recording device that faithfully logs every stimulus",
      "C": "Higher cortical areas generate top-down predictions sent to lower areas. Lower areas compute prediction errors (mismatch between predicted and actual input). Only errors propagate upward while confirmed predictions are suppressed. Perception emerges from iteratively minimizing prediction error across the cortical hierarchy",
      "D": "Predictive coding is a computational framework that applies exclusively to motor control and action planning in the premotor cortex, with no relevance to sensory perception or perceptual inference"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.519309,
    "y": 0.862528,
    "z": 0.741083,
    "source_article": "predictive coding",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "predictive coding",
      "prediction error",
      "hierarchical processing",
      "Bayesian brain"
    ]
  },
  {
    "id": "87ad6c7fa0ef3475",
    "question_text": "The binding problem asks how the brain integrates features processed in different areas (color in V4, motion in V5) into unified percepts. What is the leading neurophysiological theory?",
    "options": {
      "A": "All visual features including color, motion, form, depth, and texture are processed within a single unified brain area, making the binding problem unnecessary because there is never any separation of feature processing that would require subsequent integration — the entire visual scene is analyzed holistically by one cortical module that represents all features of every object simultaneously in a single unified neural population code",
      "B": "Visual features are permanently bound together through dedicated physical axonal connections directly linking every feature-detecting neuron with every other feature-detecting neuron in a fixed anatomical wiring pattern that is established during embryonic development and remains unchanged throughout adult life regardless of experience, learning, or attentional demands",
      "C": "The binding problem is a purely philosophical thought experiment with absolutely no neural correlate or empirical neuroscience research investigating it; it exists only as an abstract topic in philosophy of mind discussions and has never been the subject of serious neurophysiological or neuroimaging investigation in any cognitive neuroscience research laboratory anywhere in the world",
      "D": "Temporal synchrony: neurons representing different features of the same object synchronize their firing (often in gamma band, 30-80 Hz), creating a temporal code that distinguishes features of one object from another. Attention enhances gamma synchronization among relevant neurons, consistent with Treisman's finding that binding requires attentional selection"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.512224,
    "y": 0.927142,
    "z": 0.406469,
    "source_article": "binding problem",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "binding problem",
      "temporal synchrony",
      "gamma oscillations",
      "feature integration"
    ]
  },
  {
    "id": "1e611d749c9a6565",
    "question_text": "Theory of mind (ToM) has been linked to the temporoparietal junction (TPJ), but recent evidence has complicated simple localization. What is the current understanding?",
    "options": {
      "A": "ToM relies on a distributed network: bilateral TPJ (self-other distinction), medial PFC (modeling others' beliefs), precuneus/PCC (perspective-taking), and anterior temporal lobes (social schemas). The TPJ alone is insufficient — it has a ToM-specific sub-region that overlaps with but is distinct from the domain-general attention-reorienting network",
      "B": "ToM is entirely localized in the right temporoparietal junction with absolutely no involvement from any other brain regions, and bilateral TPJ, medial prefrontal cortex, and anterior temporal regions play no role",
      "C": "Theory of mind requires only the motor cortex, because understanding other people's mental states is based purely on simulation of their physical movements through mirror neuron activity",
      "D": "Theory of mind has no consistent neural basis whatsoever — different neuroimaging studies find completely different and non-overlapping brain regions, with no replicable activation pattern emerging across the literature, suggesting that mentalizing does not depend on any specific neural architecture but rather emerges randomly from distributed processing across whichever brain areas happen to be active at any given moment during a social cognition task"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.587148,
    "y": 0.908466,
    "z": 0.678905,
    "source_article": "theory of mind",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "theory of mind",
      "temporoparietal junction",
      "mentalizing network",
      "social cognition"
    ]
  },
  {
    "id": "5c126e2b13b7b485",
    "question_text": "Global neuronal workspace theory (Dehaene) and integrated information theory (Tononi) are two leading theories of consciousness. What is the fundamental difference?",
    "options": {
      "A": "Both theories are fundamentally identical and make exactly the same predictions about which brain regions are necessary and sufficient for conscious experience",
      "B": "Global workspace theory proposes consciousness arises when information is broadcast widely across prefrontal-parietal networks via long-range recurrent connections, focusing on the function of consciousness (access). IIT proposes consciousness IS integrated information (Φ), a mathematical quantity, focusing on intrinsic structure. They diverge: GNW predicts posterior-to-anterior ignition; IIT predicts posterior 'hot zones' suffice and Φ can exist without global broadcast",
      "C": "Global workspace theory proposes that consciousness is a complete illusion generated by the brain's information processing without any real phenomenal experience, while integrated information theory asserts that consciousness is a fundamental property of the universe present in all physical systems including individual atoms, thermostats, and simple logic gates — meaning these theories represent maximally opposing positions on the metaphysics of consciousness, with one being eliminativist and the other being extreme panpsychist, yet paradoxically both arriving at identical empirical predictions about which neural correlates should be observed during conscious versus unconscious processing",
      "D": "Both theories agree that consciousness resides exclusively in the brainstem reticular activating system and that cortical neural activity is entirely irrelevant to conscious experience — neither prefrontal-parietal networks nor posterior cortical hot zones contribute anything meaningful to the generation of phenomenal consciousness, and all cortical correlates of consciousness identified in neuroimaging studies reflect post-conscious processing of information that has already been rendered conscious by brainstem mechanisms alone"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.517843,
    "y": 0.89099,
    "z": 0.304809,
    "source_article": "global neuronal workspace",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "global neuronal workspace",
      "integrated information theory",
      "consciousness theories"
    ]
  },
  {
    "id": "384d72963f1b0f32",
    "question_text": "Embodied cognition argues cognitive processes are shaped by bodily interactions with the environment. What is the strongest evidence and the most serious criticism?",
    "options": {
      "A": "Embodied cognition has been completely disproven by large-scale neuroimaging meta-analyses demonstrating that abstract conceptual processing occurs exclusively in amodal association cortices with absolutely no involvement of sensorimotor systems under any task conditions, stimulus modalities, or experimental paradigms — every published study claiming motor cortex activation during language comprehension has been shown to reflect spillover activation from adjacent premotor planning regions rather than genuine semantic embodiment effects, according to comprehensive reviews of the literature",
      "B": "Embodied cognition predicts that all cognitive operations without exception require concurrent physical movement of the body or motor system activation, a prediction that has been universally confirmed across every experiment ever conducted in cognitive psychology and neuroscience — including studies of abstract mathematical reasoning, logical deduction, moral judgment, and aesthetic appreciation, all of which show robust and obligatory motor cortex activation that is abolished by temporary motor cortex disruption via transcranial magnetic stimulation",
      "C": "Evidence includes motor-semantic interactions (action sentences activate motor cortex, Hauk et al. 2004) and spatial-numerical associations (SNARC). However, landmark findings like the warm cup effect (Williams & Bargh 2008) failed to replicate in large pre-registered studies. The critical distinction: weak embodiment (sensorimotor systems contribute to some abstract representations) is well-supported, while strong embodiment (all cognition is constitutively embodied) is unsubstantiated",
      "D": "The evidence for embodied cognition comes exclusively from studies of language processing and has absolutely no application to perception, action, mathematical reasoning, spatial cognition, social cognition, or any other cognitive domain — the theory's empirical support is limited entirely to demonstrations that concrete action verbs activate motor cortex, with no evidence for embodiment effects in any abstract cognitive process beyond simple verb comprehension tasks conducted in laboratory settings with university student participants"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.501204,
    "y": 0.900014,
    "z": 0.170802,
    "source_article": "embodied cognition",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "embodied cognition",
      "replication crisis",
      "weak vs strong embodiment"
    ]
  },
  {
    "id": "4abe21432e311301",
    "question_text": "Attention deficit hyperactivity disorder (ADHD) has traditionally been explained by dopaminergic dysfunction. What more comprehensive neurobiological model has emerged, and what evidence supports it?",
    "options": {
      "A": "ADHD is caused exclusively by structural damage to the cerebellum, which is the sole brain region responsible for sustaining attention, inhibiting impulsive behaviors, and regulating hyperactive motor output across all developmental stages",
      "B": "ADHD is a purely psychological condition with no neurobiological basis, meaning that brain imaging studies, genetic association studies, and pharmacological treatment data are all irrelevant to understanding its etiology or developing effective interventions",
      "C": "ADHD results from a single point mutation in the dopamine transporter gene DAT1 that completely eliminates dopamine reuptake at all synapses throughout the brain, producing uniformly elevated synaptic dopamine concentrations that account for every behavioral symptom observed in the disorder",
      "D": "ADHD involves dysregulation of multiple large-scale brain networks: the frontoparietal control network (executive dysfunction), default mode network (inappropriate intrusion during tasks, explaining mind-wandering), and ventral attention network (impaired salience detection). The 'default mode interference' hypothesis proposes that ADHD symptoms arise partly from failure to suppress DMN activity during externally focused tasks, supported by fMRI showing atypical DMN-task network anticorrelation and by the therapeutic mechanism of stimulants (which enhance catecholaminergic signaling to restore network dynamics)"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.579736,
    "y": 0.920313,
    "z": 0.531206,
    "source_article": "ADHD neurobiology",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "ADHD neurobiology",
      "default mode interference",
      "network dysfunction",
      "stimulant mechanism"
    ]
  },
  {
    "id": "59a3387f5dd92872",
    "question_text": "Relational reasoning — understanding relationships between relationships (analogy) — is considered a hallmark of human intelligence. What neural substrate supports it, and how does development constrain it?",
    "options": {
      "A": "The rostrolateral PFC (RLPFC, BA10) sits at the apex of a PFC abstraction gradient: posterior PFC handles stimulus-response, mid-PFC handles contextual rules, RLPFC integrates relations between relations. RLPFC matures last (into mid-20s), explaining why analogical reasoning and fluid intelligence emerge gradually through childhood, tracking PFC myelination trajectories",
      "B": "Relational reasoning has no specific neural substrate and emerges entirely from increases in general processing speed during development, with no particular brain region showing selective activation for analogical reasoning tasks compared to simpler cognitive operations",
      "C": "Relational reasoning depends exclusively on the cerebellum, which explains why patients with cerebellar lesions from movement disorders like Parkinson's disease show the most severe deficits in analogical reasoning and fluid intelligence",
      "D": "The hippocampus is the sole neural substrate for relational reasoning and analogical thinking, and it is fully anatomically and functionally mature at birth, which is why infants can perform complex analogical reasoning tasks from the earliest days of life"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.566456,
    "y": 0.921896,
    "z": 0.740453,
    "source_article": "relational reasoning",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "relational reasoning",
      "rostrolateral PFC",
      "abstraction hierarchy",
      "cognitive development"
    ]
  },
  {
    "id": "f70d4cfd31dc902b",
    "question_text": "The free energy principle (Friston) attempts to unify perception, action, and learning. What does it propose, and how does it relate to predictive coding?",
    "options": {
      "A": "The free energy principle states that the brain actively maximizes surprise and prediction error in order to learn efficiently from the environment",
      "B": "All self-organizing biological systems minimize variational free energy — an upper bound on surprise. Perception minimizes free energy by updating models to predict input (equivalent to predictive coding). Action minimizes it by changing sensory input to match predictions (active inference). Learning optimizes model parameters over longer timescales. This unifies these processes under one imperative: minimize divergence between the organism's model and the world's statistical structure",
      "C": "The free energy principle applies exclusively to thermodynamic systems operating near thermal equilibrium and is completely irrelevant to biological neural systems such as the brain; its mathematical formalism derives entirely from statistical mechanics of ideal gases and phase transitions in condensed matter, and any apparent connection to neuroscience is a superficial analogy that breaks down under rigorous mathematical scrutiny when the formalism is applied to the nonlinear, far-from-equilibrium dynamics of neural circuits processing information in real biological organisms",
      "D": "The free energy principle is simply an alternative name for standard reinforcement learning algorithms and offers no additional explanatory power or theoretical insight beyond what temporal difference learning, Q-learning, and policy gradient methods already provide; the entire framework can be reduced without remainder to a restatement of the Bellman equation with different notation, and its claims about unifying perception, action, and learning under a single variational principle are merely a reformulation of existing ideas from machine learning with no novel predictions or unique empirical implications for neuroscience"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.483618,
    "y": 0.843,
    "z": 0.641935,
    "source_article": "free energy principle",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "free energy principle",
      "active inference",
      "variational free energy",
      "Friston"
    ]
  },
  {
    "id": "aba30c4ce57ae04c",
    "question_text": "The hippocampus has long been associated with memory, but recent evidence suggests a more fundamental role. What is the emerging unified theory?",
    "options": {
      "A": "The hippocampus functions solely as a long-term memory storage vault with absolutely no role in spatial navigation, mental imagery, or future imagination",
      "B": "The hippocampus functions purely as an emotional processing center equivalent to the amygdala, with its role in memory being a misinterpretation of lesion data",
      "C": "The hippocampus implements a relational/constructive system: it binds arbitrary elements into flexible representations supporting episodic memory, spatial navigation (place cells, grid cells), future imagination, and transitive inference. The unifying principle is creating index-like relational codes recombined to simulate novel experiences — explaining why hippocampal damage impairs both past recall and future imagination (Hassabis et al. 2007)",
      "D": "The hippocampus is exclusively involved in spatial navigation and place-based mapping of the physical environment; its well-documented role in episodic memory formation, future imagination, and constructive simulation is entirely an artifact of imprecise lesion boundaries in human patient studies that inadvertently damaged adjacent medial temporal lobe structures including the entorhinal, perirhinal, and parahippocampal cortices, while the hippocampus proper contributes nothing beyond a cognitive map of allocentric space"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.544582,
    "y": 0.943247,
    "z": 1.0,
    "source_article": "hippocampal function",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "hippocampal function",
      "cognitive map theory",
      "constructive episodic simulation",
      "relational memory"
    ]
  },
  {
    "id": "87a0a9650252eb08",
    "question_text": "Phase-amplitude coupling (PAC) in neural oscillations: the theta-gamma code in the hippocampus. What is the mechanism and what cognitive function does it serve?",
    "options": {
      "A": "Brain waves detected by EEG and MEG are random noise artifacts generated entirely by blood flow pulsations, muscle contractions, and electromagnetic interference from the recording equipment rather than by genuine synchronized neural activity; no systematic relationship exists between oscillatory patterns and any cognitive process, and all published findings of task-related oscillatory modulations reflect statistical artifacts of insufficient multiple-comparison correction rather than real neural phenomena",
      "B": "Phase-amplitude coupling means gamma oscillations simply co-occur temporally with theta oscillations through coincidental timing without any systematic relationship between gamma amplitude and theta phase; the apparent statistical coupling reported in electrophysiology studies reflects volume conduction artifacts and harmonic contamination from the theta signal itself rather than genuine cross-frequency neural interactions with functional significance for memory coding or information organization",
      "C": "Phase-amplitude coupling applies exclusively to visual processing in the occipital lobe and has never been observed in the hippocampus, prefrontal cortex, or any other brain region; the theta-gamma coupling reported in hippocampal recordings is a technical artifact of the high signal-to-noise ratio in hippocampal local field potentials combined with the broad spectral power distribution inherent to theta oscillations, which creates spurious apparent coupling with higher frequency bands",
      "D": "Gamma amplitude is modulated by theta phase — gamma bursts nest within specific theta cycle phases. Different memory items are represented by distinct gamma cycles within successive theta phases, creating an ordered temporal code. Lisman & Jensen (2013) proposed the number of gamma cycles fitting within one theta cycle (~7±2) may explain the classical working memory capacity limit"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.544608,
    "y": 0.917068,
    "z": 0.744635,
    "source_article": "phase-amplitude coupling",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "phase-amplitude coupling",
      "theta-gamma code",
      "neural oscillations",
      "working memory capacity"
    ]
  },
  {
    "id": "df874681522e8073",
    "question_text": "Broca's area damage produces non-fluent aphasia, while Wernicke's area damage produces fluent aphasia. What conceptual distinction about language processing does this double dissociation reveal?",
    "options": {
      "A": "Language production and language comprehension are supported by at least partially distinct neural systems — Broca's area is critical for the motor planning and grammatical assembly of speech, while Wernicke's area supports the comprehension and semantic processing of language input",
      "B": "All language functions are localized exclusively within a single unified brain region that handles every aspect of linguistic processing, including phonology, syntax, semantics, pragmatics, and prosody, with absolutely no dissociable or separable component processes distributed across different cortical or subcortical areas",
      "C": "Language is processed entirely within the cerebellum and associated subcortical motor nuclei with no cortical involvement whatsoever, meaning that the cerebral cortex plays absolutely no role in any aspect of language comprehension, production, reading, writing, or sign language processing",
      "D": "Broca's and Wernicke's areas perform identical computational functions within the language network and damage to either region produces exactly the same clinical syndrome of complete language loss, with no qualitative differences in the pattern of linguistic deficits observed between anterior and posterior lesion sites"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.557109,
    "y": 0.967936,
    "z": 0.277101,
    "source_article": "aphasia",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "aphasia",
      "double dissociation",
      "language networks",
      "Broca vs Wernicke"
    ]
  },
  {
    "id": "a82b43893bd6d7e5",
    "question_text": "The Stroop effect demonstrates interference when color-naming words printed in incongruent colors (e.g., the word 'RED' printed in blue ink). What cognitive principle does this interference reveal?",
    "options": {
      "A": "The Stroop effect occurs because people cannot see colors at all and must rely entirely on reading",
      "B": "The Stroop effect reveals that reading is an automated process that cannot be voluntarily suppressed — word reading occurs automatically and competes with the slower, controlled process of color naming, demonstrating conflict between automatic and controlled processing pathways",
      "C": "The Stroop effect is caused by a visual illusion where ink colors physically change when words are present",
      "D": "The Stroop effect demonstrates that all cognitive processes operate at exactly the same processing speed with no automaticity differences between them — reading words, naming colors, performing arithmetic, recognizing faces, and detecting motion all require identical amounts of cognitive effort and attentional resources, with no process ever becoming automated through practice or developmental maturation"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.456683,
    "y": 0.928853,
    "z": 0.170902,
    "source_article": "Stroop effect",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "Stroop effect",
      "automaticity",
      "cognitive control",
      "interference"
    ]
  },
  {
    "id": "6910f0911816e985",
    "question_text": "Inattentional blindness (Simons & Chabris gorilla experiment) shows that people can fail to notice salient events when their attention is engaged elsewhere. What does this demonstrate about the relationship between attention and conscious perception?",
    "options": {
      "A": "Humans possess perfect and comprehensive perception of every single object, event, and stimulus present in their entire visual field at all times, regardless of where their attention is directed — attentional focus has absolutely no influence on conscious visual awareness, and the visual system processes all information in the environment with equal completeness and fidelity",
      "B": "Inattentional blindness is an artificial laboratory phenomenon that occurs only under highly controlled experimental conditions using specific computerized displays, and it never happens in real-world situations such as driving, crossing streets, performing surgery, or engaging in any practical activity — ecologically valid studies have consistently failed to replicate the gorilla experiment findings",
      "C": "Attention is necessary but not sufficient for conscious perception — stimuli that are not attended to may fail to reach awareness even when they are fully visible and foveated, revealing that conscious experience depends on attentional selection rather than mere retinal stimulation",
      "D": "The gorilla was actually invisible to the human eye due to its particular shade of fur"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.4948,
    "y": 0.937962,
    "z": 0.0,
    "source_article": "inattentional blindness",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "inattentional blindness",
      "attention and awareness",
      "conscious perception",
      "selective attention"
    ]
  },
  {
    "id": "795481a1391523f9",
    "question_text": "The distinction between explicit (declarative) and implicit (non-declarative) memory is one of the foundational divisions in memory research. What evidence most compellingly supports this as a genuine neurobiological distinction rather than just a descriptive taxonomy?",
    "options": {
      "A": "There is no credible evidence for distinct memory systems operating within the human brain — all forms of memory, including episodic memory, semantic knowledge, procedural skills, priming effects, and conditioned responses, are stored within a single unified memory system located in a single brain structure, with no meaningful dissociations observed in any patient population or experimental paradigm",
      "B": "Explicit and implicit memory share completely identical neural substrates distributed uniformly across the entire brain, and any damage to any brain region will always impair both memory systems equally and simultaneously, with no possibility of selective impairment of one system while the other remains intact, as has been consistently demonstrated in all lesion and neuroimaging studies",
      "C": "Both explicit and implicit memory systems are located exclusively within the prefrontal cortex with absolutely no subcortical involvement from the hippocampus, basal ganglia, cerebellum, amygdala, or any other structure outside the frontal lobes — all forms of learning and memory depend entirely on prefrontal neural circuits, with no contribution from medial temporal lobe or striatal regions whatsoever",
      "D": "Amnesic patients with hippocampal damage cannot form new explicit memories (episodic, semantic) but show intact implicit learning (priming, skill acquisition, classical conditioning) — this dissociation proves the systems have distinct neural substrates, with explicit memory depending on medial temporal lobe structures and implicit memory on basal ganglia, cerebellum, and neocortex"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.520894,
    "y": 0.988397,
    "z": 0.574396,
    "source_article": "memory systems",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "memory systems",
      "explicit vs implicit",
      "hippocampal amnesia",
      "neurobiological dissociation"
    ]
  },
  {
    "id": "637d99328f40f4e5",
    "question_text": "Cognitive maps, first proposed by Tolman (1948) for spatial navigation, have been extended to abstract conceptual spaces. What neural evidence supports the idea that the hippocampal-entorhinal system represents non-spatial knowledge using map-like codes?",
    "options": {
      "A": "Grid-like neural firing patterns (hexagonal periodicity) have been observed in fMRI and electrophysiology during navigation of abstract conceptual spaces (e.g., morphed bird shapes, social hierarchies) — suggesting the hippocampal-entorhinal system provides a general-purpose relational mapping architecture that organizes both spatial and conceptual knowledge",
      "B": "Grid cells located in the medial entorhinal cortex fire in precise hexagonal spatial patterns exclusively and only during physical locomotion through real physical environments, and they have absolutely no role whatsoever in non-spatial cognition, abstract conceptual reasoning, social hierarchy navigation, value-based decision making, or any cognitive process that does not involve literal bodily movement through three-dimensional geographic space",
      "C": "The hippocampus is exclusively and entirely involved in voluntary motor control, muscle coordination, and postural balance, with absolutely no role in episodic memory formation, spatial navigation, cognitive mapping, relational binding, or conceptual representation of any kind — all evidence suggesting hippocampal involvement in memory and navigation has been thoroughly disproven by modern lesion and neuroimaging studies",
      "D": "Cognitive maps exist only as a metaphor with no neural implementation in any brain structure"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.562608,
    "y": 0.911155,
    "z": 0.685811,
    "source_article": "cognitive maps",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "cognitive maps",
      "grid cells",
      "conceptual spaces",
      "hippocampal-entorhinal system"
    ]
  },
  {
    "id": "c665204804654516",
    "question_text": "The 'levels of processing' framework (Craik & Lockhart, 1972) challenged the multi-store memory model. What is its central claim about memory encoding?",
    "options": {
      "A": "Memory depends solely on how long information is rehearsed, regardless of how it is processed",
      "B": "Deeper, more meaningful processing (semantic analysis, relating to existing knowledge) produces stronger and more durable memories than shallow processing (phonological or structural analysis) — memory is a byproduct of the depth of cognitive processing at encoding, not of which 'store' information occupies",
      "C": "All forms of processing produce identical memory traces with no difference in durability or retrievability",
      "D": "Shallow processing of surface-level perceptual features such as font style, letter case, and visual appearance always produces substantially better long-term memory than deep semantic processing involving meaningful elaboration, because surface features create more distinctive and memorable traces that are easier to encode, store, and retrieve from long-term memory at every retention interval tested"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.443642,
    "y": 0.946195,
    "z": 0.396534,
    "source_article": "levels of processing",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "levels of processing",
      "encoding depth",
      "semantic processing",
      "memory formation"
    ]
  },
  {
    "id": "1291ce6cd4695ad3",
    "question_text": "Executive functions are a family of top-down cognitive control processes. Miyake et al. (2000) identified three core executive functions through latent variable analysis. What are they?",
    "options": {
      "A": "The three core executive functions identified through latent variable analysis in the Miyake framework are breathing regulation, cardiovascular heartbeat modulation, and digestive enzyme secretion — these represent the fundamental autonomic nervous system processes that govern involuntary bodily functions and require no conscious cognitive control or top-down attentional resources to operate effectively",
      "B": "The three core executive functions are visual perception of color and form, auditory processing of pitch and timbre, and tactile discrimination of texture and pressure — these sensory modalities represent the brain's primary information channels and were identified through confirmatory factor analysis as the fundamental building blocks of all higher-order cognitive processing and executive control",
      "C": "Inhibition (suppressing prepotent responses), shifting (flexibly switching between tasks or mental sets), and updating (monitoring and revising working memory contents) — these three are correlated but separable, reflecting both a common executive control factor and distinct component processes",
      "D": "The three core executive functions described in the Miyake framework are the motor skills of running speed and endurance, jumping height and distance, and throwing accuracy and force — these fundamental motor capacities are controlled by the frontal lobes and represent the foundational processes that underlie all forms of executive cognitive control and self-regulation of behavior"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.530119,
    "y": 0.910925,
    "z": 0.339856,
    "source_article": "executive functions",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "executive functions",
      "Miyake model",
      "inhibition",
      "cognitive flexibility"
    ]
  },
  {
    "id": "0dd6badb8bc54723",
    "question_text": "Hemispatial neglect, typically following right parietal damage, causes patients to ignore the left side of space. Why does right hemisphere damage produce more severe neglect than left hemisphere damage?",
    "options": {
      "A": "Both the left and right cerebral hemispheres produce completely identical patterns of spatial neglect following damage, with absolutely no lateralization difference observed in any clinical study — left hemisphere lesions and right hemisphere lesions produce equally severe contralateral neglect of equal duration, severity, and prognosis, contradicting the widely documented but erroneous claim of right hemisphere dominance for spatial attention",
      "B": "Hemispatial neglect is caused exclusively by damage to the retina and optic nerves of the eyes rather than by any damage to cortical or subcortical brain structures — the parietal cortex, frontal eye fields, and subcortical attention networks play absolutely no role in spatial awareness, and all neglect phenomena can be fully explained by peripheral sensory loss without invoking any central attentional mechanism",
      "C": "The right cerebral hemisphere has absolutely no role whatsoever in spatial attention, visuospatial processing, or environmental awareness and is devoted entirely and exclusively to language comprehension, speech production, grammatical processing, and phonological analysis — spatial attention is controlled completely by the left hemisphere, making right hemisphere damage irrelevant to spatial awareness and neglect",
      "D": "The left hemisphere attends only to right space, while the right hemisphere attends to both left AND right hemispace — so right hemisphere damage leaves only the left hemisphere's rightward bias, producing severe left neglect, whereas left hemisphere damage is compensated by the right hemisphere's bilateral attention"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.562053,
    "y": 0.967466,
    "z": 0.38783,
    "source_article": "hemispatial neglect",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "hemispatial neglect",
      "spatial attention",
      "hemispheric asymmetry",
      "parietal cortex"
    ]
  },
  {
    "id": "a55329546eeb1ff6",
    "question_text": "The reconsolidation hypothesis proposes that retrieved memories become temporarily labile and must be restabilized. What are the implications of this for eyewitness testimony?",
    "options": {
      "A": "Each time a memory is retrieved, it enters an unstable state where it can be updated, distorted, or contaminated by new information before reconsolidation — this means post-event questioning, media exposure, or leading questions during retrieval can permanently alter the original memory trace, undermining the assumed reliability of eyewitness accounts",
      "B": "Memories are permanently and irrevocably fixed at the precise moment of initial encoding and can never be modified, updated, distorted, or altered in any way by subsequent experiences, retrieval attempts, post-event information, misleading questions, or the passage of time — this permanence makes eyewitness testimony inherently and perfectly reliable as a form of legal evidence in all criminal and civil proceedings",
      "C": "Reconsolidation as a neurobiological phenomenon affects only procedural motor memories such as those involved in riding a bicycle, swimming, typing on a keyboard, or playing a musical instrument, and it has absolutely no relevance whatsoever to episodic memories, autobiographical recollections, eyewitness accounts, or any form of declarative memory that could be relevant to legal testimony",
      "D": "Reconsolidation strengthens memories and makes them more accurate each time they are retrieved"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.459223,
    "y": 0.977741,
    "z": 0.571659,
    "source_article": "reconsolidation",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "reconsolidation",
      "memory malleability",
      "eyewitness testimony",
      "post-retrieval modification"
    ]
  },
  {
    "id": "d625ea3e349db5ef",
    "question_text": "The ventral ('what') and dorsal ('where/how') visual streams process different aspects of visual information. What is the strongest evidence that these streams serve genuinely different functions rather than merely processing different features?",
    "options": {
      "A": "The ventral and dorsal visual streams are completely identical parallel pathways that process all aspects of visual information in precisely the same computational manner, with no functional specialization, no dissociable processing goals, no distinct cortical termination points, and no differential vulnerability to selective brain damage — the distinction between 'what' and 'where/how' processing is entirely theoretical with no empirical support from neuropsychological or neuroimaging studies",
      "B": "Patient D.F. (visual form agnosia from ventral stream damage) cannot recognize or describe object shapes but can accurately reach for and grasp them with appropriate hand aperture — while optic ataxia patients (dorsal stream damage) can recognize objects but misreach for them, providing a double dissociation between perception-for-recognition and perception-for-action",
      "C": "Both the ventral and dorsal visual processing streams terminate in exactly the same cortical area within the inferior temporal lobe, produce identical patterns of neural activation in response to all visual stimuli, and show no functional differences in how they process object identity, spatial location, or visuomotor transformations — the apparent double dissociation between perception and action is an artifact of inconsistent neuropsychological testing procedures",
      "D": "The distinction exists only in non-human primates and not in the human brain"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.552901,
    "y": 0.944147,
    "z": 0.166202,
    "source_article": "visual streams",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "visual streams",
      "ventral vs dorsal",
      "Milner-Goodale model",
      "double dissociation"
    ]
  },
  {
    "id": "063c3c816c7ff79a",
    "question_text": "Cognitive reserve explains why some individuals with extensive Alzheimer's pathology maintain normal cognitive function while others with less pathology show dementia. What factors contribute to cognitive reserve?",
    "options": {
      "A": "Cognitive reserve is determined solely and exclusively by total brain volume and cranial capacity, with absolutely no contribution from any life experience factor including formal education level, occupational complexity, bilingual language proficiency, social network size, physical exercise habits, cognitive engagement, musical training, or any other environmental or behavioral variable that has been proposed to build resilience against neurodegenerative pathology",
      "B": "Cognitive reserve is a fixed genetic trait that cannot be modified by any environmental factor or life experience",
      "C": "Higher education, occupational complexity, bilingualism, and lifelong cognitive engagement build neural redundancy, more efficient processing networks, and compensatory strategies that allow the brain to tolerate greater pathological burden before clinical symptoms emerge — explaining the disconnect between neuropathology severity and cognitive performance",
      "D": "All individuals have identical cognitive reserve regardless of their educational background or life experiences"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.512458,
    "y": 0.954008,
    "z": 0.52916,
    "source_article": "cognitive reserve",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "cognitive reserve",
      "Alzheimer's resilience",
      "education and dementia",
      "neural compensation"
    ]
  },
  {
    "id": "ebaba6c39e503bb0",
    "question_text": "The cerebellum was traditionally considered purely a motor structure. What evidence has expanded its recognized role into cognitive processing?",
    "options": {
      "A": "There is absolutely no credible evidence from any clinical study, neuroimaging experiment, animal model, computational analysis, or anatomical tracing study for any cerebellar involvement in any cognitive, linguistic, emotional, or executive function — the cerebellum functions exclusively and entirely in motor coordination, balance, postural control, and the timing of voluntary movements, with no connections to prefrontal, temporal, or parietal association cortices whatsoever",
      "B": "Damage to the cerebellum consistently and reliably improves all aspects of higher cognitive function including working memory capacity, verbal fluency, abstract reasoning, attentional control, and emotional regulation, because the cerebellum normally exerts a powerful inhibitory influence that suppresses cortical cognitive processing — removal of this cerebellar inhibition through lesions or degenerative disease liberates the cortex to perform at significantly enhanced cognitive levels",
      "C": "The cerebellum is involved only in visual processing and has no connection to motor or cognitive functions",
      "D": "Cerebellar patients show deficits in language, spatial reasoning, working memory, and emotional regulation (cerebellar cognitive affective syndrome/Schmahmann syndrome), cerebellar activation appears in fMRI during cognitive tasks, and the cerebellum has reciprocal connections with prefrontal cortex via thalamic relays — suggesting it contributes to cognition through internal models and error prediction"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.569871,
    "y": 0.930786,
    "z": 0.328081,
    "source_article": "cerebellar cognition",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "cerebellar cognition",
      "Schmahmann syndrome",
      "internal models",
      "cerebellar cognitive affective syndrome"
    ]
  },
  {
    "id": "aaef445bbc1ade32",
    "question_text": "The concept of 'neural reuse' (Anderson, 2010) challenges the classical modular view of brain organization. What does neural reuse propose?",
    "options": {
      "A": "Brain regions that originally evolved for one function are routinely co-opted for evolutionarily newer cognitive abilities — for example, the visual word form area in left fusiform gyrus was not 'designed' for reading (which is too recent for evolutionary specialization) but repurposes object recognition circuitry, suggesting brain regions are shared across multiple cognitive functions rather than dedicated to single tasks",
      "B": "Each brain region performs exactly one function and is never recruited for any other purpose",
      "C": "Neural reuse means that neurons die and are replaced by new neurons for each cognitive task",
      "D": "The brain contains unlimited specialized regions, one for every possible cognitive task, with no sharing or overlap"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.536585,
    "y": 0.938041,
    "z": 0.607949,
    "source_article": "neural reuse",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "neural reuse",
      "cultural recycling",
      "VWFA",
      "brain evolution"
    ]
  },
  {
    "id": "6e9a79ba8b511212",
    "question_text": "Prospective memory — remembering to perform intended actions in the future — is neurally and cognitively distinct from retrospective memory. What is the critical cognitive challenge unique to prospective memory?",
    "options": {
      "A": "Prospective memory requires only recall of past events with no future-oriented component",
      "B": "The core challenge is self-initiated retrieval — unlike retrospective memory where external cues prompt recall, prospective memory requires detecting the appropriate moment to act (the prospective component) while engaged in ongoing activities, without any explicit external reminder, placing demands on attentional monitoring and context detection that retrospective memory does not require",
      "C": "Prospective memory is identical to retrospective memory in every cognitive and neural respect",
      "D": "Prospective memory involves exclusively and only the retention and execution of motor procedural skills such as riding a bicycle, swimming, playing piano, and touch typing, with absolutely no episodic, declarative, or intention-based component — it is entirely non-conscious, requires no self-initiated retrieval, no monitoring of environmental cues, no attentional allocation to future goals, and no frontal lobe involvement, making it fundamentally identical to procedural skill learning in every respect"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.529219,
    "y": 0.94183,
    "z": 0.858541,
    "source_article": "prospective memory",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "prospective memory",
      "self-initiated retrieval",
      "intention monitoring",
      "future-oriented cognition"
    ]
  },
  {
    "id": "a7d154f892041919",
    "question_text": "The testing effect (retrieval practice effect) demonstrates that actively retrieving information from memory strengthens it more than re-studying. What theoretical mechanism best explains why retrieval practice is superior to restudy?",
    "options": {
      "A": "Retrieval practice produces stronger memories solely and exclusively because it increases the total amount of time spent studying the material, with absolutely no memory-specific benefit from the act of retrieval itself — if total study time is carefully equated between retrieval practice and passive restudy conditions, the testing effect completely disappears, demonstrating that retrieval is merely a time-filling activity with no unique cognitive or memorial consequence",
      "B": "Passive re-studying and re-reading of material always produces substantially stronger, more durable, and more transferable memories than active retrieval practice under every experimental condition that has ever been tested, for every type of material, at every retention interval, and for learners of every age and ability level — the testing effect is a methodological artifact that disappears when proper experimental controls are implemented",
      "C": "Retrieval forces the memory system to reconstruct the target information from partial cues, strengthening and elaborating the retrieval routes — this effortful reconstruction creates multiple access paths, identifies knowledge gaps, and updates the memory trace, making it more accessible for future retrieval in a way that passive re-exposure cannot achieve",
      "D": "The testing effect is an experimental artifact that has never been replicated outside the original study"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.41,
    "y": 0.962698,
    "z": 0.601864,
    "source_article": "testing effect",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "testing effect",
      "retrieval practice",
      "elaborative retrieval",
      "desirable difficulties"
    ]
  },
  {
    "id": "22444a799a076717",
    "question_text": "The concept of 'embodied simulation' in social cognition proposes that understanding others' mental states relies on motor and sensory systems. How does this differ from the classical 'theory theory' account of mentalizing?",
    "options": {
      "A": "Embodied simulation and theory theory are identical accounts with no theoretical differences",
      "B": "Neither account addresses how humans understand other people's mental states",
      "C": "Theory theory is actually the embodied motor simulation account which proposes that we understand others through direct neural mirroring and automatic sensorimotor resonance, while embodied simulation is actually the abstract inferential reasoning account which proposes that we understand others through logical deduction from general psychological laws — this means the descriptions of these two theoretical frameworks have been systematically reversed and confused throughout the cognitive neuroscience literature since their original formulation",
      "D": "Theory theory proposes that understanding others relies on abstract inferential rules applied through logical reasoning about beliefs and desires (like a scientist testing theories), while embodied simulation proposes we understand others by internally simulating their actions and sensations using our own motor and interoceptive systems — making social understanding a fundamentally embodied rather than purely propositional process"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.478214,
    "y": 0.911914,
    "z": 0.21384,
    "source_article": "embodied simulation",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "embodied simulation",
      "theory theory",
      "social cognition",
      "mentalizing"
    ]
  },
  {
    "id": "0877b75581af93f6",
    "question_text": "Place cells in the hippocampus fire when an animal is in a specific location. What do 'replay' events during sleep and rest suggest about hippocampal function beyond real-time navigation?",
    "options": {
      "A": "During sharp-wave ripples in sleep and quiet wakefulness, place cell sequences experienced during navigation are reactivated in compressed temporal order — this replay is thought to support memory consolidation by transferring spatial and episodic information from hippocampus to neocortex, and may also enable planning by 'pre-playing' future trajectories",
      "B": "Replay events have no functional significance and are merely random neural noise",
      "C": "Replay occurs only during active movement and never during sleep or rest",
      "D": "Place cells in the hippocampus are completely and totally inactive during all stages of sleep including slow-wave sleep, REM sleep, and transitional sleep stages, because the entire hippocampal formation shuts down completely when the animal enters any form of sleep — there is no neural activity, no sharp-wave ripples, no replay of sequential firing patterns, and no reactivation of any place cell assemblies during any phase of the sleep-wake cycle"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.487423,
    "y": 0.969383,
    "z": 0.700086,
    "source_article": "hippocampal replay",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "hippocampal replay",
      "memory consolidation",
      "sharp-wave ripples",
      "place cell sequences"
    ]
  },
  {
    "id": "a1f6e781a76f78a5",
    "question_text": "Interference theory explains forgetting through competition between similar memories. What is the critical distinction between proactive and retroactive interference?",
    "options": {
      "A": "Proactive and retroactive interference are the same phenomenon with no temporal distinction",
      "B": "Proactive interference occurs when previously learned information impairs retrieval of newly learned material (old disrupts new), while retroactive interference occurs when newly learned information impairs retrieval of previously learned material (new disrupts old) — the direction of temporal interference determines which memory is compromised",
      "C": "Both types of interference strengthen memories rather than causing forgetting",
      "D": "Interference theory has been completely disproven and no form of memory competition exists"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.428423,
    "y": 0.945774,
    "z": 0.650315,
    "source_article": "interference theory",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "interference theory",
      "proactive interference",
      "retroactive interference",
      "forgetting"
    ]
  },
  {
    "id": "32691ef3b79e7bae",
    "question_text": "Transcranial magnetic stimulation (TMS) can establish causal brain-behavior relationships in humans. What advantage does TMS offer over lesion studies and correlational neuroimaging?",
    "options": {
      "A": "Transcranial magnetic stimulation offers absolutely no methodological advantage over traditional lesion studies or functional magnetic resonance imaging, providing precisely identical information about brain-behavior relationships — the temporal and spatial resolution, causal inferential power, and ability to study healthy participants are all equivalent across these three methods, making TMS a completely redundant tool that adds nothing beyond existing neuroimaging and neuropsychological techniques",
      "B": "Transcranial magnetic stimulation can only stimulate deep subcortical structures located far beneath the cortical surface, such as the hypothalamus, substantia nigra, ventral tegmental area, and brainstem nuclei, while being completely unable to affect any region of the cerebral cortex — the magnetic fields generated by TMS coils pass through cortical tissue without any effect and only achieve sufficient intensity at subcortical depths",
      "C": "TMS can reversibly and temporarily disrupt function in a specific cortical region in healthy participants — unlike permanent lesions (which may involve compensation and reorganization) or fMRI (which shows correlation, not causation), TMS creates a temporary 'virtual lesion' that demonstrates causal necessity of a region for a task without confounds of chronic damage or correlational ambiguity",
      "D": "Transcranial magnetic stimulation is used exclusively for clinical therapeutic purposes such as treating depression, chronic pain, and obsessive-compulsive disorder, and has absolutely no application whatsoever in basic cognitive neuroscience research — the technique cannot be used to study normal brain function, test cognitive theories, or investigate brain-behavior relationships in healthy participants in any experimental context"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.5486,
    "y": 0.951433,
    "z": 0.503053,
    "source_article": "TMS",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "TMS",
      "causal inference",
      "virtual lesion",
      "brain-behavior relationships"
    ]
  },
  {
    "id": "5944e8f4b05f7f92",
    "question_text": "The Iowa Gambling Task reveals decision-making deficits in patients with ventromedial prefrontal cortex (vmPFC) damage. What specific cognitive process is impaired?",
    "options": {
      "A": "The Iowa Gambling Task measures only visual perception and has no relationship to decision-making",
      "B": "vmPFC patients cannot understand the rules of card games due to general intellectual impairment",
      "C": "vmPFC damage improves decision-making by eliminating emotional interference with rational thought",
      "D": "vmPFC patients have normal intelligence and can articulate which decks are advantageous but still choose disadvantageously — they lack the ability to use emotional signals (somatic markers) to guide decisions under uncertainty, demonstrating that rational knowledge alone is insufficient for adaptive decision-making without affective valuation"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.588104,
    "y": 0.933785,
    "z": 0.068985,
    "source_article": "Iowa Gambling Task",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "Iowa Gambling Task",
      "vmPFC",
      "somatic marker hypothesis",
      "decision-making under uncertainty"
    ]
  },
  {
    "id": "436f3d26cb77d54a",
    "question_text": "The 'grandmother cell' versus 'population coding' debate concerns how the brain represents individual concepts. What does modern evidence from single-neuron recordings in the human medial temporal lobe suggest?",
    "options": {
      "A": "Neurons in the medial temporal lobe respond to specific concepts (e.g., 'Jennifer Aniston neuron') with remarkable selectivity and invariance across modalities (photo, name, drawing), but this likely reflects sparse distributed coding rather than single-cell representation — individual neurons participate in multiple representations, and each concept is encoded by a small population of selectively tuned cells",
      "B": "Every individual person, specific object, abstract concept, and unique memory is represented by exactly one single dedicated neuron that fires exclusively and only for that particular entity and never for anything else under any circumstance — this strict grandmother cell doctrine means the brain allocates one neuron per concept with no overlap, no distributed coding, no population-level representation, and no sharing of neural resources between different conceptual representations whatsoever",
      "C": "No neuron anywhere in the human brain shows any degree of selectivity or preferential response for specific stimuli, categories, or concepts — all neurons throughout the cortex, hippocampus, and subcortical structures respond identically and uniformly to all possible visual, auditory, and conceptual inputs, with no tuning curves, no receptive fields, no category selectivity, and no invariant representations observed in any single-unit recording study",
      "D": "Population coding as a neural representational scheme has been conclusively and definitively disproven by decades of single-unit recording research, and the grandmother cell hypothesis is now universally accepted as the only coding mechanism operating anywhere in the human brain — every neuroscience textbook, peer-reviewed study, and computational model confirms that individual dedicated neurons, not distributed populations, are the sole representational format used by the nervous system"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.562259,
    "y": 0.927546,
    "z": 0.634095,
    "source_article": "sparse coding",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "sparse coding",
      "concept cells",
      "Quiroga",
      "neural representation"
    ]
  },
  {
    "id": "2b6e71133d88ef3f",
    "question_text": "The 'spacing effect' is one of the most robust findings in memory research. What does it demonstrate about optimal learning strategies?",
    "options": {
      "A": "Massed practice (concentrating all study into a single intensive cramming session immediately before an examination) always produces substantially better long-term retention than distributed spaced practice under every experimental condition, for all types of material, across all ages and ability levels, and at every retention interval tested — the spacing effect is a myth that has been consistently debunked in well-controlled laboratory studies of human memory",
      "B": "Distributing study sessions across time (spaced practice) produces substantially better long-term retention than concentrating the same amount of study into a single session (massed practice) — this effect is remarkably robust across materials, ages, and retention intervals, and has been replicated hundreds of times since Ebbinghaus first documented it in 1885",
      "C": "The spacing effect applies exclusively and only to the learning of motor skills such as playing musical instruments, typing on keyboards, and athletic performance, and has absolutely no relevance whatsoever to verbal learning, conceptual understanding, factual knowledge acquisition, second language learning, or any form of academic educational material studied by students at any level of schooling",
      "D": "Spacing study sessions across time and massing all study into a single concentrated session produce completely identical learning outcomes under every possible experimental condition, for every type of material, at every retention interval, and for every age group — hundreds of studies since Ebbinghaus have consistently failed to find any reliable difference between spaced and massed practice in any domain of learning"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.421833,
    "y": 0.958311,
    "z": 0.70691,
    "source_article": "spacing effect",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "spacing effect",
      "distributed practice",
      "memory optimization",
      "Ebbinghaus"
    ]
  },
  {
    "id": "2228155373f5fb23",
    "question_text": "Bayesian models of cognition propose that the brain performs approximate probabilistic inference. How does this framework explain the persistence of cognitive biases?",
    "options": {
      "A": "Bayesian models predict that human cognition is always perfectly rational with no biases or errors",
      "B": "Bayesian models have no ability to explain any cognitive bias and are incompatible with the existence of irrational behavior",
      "C": "Cognitive biases arise from rational probabilistic inference operating under real-world constraints — informative priors (base rate neglect reflects strong prior expectations), limited sampling (availability heuristic reflects small-sample statistics), and resource-rational approximations (satisficing under time pressure) produce systematic deviations from normative models while remaining locally optimal given the brain's computational constraints",
      "D": "Biases are caused by random neural noise with no systematic computational explanation"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.501274,
    "y": 0.879328,
    "z": 0.52736,
    "source_article": "Bayesian cognition",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "Bayesian cognition",
      "rational analysis",
      "cognitive biases",
      "resource-rational inference"
    ]
  },
  {
    "id": "3fb290d2aed2c9bf",
    "question_text": "Interoception — the perception of internal bodily signals — has emerged as a core component of emotional experience. What does the 'predictive interoception' framework propose about the relationship between interoception and emotion?",
    "options": {
      "A": "Interoception has absolutely no functional relationship to emotional experience, affective processing, mood regulation, or any aspect of subjective feeling states, and it exclusively and solely monitors digestive function including gastric motility, intestinal absorption, enzyme secretion, and nutrient sensing — the interoceptive afferent pathways from the body project only to brainstem nuclei controlling digestion and never reach cortical areas involved in conscious emotional experience or self-awareness",
      "B": "The predictive interoception framework, which proposes that the brain generates top-down predictions about expected sensory states and compares them against incoming signals, applies only and exclusively to visual perception and has never been theoretically extended, empirically tested, or even hypothetically proposed as a framework for understanding emotion, body perception, interoceptive awareness, anxiety disorders, alexithymia, or any non-visual cognitive or affective process",
      "C": "Emotions are generated entirely in the limbs and peripheral nervous system with no brain involvement",
      "D": "The brain actively generates predictions about expected interoceptive states and compares them against incoming bodily signals — emotions arise from the brain's interpretation of prediction errors (mismatches between predicted and actual body states), and individual differences in interoceptive prediction precision contribute to differences in emotional experience, anxiety disorders, and alexithymia"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.533032,
    "y": 0.851157,
    "z": 0.540977,
    "source_article": "interoception",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "interoception",
      "predictive processing",
      "emotion",
      "allostasis"
    ]
  },
  {
    "id": "8a867ba21dd636ac",
    "question_text": "Sleep's role in memory consolidation is well-established, but different sleep stages contribute differently. What is the 'active systems consolidation' hypothesis about the division of labor between NREM and REM sleep?",
    "options": {
      "A": "During NREM slow-wave sleep, hippocampal sharp-wave ripples coordinate with thalamocortical spindles and neocortical slow oscillations to transfer declarative memories from hippocampus to neocortex for long-term storage — REM sleep then integrates and restructures these memories by replaying them in cortical networks, supporting insight, creativity, and emotional memory processing",
      "B": "Sleep has no role in memory consolidation — all consolidation occurs during waking hours",
      "C": "NREM and REM sleep perform identical memory functions with no division of labor between stages",
      "D": "REM sleep consolidates declarative memories while NREM sleep consolidates only procedural skills, with no crossover"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.473933,
    "y": 0.966905,
    "z": 0.549752,
    "source_article": "sleep consolidation",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "sleep consolidation",
      "active systems consolidation",
      "NREM vs REM",
      "hippocampal-cortical transfer"
    ]
  },
  {
    "id": "6d3dc0fb78027dc3",
    "question_text": "Multivariate pattern analysis (MVPA) of fMRI data has transformed cognitive neuroscience. What can MVPA reveal that traditional univariate fMRI analysis cannot?",
    "options": {
      "A": "Multivariate pattern analysis and traditional mass-univariate fMRI analysis provide completely identical information about brain function, neural representation, and cognitive processing, with absolutely no difference in sensitivity, specificity, inferential power, or the type of neuroscientific questions they can address — any research finding obtained through MVPA decoding analysis could have been equally well obtained through conventional voxelwise subtraction-based activation mapping approaches",
      "B": "MVPA decodes the information content represented in distributed voxel patterns — while univariate analysis identifies regions that are more active for one condition than another (where), MVPA reveals what information a brain region represents by detecting subtle multivariate patterns invisible to voxel-by-voxel comparisons, enabling 'brain reading' of stimulus category, subjective experience, and even dream content",
      "C": "MVPA can only analyze structural MRI images and has no application to functional brain activation data",
      "D": "Traditional univariate analysis is always more sensitive and informative than MVPA for every research question"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.59,
    "y": 0.922585,
    "z": 0.55699,
    "source_article": "MVPA",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "MVPA",
      "neural decoding",
      "representational similarity",
      "pattern analysis"
    ]
  },
  {
    "id": "785d25298f7ffbab",
    "question_text": "The 'dual-route' model of reading proposes two pathways from print to pronunciation. What are these routes, and what pattern of reading errors distinguishes surface dyslexia from phonological dyslexia?",
    "options": {
      "A": "Surface dyslexia following damage to the lexical whole-word reading route and phonological dyslexia following damage to the sublexical grapheme-to-phoneme conversion route produce completely identical patterns of reading errors, with absolutely no qualitative dissociation between the two subtypes in terms of which word types are affected, what kinds of errors are produced, or which aspects of reading ability are preserved versus impaired in each clinical presentation",
      "B": "Reading involves only a single route and the dual-route model has been universally rejected",
      "C": "The lexical (whole-word) route retrieves stored pronunciations for known words, while the sublexical (grapheme-to-phoneme) route converts letters to sounds using rules — surface dyslexics (damaged lexical route) regularize irregular words ('pint' rhymes with 'mint') but read nonwords fine, while phonological dyslexics (damaged sublexical route) read familiar words but cannot sound out novel nonwords",
      "D": "Both dyslexia subtypes involve damage to the visual cortex rather than to language processing systems"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.48653,
    "y": 0.944169,
    "z": 0.150746,
    "source_article": "dual-route reading",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "dual-route reading",
      "surface dyslexia",
      "phonological dyslexia",
      "reading models"
    ]
  },
  {
    "id": "32302a8b5d29ba8d",
    "question_text": "The concept of 'transfer-appropriate processing' (Morris et al., 1977) refines our understanding of encoding-retrieval interactions. What does it add to levels-of-processing theory?",
    "options": {
      "A": "Transfer-appropriate processing merely restates levels of processing with no additional insight",
      "B": "The concept applies only to procedural memory and has no relevance to declarative recall or recognition",
      "C": "Transfer-appropriate processing proves that shallow processing always produces the best memory",
      "D": "Memory performance depends not just on depth of encoding but on the match between encoding processes and retrieval demands — deep semantic processing produces the best memory when the test requires semantic access, but shallow phonological encoding can actually outperform deep encoding when the test requires phonological matching, showing that 'deep' is not universally superior but context-dependent"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.449258,
    "y": 0.932565,
    "z": 0.64488,
    "source_article": "transfer-appropriate processing",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "transfer-appropriate processing",
      "encoding-retrieval match",
      "levels of processing",
      "context-dependent memory"
    ]
  },
  {
    "id": "54d9d8fc339d7ee3",
    "question_text": "The anterior cingulate cortex (ACC) is consistently activated in neuroimaging studies of cognitive control. What computational function does the 'conflict monitoring' theory attribute to the ACC?",
    "options": {
      "A": "The ACC detects response conflict — simultaneous activation of competing response representations — and signals the dorsolateral prefrontal cortex to increase top-down control, explaining why ACC activity increases during Stroop incongruent trials, error commission, and high-conflict decisions without the ACC itself implementing the control adjustment",
      "B": "The ACC has no role in cognitive control and is exclusively involved in pain processing",
      "C": "The ACC directly implements motor responses and has no monitoring or signaling function",
      "D": "The ACC is active only during rest and is suppressed during all cognitive tasks"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.523986,
    "y": 0.903637,
    "z": 0.437225,
    "source_article": "ACC",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "ACC",
      "conflict monitoring",
      "cognitive control",
      "Botvinick model"
    ]
  },
  {
    "id": "e2f2c19282def206",
    "question_text": "Constructive episodic simulation (Schacter & Addis) proposes that episodic memory and future imagination share a common neural system. What is the adaptive significance of this shared architecture?",
    "options": {
      "A": "The shared system is a design flaw with no adaptive value — memory and imagination should be completely separate",
      "B": "The hippocampal system's ability to flexibly recombine stored episodic elements into novel configurations serves future-oriented cognition — imagining future scenarios, planning, and creative problem-solving all require recombining fragments of past experience, so the same constructive machinery that makes memory fallible (false memories, confabulation) also enables the uniquely human ability to mentally simulate possible futures",
      "C": "Episodic memory and future imagination have completely separate neural substrates with no overlap whatsoever",
      "D": "Only future imagination is supported by the hippocampus, while episodic memory is stored entirely in the cerebellum"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.543323,
    "y": 0.937393,
    "z": 0.903822,
    "source_article": "constructive episodic simulation",
    "domain_ids": [
      "cognitive-neuroscience",
      "neuroscience"
    ],
    "concepts_tested": [
      "constructive episodic simulation",
      "future imagination",
      "hippocampal function",
      "adaptive memory"
    ]
  }
]