[
  {
    "id": "13c263c65bc72c62",
    "question_text": "A child has a genetic condition that neither parent shows. Both parents are unaffected carriers. What inheritance pattern does this describe?",
    "options": {
      "A": "Autosomal recessive — both parents carry one copy of the recessive allele without showing symptoms, and the child inherited the recessive allele from each parent",
      "B": "Autosomal dominant inheritance — one copy of the mutant allele is sufficient to produce the phenotype, so affected children nearly always have at least one affected parent showing symptoms of the condition",
      "C": "X-linked dominant — the mutation is on the X chromosome and only one copy is needed, so the mother would typically show the condition herself",
      "D": "Mitochondrial inheritance — the condition is passed through the mother's mitochondrial DNA, which means the mother herself would have to be affected"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.975499,
    "y": 0.414339,
    "z": 0.32061,
    "source_article": "autosomal recessive inheritance",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "autosomal recessive inheritance",
      "carrier status",
      "Mendelian genetics"
    ]
  },
  {
    "id": "a605e591eb8ecb5e",
    "question_text": "DNA replication is described as 'semiconservative.' What does this mean?",
    "options": {
      "A": "Each new DNA molecule is assembled entirely from new nucleotides with no retention of the original parental template strands in either daughter",
      "B": "Each new DNA double helix contains one original (parental) strand and one newly synthesized strand",
      "C": "The original DNA double helix is completely preserved as one intact unit while a separate entirely new copy is synthesized alongside it from scratch",
      "D": "Old and new DNA segments are randomly interspersed in each resulting daughter molecule"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.882038,
    "y": 0.37956,
    "z": 0.850115,
    "source_article": "semiconservative replication",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "semiconservative replication",
      "Meselson-Stahl experiment",
      "DNA replication"
    ]
  },
  {
    "id": "a59747b5308b7a93",
    "question_text": "A single nucleotide change converts a codon for glutamic acid (GAG) to a codon for valine (GTG) in the β-globin gene. What disease does this cause, and why does a single amino acid change have such a dramatic effect?",
    "options": {
      "A": "Tay-Sachs disease, because the hexosaminidase A enzyme is rendered nonfunctional and cannot degrade GM2 gangliosides in lysosomes",
      "B": "Cystic fibrosis, because the CFTR chloride channel protein misfolds and is degraded before reaching the cell membrane",
      "C": "Sickle cell disease, because the hydrophobic valine at position 6 creates a sticky patch on deoxygenated hemoglobin that drives polymerization into rigid fibers, deforming red blood cells",
      "D": "Huntington's disease, because the expanded polyglutamine tract in the huntingtin protein causes it to aggregate into toxic inclusions within neurons"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.851043,
    "y": 0.349465,
    "z": 0.478048,
    "source_article": "point mutation",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "point mutation",
      "sickle cell disease",
      "protein structure-function",
      "hemoglobin polymerization"
    ]
  },
  {
    "id": "3c26a2a2346d0880",
    "question_text": "Mendel's law of independent assortment states that alleles of different genes sort independently during gamete formation. Under what condition does this law fail?",
    "options": {
      "A": "When both genes are located on autosomes rather than sex chromosomes, because autosomal genes are subject to different segregation dynamics during meiosis than sex-linked ones",
      "B": "When one gene shows complete dominance and the other is recessive, since the dominance hierarchy between alleles alters how they sort during gamete formation",
      "C": "When the organism is diploid rather than haploid, because the presence of homologous chromosome pairs in diploids changes the way alleles assort independently",
      "D": "When two genes are located close together on the same chromosome (linked), so they tend to be inherited together unless separated by recombination"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.966364,
    "y": 0.273224,
    "z": 0.552782,
    "source_article": "genetic linkage",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "genetic linkage",
      "independent assortment",
      "recombination",
      "Mendel's laws"
    ]
  },
  {
    "id": "d610786365c4771f",
    "question_text": "Epigenetic modifications can silence gene expression without altering the DNA sequence. One major mechanism involves DNA methylation. Why does methylation of CpG islands in a gene's promoter region silence that gene?",
    "options": {
      "A": "Methylation of CpG islands recruits methyl-CpG binding proteins that in turn recruit histone deacetylases, creating a compacted chromatin state (heterochromatin) that blocks transcription factor access to the promoter",
      "B": "Methylation causes the DNA in the promoter region to be recognized by specific endonucleases that then excise and degrade the methylated sequences from the genome entirely",
      "C": "Methylation chemically converts cytosine to thymine through spontaneous deamination, permanently altering the promoter DNA sequence and destroying its ability to bind transcription factors",
      "D": "Methylation of the promoter causes the resulting mRNA transcript to be recognized and rapidly degraded by the RNA surveillance machinery before it can be translated into protein at ribosomes, preventing any gene product from accumulating"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.776287,
    "y": 0.356528,
    "z": 0.666517,
    "source_article": "DNA methylation",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "DNA methylation",
      "epigenetic silencing",
      "CpG islands",
      "chromatin remodeling"
    ]
  },
  {
    "id": "4351bfb6405e6389",
    "question_text": "The Hardy-Weinberg equilibrium model predicts genotype frequencies in a population. If the frequency of a recessive allele (q) is 0.1, what is the expected carrier (heterozygote) frequency, and what assumption is most commonly violated in real populations?",
    "options": {
      "A": "Carrier frequency is 0.01, calculated as q squared; the most commonly violated assumption is the absence of new mutations arising in each generation within the population",
      "B": "Carrier frequency is 2pq = 2(0.9)(0.1) = 0.18 (18%); non-random mating (assortative mating, population structure) is the most commonly violated assumption in human populations",
      "C": "Carrier frequency equals q squared which is 0.01; this model assumes that genetic drift has no significant effect on allele frequencies, an assumption that holds universally across populations",
      "D": "Carrier frequency equals p squared which is 0.81; natural selection is the sole evolutionary force that matters and is the only assumption that real populations commonly violate in practice"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.988402,
    "y": 0.244095,
    "z": 0.537791,
    "source_article": "Hardy-Weinberg equilibrium",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "Hardy-Weinberg equilibrium",
      "heterozygote frequency",
      "population genetics assumptions"
    ]
  },
  {
    "id": "2c0702611a8b6bff",
    "question_text": "Trinucleotide repeat expansion disorders like Huntington's disease show a phenomenon called 'anticipation.' What is anticipation, and what molecular mechanism drives it?",
    "options": {
      "A": "Anticipation means the disease skips every other generation due to incomplete penetrance, where some individuals carry the mutation but never develop clinical symptoms during their lifetime",
      "B": "Anticipation means patients develop psychological anxiety and increased health surveillance behaviors in response to knowing they may have inherited a familial genetic disease",
      "C": "Anticipation means the disease appears at an earlier age and with greater severity in successive generations, driven by the tendency of trinucleotide repeats to expand during DNA replication (particularly in meiosis) due to strand slippage and hairpin formation by the repetitive sequence",
      "D": "Anticipation means the disease only manifests after environmental triggers such as toxins, dietary factors, and infections accumulate progressively across multiple generations"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.828376,
    "y": 0.401743,
    "z": 0.272102,
    "source_article": "trinucleotide repeat expansion",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "trinucleotide repeat expansion",
      "anticipation",
      "Huntington's disease",
      "DNA replication slippage"
    ]
  },
  {
    "id": "77fbdec574cc63c8",
    "question_text": "X-inactivation ensures dosage compensation between XX and XY individuals by silencing one X chromosome. What key molecular event initiates X-inactivation, and why does it result in mosaic expression patterns in females?",
    "options": {
      "A": "One X chromosome is physically ejected from the nucleus and condensed into a Barr body that is then sequestered in the cytoplasm away from nuclear transcription machinery, where it becomes transcriptionally inert because it can no longer access RNA polymerases, splicing factors, or chromatin remodeling complexes required for active gene expression",
      "B": "Both X chromosomes remain partially active in females, with each one expressing exactly half of its genes in a precisely regulated complementary pattern — so every gene on the X is expressed from one copy or the other but never both, maintaining the same total dosage as in males with their single X chromosome",
      "C": "The Y chromosome in males produces a specific dosage-compensating transcription factor that upregulates expression of every gene on the single male X chromosome to match the expression level seen in females, while females lack this Y-derived factor and instead use both X chromosomes at basal levels",
      "D": "The long non-coding RNA XIST coats one X chromosome in cis, recruiting Polycomb repressive complexes that establish silencing; because the choice of which X to inactivate is random in each cell during early development, adult females are mosaics of cells expressing either the maternal or paternal X"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.843836,
    "y": 0.47272,
    "z": 0.577035,
    "source_article": "X-inactivation",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "X-inactivation",
      "XIST lncRNA",
      "dosage compensation",
      "mosaicism",
      "Polycomb complexes"
    ]
  },
  {
    "id": "64ffce3ff39aedf1",
    "question_text": "Genome-wide association studies (GWAS) have identified thousands of genetic variants associated with complex diseases, yet most variants have very small effect sizes and explain only a fraction of heritability. This discrepancy is known as the 'missing heritability' problem. What is the most widely supported explanation?",
    "options": {
      "A": "The missing heritability is likely distributed across many common variants with effects too small to reach genome-wide significance individually, rare variants not well-captured by SNP arrays, gene-gene interactions (epistasis), gene-environment interactions, and structural variants (CNVs, inversions) poorly tagged by standard GWAS chips",
      "B": "Heritability estimates derived from twin studies are fundamentally flawed and systematically overestimate the true genetic contribution to complex diseases because they rely on the equal environments assumption, which incorrectly presumes monozygotic and dizygotic twins share equally similar environments",
      "C": "Most heritability for complex diseases is concentrated in a single undiscovered large-effect variant that current GWAS technology cannot detect due to limitations in SNP array coverage and the variant's location in a structurally complex or repetitive region of the genome",
      "D": "Environmental factors including diet, stress, toxin exposure, and socioeconomic conditions account for essentially all of the missing heritability, demonstrating that genetics plays only a minimal role in complex disease susceptibility beyond a few rare monogenic conditions, and that twin study concordance rates reflect shared environmental exposures rather than shared DNA"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.890659,
    "y": 0.168738,
    "z": 0.0,
    "source_article": "missing heritability",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "missing heritability",
      "GWAS limitations",
      "polygenic architecture",
      "rare variants",
      "epistasis"
    ]
  },
  {
    "id": "28ed376944b4dca9",
    "question_text": "CRISPR-Cas9 specificity depends on guide RNA complementarity to the target. However, off-target editing remains a concern. What molecular feature of the CRISPR-Cas9 system is the primary determinant of off-target cleavage, and how can it be mitigated?",
    "options": {
      "A": "Off-target effects are primarily caused by the PAM sequence (NGG for SpCas9) being extremely common throughout the human genome, occurring roughly every eight base pairs on average; the only reliable way to eliminate off-target cleavage is to engineer Cas9 variants that require longer and rarer PAM sequences, thereby reducing the number of potential binding sites across the genome to a manageable level for therapeutic applications",
      "B": "Off-target cleavage occurs at sites with partial guide RNA complementarity — particularly when mismatches are in the PAM-distal region (positions 1-8 of the guide), which contributes less to binding energy. High-fidelity Cas9 variants (e.g., eSpCas9, HiFi Cas9) reduce off-target activity by weakening non-specific DNA contacts so that fewer mismatches are tolerated",
      "C": "Off-target effects arise because Cas9 has an inherent tendency to bind double-stranded RNA transcripts instead of its intended genomic DNA targets, causing widespread unintended cleavage of active mRNA molecules throughout the cell; this fundamental problem can be completely eliminated by switching to DNA-only nucleases that have absolutely no RNA-binding capability or affinity",
      "D": "Off-target editing events occur exclusively within repetitive DNA regions such as Alu elements, LINEs, and SINEs, and are not a meaningful concern in unique single-copy genomic sequences where most therapeutic gene editing targets are located"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.777315,
    "y": 0.312883,
    "z": 0.553878,
    "source_article": "CRISPR off-target effects",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "CRISPR off-target effects",
      "guide RNA specificity",
      "high-fidelity Cas9 variants",
      "PAM-proximal vs distal mismatch tolerance"
    ]
  },
  {
    "id": "bfbf151de0104a48",
    "question_text": "Genomic imprinting causes certain genes to be expressed from only one parental allele. Prader-Willi syndrome and Angelman syndrome both result from deletions of the same chromosomal region (15q11-13) but produce different clinical outcomes. Why?",
    "options": {
      "A": "The deleted region contains entirely different sets of genes on the maternal versus paternal chromosome, with no overlap between the two parental copies in terms of the protein-coding sequences present within the 15q11-13 interval",
      "B": "Prader-Willi and Angelman are actually the same disease presenting as a single clinical entity with highly variable expressivity, where different patients exhibit different subsets of symptoms depending on modifier genes elsewhere in the genome",
      "C": "The genes in this region are imprinted: paternally expressed genes (e.g., SNRPN) cause Prader-Willi when deleted from the paternal copy, while the maternally expressed gene UBE3A causes Angelman when deleted from the maternal copy — the intact opposite allele is silenced by imprinting and cannot compensate",
      "D": "The maternal chromosome carries a specific protective gene that prevents the development of Prader-Willi when expressed, while the paternal chromosome has a different protective gene that prevents Angelman syndrome"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.840896,
    "y": 0.345228,
    "z": 0.323566,
    "source_article": "genomic imprinting",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "genomic imprinting",
      "Prader-Willi syndrome",
      "Angelman syndrome",
      "parent-of-origin effects"
    ]
  },
  {
    "id": "da3fcdce5fadb8fc",
    "question_text": "Quantitative trait locus (QTL) mapping identifies genomic regions associated with continuous phenotypic variation. What is the fundamental statistical approach, and what is its key limitation compared to GWAS?",
    "options": {
      "A": "QTL mapping works by sequencing every gene across the entire genome and then directly identifying all causal nucleotide mutations responsible for quantitative phenotypic variation in the study organism",
      "B": "QTL mapping statistically correlates environmental exposure variables with phenotypic measurements and identifies candidate genes located near environmentally responsive regulatory elements in the genome",
      "C": "QTL mapping measures genome-wide gene expression levels using microarrays or RNA-seq and then assumes that the most highly expressed gene in a region is the one causing the observed quantitative trait variation",
      "D": "QTL mapping uses linkage analysis in controlled crosses or pedigrees, testing whether genetic markers co-segregate with phenotypic variation more than expected by chance"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.88923,
    "y": 0.150677,
    "z": 0.164548,
    "source_article": "QTL mapping",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "QTL mapping",
      "linkage analysis",
      "quantitative genetics",
      "marker-trait association"
    ]
  },
  {
    "id": "ff1d4202259e990b",
    "question_text": "Transposable elements comprise roughly 45% of the human genome. The LINE-1 (L1) retrotransposon is the only currently autonomous transposable element in humans. Through what molecular mechanism does L1 mobilize, and why is its activity both a source of genetic disease and evolutionary innovation?",
    "options": {
      "A": "L1 replicates through a 'copy-and-paste' mechanism: it is transcribed to mRNA, then its encoded ORF2p reverse transcribes the mRNA and integrates the cDNA at a new genomic site via target-primed reverse transcription (TPRT). This can cause disease by disrupting genes or regulatory elements at insertion sites, but also drives genome evolution by creating new regulatory sequences, exon shuffling, and gene duplications",
      "B": "L1 mobilizes by being directly cut from one genomic location by a transposase enzyme and then pasted into another random chromosomal site through a cut-and-paste DNA transposition mechanism that does not involve any RNA intermediate",
      "C": "L1 is a DNA virus that integrates randomly into the host genome during acute viral infection, inserting its DNA through viral integrase activity rather than through any endogenous retrotransposition mechanism",
      "D": "L1 mobilizes exclusively during meiotic cell division through homologous recombination between repeated L1 elements at different genomic locations, a process that causes large-scale chromosomal rearrangements including deletions, duplications, and inversions that reshape genome architecture but requires no transcription or reverse transcription of the element itself, distinguishing it from all other mobile genetic elements"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.797487,
    "y": 0.284425,
    "z": 0.694084,
    "source_article": "transposable elements",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "transposable elements",
      "LINE-1 retrotransposition",
      "TPRT mechanism",
      "genome evolution"
    ]
  },
  {
    "id": "0fc8fde987969227",
    "question_text": "Polygenic risk scores (PRS) aggregate the effects of many genetic variants to predict disease risk. Despite their statistical validity in discovery populations, PRS often perform poorly when applied to populations of different ancestral backgrounds. What is the primary reason for this transferability problem?",
    "options": {
      "A": "Different human populations have completely different genomes with no shared common genetic variants between them, making any risk score derived from one population genetically irrelevant to all other human populations due to fundamental differences in their underlying DNA sequences",
      "B": "PRS effect sizes are estimated from linkage disequilibrium (LD) patterns specific to the discovery population — since LD structure (the correlation between nearby variants) differs across ancestral populations due to different demographic histories, the tag SNPs and their estimated effects in one population may not accurately capture causal variant effects in another",
      "C": "Polygenic risk scores are designed exclusively for simple monogenic diseases caused by a single high-penetrance variant and cannot be meaningfully applied to complex traits that are influenced by many genetic loci simultaneously, because the mathematical framework underlying PRS calculations assumes single-gene Mendelian inheritance patterns rather than the infinitesimal polygenic model",
      "D": "The SNP genotyping arrays used in genome-wide association studies for populations of different ancestral backgrounds contain completely non-overlapping sets of genetic markers, meaning there is no shared variant data between populations that could serve as the basis for transferring risk predictions from one group to another, regardless of the underlying genetic architecture of the disease"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.884492,
    "y": 0.052948,
    "z": 0.212716,
    "source_article": "polygenic risk scores",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "polygenic risk scores",
      "linkage disequilibrium",
      "population genetics",
      "GWAS portability",
      "ancestral diversity"
    ]
  },
  {
    "id": "e76b397bb66eb25e",
    "question_text": "Meiotic drive (segregation distortion) occurs when a genetic element is transmitted to more than 50% of offspring, violating Mendel's law of segregation. The t-haplotype system in mice is a classic example. What molecular mechanism allows the t-haplotype to achieve drive, and why doesn't it sweep to fixation?",
    "options": {
      "A": "The t-haplotype produces a broadly cytotoxic poison protein during spermatogenesis that indiscriminately kills all developing sperm cells within the testis — both those carrying the t-haplotype and those carrying the wild-type allele — and then provides a highly specific intracellular antidote molecule only to those sperm cells that carry the t-haplotype genomic region, allowing them to survive and be the sole viable gametes available for fertilization",
      "B": "The t-haplotype causes preferential X-inactivation of the chromosome that bears the competing wild-type alternative allele in female embryos heterozygous for the t-haplotype, resulting in dominant expression of the t-haplotype allele in the majority of somatic cells throughout development, which gives a strong transmission advantage that mimics segregation distortion but operates through an entirely epigenetic mechanism rather than direct gamete competition",
      "C": "The t-haplotype achieves drive through a poison-antidote system acting during spermatogenesis: distorter loci on the t-haplotype produce dominant-negative signaling proteins (the 'poison') that impair flagellar function of all sperm, while a tightly linked responder (Smok1) provides a cis-acting rescue (the 'antidote') only to t-bearing sperm. Fixation is prevented because t/t homozygotes are male-sterile or lethal, creating balancing selection",
      "D": "The t-haplotype replicates itself autonomously within the genome by encoding its own DNA polymerase and replication origin, progressively increasing its copy number in each successive generation through a gene amplification mechanism analogous to how drug-resistance genes become amplified in cancer cells, which creates an ever-growing dosage advantage that overwhelms the wild-type allele through sheer copy number rather than competitive sperm function"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.921073,
    "y": 0.49,
    "z": 0.621528,
    "source_article": "meiotic drive",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "meiotic drive",
      "segregation distortion",
      "t-haplotype",
      "selfish genetic elements",
      "balancing selection"
    ]
  },
  {
    "id": "25a138d0e7624bd6",
    "question_text": "Single-cell RNA sequencing (scRNA-seq) has revealed that seemingly homogeneous cell populations contain substantial transcriptomic heterogeneity. However, scRNA-seq data is extremely sparse — most genes in most cells show zero counts. What causes this 'dropout' phenomenon, and how does it complicate analysis?",
    "options": {
      "A": "Dropouts occur because individual cells genuinely express very few genes at any given time, with most genes being truly transcriptionally silent in any particular cell due to lineage-specific chromatin states and regulatory programs that restrict the active transcriptome",
      "B": "Dropouts are primarily caused by sequencing errors during the Illumina sequencing process that systematically delete or corrupt gene-specific reads from the final data output, resulting in artificial zero counts for genes that were actually present in the original cDNA library",
      "C": "Dropouts are entirely a computational artifact introduced by the read alignment algorithm, which fails to correctly map short sequencing reads to their true genomic origin when genes have similar sequences or belong to highly conserved gene families",
      "D": "Dropouts arise primarily from inefficient mRNA capture during library preparation — with typical capture rates of 10-30% of a cell's ~100,000 mRNA molecules, low-abundance transcripts are stochastically missed (sampling zeros). This creates a zero-inflated count distribution that confounds distinguishing true biological absence from technical non-detection, complicating differential expression analysis and requiring specialized statistical models (e.g., ZINB, imputation methods)"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.777046,
    "y": 0.128963,
    "z": 0.344005,
    "source_article": "single-cell RNA sequencing",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "single-cell RNA sequencing",
      "dropout events",
      "zero inflation",
      "technical vs biological variability"
    ]
  },
  {
    "id": "5e163816b978fea1",
    "question_text": "The neutral theory of molecular evolution (Kimura, 1968) proposes that most evolutionary change at the molecular level is driven by genetic drift of selectively neutral mutations rather than natural selection. What is the strongest empirical evidence supporting this theory, and what is its major limitation?",
    "options": {
      "A": "The molecular clock: protein and DNA sequences accumulate substitutions at roughly constant rates across lineages, as predicted by neutral theory (where substitution rate equals mutation rate, independent of population size). Its major limitation is that it cannot explain adaptive evolution — positive selection clearly drives many functionally important changes, and the proportion of adaptive vs neutral substitutions varies substantially across taxa and genomic regions",
      "B": "The neutral theory is supported primarily by fossil evidence from the paleontological record demonstrating that all species, regardless of their population size, generation time, or ecological niche, evolve at identical morphological rates when measured across geological timescales",
      "C": "The neutral theory is supported by the observation that all mutations in a genome, whether beneficial, neutral, or deleterious, are equally likely to become fixed in a population regardless of their effect on organismal fitness, because random genetic drift overwhelms selection in all cases",
      "D": "The neutral theory makes the specific prediction that larger populations should evolve faster at the molecular level because they generate more mutations per generation, a prediction that has been consistently confirmed across all species and genomic regions studied to date"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.925385,
    "y": 0.155825,
    "z": 0.988299,
    "source_article": "neutral theory",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "neutral theory",
      "molecular clock",
      "genetic drift",
      "molecular evolution",
      "Kimura"
    ]
  },
  {
    "id": "9a048a6419e2a879",
    "question_text": "Enhancers can regulate gene expression over distances of hundreds of kilobases. The prevailing model for how enhancers communicate with promoters over such distances has evolved significantly. What is the current mechanistic understanding, and what evidence supports it?",
    "options": {
      "A": "Enhancers work by producing small regulatory RNA molecules known as enhancer RNAs (eRNAs) that physically diffuse through the nucleoplasm across long distances until they encounter and bind to their specific target promoter sequences, directly activating transcription by recruiting RNA polymerase II to the promoter",
      "B": "Enhancers function by directly looping to contact promoters through 3D chromatin folding mediated by cohesin and Mediator complexes — supported by chromosome conformation capture (3C/4C/Hi-C) data showing enriched contact frequencies between enhancers and their target promoters. Recent evidence from live imaging and perturbation studies suggests that enhancers may also act through a 'hub' or 'condensate' model, where phase-separated transcriptional condensates concentrate transcription factors and coactivators at active loci",
      "C": "Enhancers activate their target genes by physically sliding along the intervening chromatin fiber like a processive scanning enzyme, using ATP hydrolysis to translocate unidirectionally from the enhancer element through all intervening DNA sequences until they physically contact and dock with the target promoter, a process that requires continuous energy input that is proportional to the genomic distance between the enhancer and the gene it regulates and that is completely blocked by any structural barrier inserted between them",
      "D": "Enhancers can only regulate genes located immediately adjacent to them within one kilobase of linear genomic distance, because the transcription factors and coactivators bound to enhancer elements cannot exert any influence on promoters beyond this short range — long-range regulatory effects attributed to distant enhancers are actually mediated by chains of closely spaced intermediate relay elements that sequentially propagate the activation signal along the chromosome from one element to the next until it reaches the target gene"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.80558,
    "y": 0.27161,
    "z": 0.65221,
    "source_article": "enhancer-promoter communication",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "enhancer-promoter communication",
      "chromatin looping",
      "3D genome organization",
      "transcriptional condensates",
      "chromosome conformation capture"
    ]
  },
  {
    "id": "bce35508c1a671a8",
    "question_text": "Synthetic lethality occurs when simultaneous loss of two genes causes cell death, while loss of either gene alone is viable. The BRCA1/2-PARP inhibitor interaction is the most clinically successful example. What is the precise molecular logic of this synthetic lethality?",
    "options": {
      "A": "PARP inhibitors kill BRCA-mutant cancer cells simply by preventing the base excision repair pathway from correcting damaged bases in DNA, allowing point mutations to accumulate over successive cell divisions until the aggregate mutational burden exceeds a critical threshold of genome integrity",
      "B": "PARP inhibitors function by directly activating the intrinsic mitochondrial apoptosis pathway through release of cytochrome c from the inner mitochondrial membrane, and cells harboring BRCA1 or BRCA2 mutations are selectively sensitized to this apoptotic signal due to their already compromised DNA damage response",
      "C": "BRCA1/2 are essential for homologous recombination (HR) repair of double-strand breaks. PARP inhibitors trap PARP1 on DNA at single-strand break repair intermediates, creating replication fork obstacles that generate double-strand breaks during S phase. Normal cells repair these DSBs via HR, but BRCA-deficient cells cannot, forcing them into error-prone repair pathways (like NHEJ or microhomology-mediated end joining) that cause genomic catastrophe and cell death",
      "D": "PARP inhibitors function by completely and irreversibly halting all DNA replication fork progression throughout the genome, preventing S-phase completion entirely in all dividing cells; BRCA-mutant cancer cells are selectively killed because they depend on rapid and continuous cellular division for their proliferative advantage and cannot tolerate even temporary replication arrest, whereas normal cells with intact BRCA can enter a protective quiescent state and resume replication after the drug is cleared from the system"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.814076,
    "y": 0.443347,
    "z": 0.697236,
    "source_article": "synthetic lethality",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "synthetic lethality",
      "PARP trapping",
      "BRCA1/2",
      "homologous recombination",
      "replication fork collapse"
    ]
  },
  {
    "id": "dffe17123eccbab6",
    "question_text": "Horizontal gene transfer (HGT) challenges the tree-like model of evolution by allowing genes to move between unrelated species. In prokaryotes, HGT is pervasive. What evidence established that HGT also occurs in eukaryotes, and what is the most striking example?",
    "options": {
      "A": "Horizontal gene transfer does not occur in any eukaryotic organisms; all genes found in eukaryotic genomes are exclusively inherited vertically through parent-to-offspring transmission during sexual or asexual reproduction, and any bacterial-like sequences detected in eukaryotic genome assemblies represent contamination artifacts from bacterial DNA that was present in the sequencing library preparation rather than genuine genomic integrations that have been inherited and maintained through evolution",
      "B": "Eukaryotic horizontal gene transfer has been documented through phylogenomic analyses but involves only the movement of selfish transposable elements such as DNA transposons and retrotransposons between species, never the transfer of functional protein-coding genes that contribute to the metabolic, developmental, or adaptive capabilities of the recipient organism — the transferred elements are exclusively genomic parasites with no beneficial or neutral functional consequences for the host organism",
      "C": "Horizontal gene transfer in eukaryotic organisms occurs exclusively through viral infection events where bacteriophages or eukaryotic viruses serve as vectors that carry bacterial DNA sequences into eukaryotic cells during lytic or lysogenic infection cycles, and it does not involve the direct acquisition of bacterial chromosomal genes through any other mechanism such as transformation, conjugation-like processes, or endosymbiotic gene transfer from organellar genomes to the host nuclear genome",
      "D": "HGT in eukaryotes was established through the discovery of endosymbiotic gene transfer (EGT) — where mitochondrial and chloroplast genes moved to the nuclear genome — and later by phylogenomic analyses revealing genes in eukaryotic genomes that are more closely related to distantly-related organisms than to close relatives. A striking example is bdelloid rotifers, whose genomes contain 8-10% foreign DNA acquired from bacteria, fungi, and plants, integrated into functional chromosomal locations"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.8629,
    "y": 0.120822,
    "z": 0.885174,
    "source_article": "horizontal gene transfer",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "horizontal gene transfer",
      "endosymbiotic gene transfer",
      "bdelloid rotifers",
      "phylogenomics",
      "eukaryotic genome evolution"
    ]
  },
  {
    "id": "86fb8cff550e1a70",
    "question_text": "Epistasis occurs when the effect of one gene depends on the genotype at another gene. In Labrador retrievers, coat color requires two genes: one for pigment (B/b) and one for pigment deposition (E/e). What phenotype results from the ee genotype?",
    "options": {
      "A": "Yellow coat regardless of the B locus genotype — the ee genotype prevents deposition of any pigment (black or brown) into the coat, making the E locus epistatic to the B locus because it masks the phenotypic expression of whichever pigment allele is present",
      "B": "The ee genotype always produces a black coat regardless of the E locus mutation status, because the B locus pigment gene is constitutively active and overrides any deficiency in pigment deposition — which ignores the epistatic relationship where the E locus controls whether any pigment is deposited in the coat at all",
      "C": "The ee genotype always produces a chocolate brown coat because the absence of functional E locus protein causes a shift from eumelanin to phaeomelanin production — which confuses the B locus function (determining black versus brown eumelanin) with the E locus function (determining whether eumelanin is deposited at all)",
      "D": "The ee genotype is lethal and no puppies with this genotype survive to birth, because the pigment deposition pathway is essential for embryonic viability — which is incorrect since ee (yellow) Labrador retrievers are healthy, common, and fully viable, demonstrating that the MC1R loss-of-function affecting coat color has no effect on survival"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.954977,
    "y": 0.349216,
    "z": 0.653915,
    "source_article": "epistasis",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "epistasis",
      "gene interaction",
      "pigment deposition",
      "masking"
    ]
  },
  {
    "id": "58fb560295c64a44",
    "question_text": "Codominance and incomplete dominance both produce heterozygous phenotypes different from either homozygote. What distinguishes codominance from incomplete dominance?",
    "options": {
      "A": "Codominance produces a phenotype identical to one homozygous parent while completely suppressing the other allele, thus showing simple complete dominance rather than the simultaneous expression of both alleles that actually characterizes codominance in systems like the ABO blood group",
      "B": "In codominance, both alleles are simultaneously and fully expressed in the heterozygote (e.g., AB blood type shows both A and B antigens), while in incomplete dominance the heterozygote shows an intermediate phenotype between the two homozygotes (e.g., red × white → pink flowers)",
      "C": "Codominance and incomplete dominance are exactly the same phenomenon with no difference",
      "D": "Incomplete dominance occurs only in bacteria while codominance occurs only in viruses"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.962089,
    "y": 0.35811,
    "z": 0.438024,
    "source_article": "codominance",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "codominance",
      "incomplete dominance",
      "heterozygote phenotype",
      "allelic expression"
    ]
  },
  {
    "id": "49fb293c706a62c4",
    "question_text": "Genetic linkage causes genes located close together on the same chromosome to be inherited together more often than expected by independent assortment. What process can break linkage between two genes?",
    "options": {
      "A": "Mitotic cell division in somatic cells always breaks all genetic linkages on every chromosome during every cell division cycle, completely shuffling the arrangement of alleles along each chromosome after each round of mitosis — which is incorrect because mitotic recombination is rare and linkage is broken primarily by meiotic crossing over",
      "B": "Point mutations at random positions in the genome automatically unlink all genes on the same chromosome by disrupting the physical continuity of the DNA molecule — individual nucleotide changes somehow separate linked genes, which confuses the concept of sequence mutation with the physical exchange of chromosome segments during recombination",
      "C": "Homologous recombination (crossing over) during meiosis I physically exchanges segments between homologous chromosomes — the probability of a crossover occurring between two loci increases with their physical distance, so the recombination frequency serves as a measure of genetic distance",
      "D": "Genetic linkage is permanent and can never be broken by any biological mechanism"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.936032,
    "y": 0.232552,
    "z": 0.59482,
    "source_article": "genetic linkage",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "genetic linkage",
      "recombination",
      "crossing over",
      "genetic distance"
    ]
  },
  {
    "id": "f9f66a242bccf186",
    "question_text": "A Punnett square predicts offspring ratios from a cross. If two organisms heterozygous for two unlinked genes (AaBb × AaBb) are crossed, what phenotypic ratio is expected for traits showing complete dominance?",
    "options": {
      "A": "1:1:1:1 — equal proportions of all four phenotypic classes, which is the expected ratio from a testcross (AaBb × aabb) rather than the dihybrid cross between two double heterozygotes where each gene independently segregates 3:1",
      "B": "3:1 — three dominant to one recessive, which is the expected monohybrid ratio for a cross involving a single gene (Aa × Aa) rather than the dihybrid ratio that involves two independently assorting genes each segregating in a 3:1 pattern",
      "C": "1:2:1 — one homozygous dominant, two heterozygous, one homozygous recessive, which is the genotypic rather than phenotypic ratio for a monohybrid cross, and describes genotype frequencies for a single gene rather than phenotype frequencies for two genes",
      "D": "9:3:3:1 — nine with both dominant traits, three with the first dominant only, three with the second dominant only, and one with both recessive traits, reflecting independent assortment of two genes each segregating 3:1"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.99,
    "y": 0.378808,
    "z": 0.479838,
    "source_article": "dihybrid cross",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "dihybrid cross",
      "9:3:3:1 ratio",
      "independent assortment",
      "Punnett square"
    ]
  },
  {
    "id": "21d26f55520087dc",
    "question_text": "Alternative splicing allows a single gene to produce multiple different mRNA transcripts. Why does this have profound implications for the relationship between gene number and organism complexity?",
    "options": {
      "A": "Alternative splicing dramatically expands the proteome beyond gene number — the ~20,000 human protein-coding genes generate over 100,000 distinct protein isoforms through combinatorial inclusion or exclusion of exons, enabling biological complexity that gene count alone cannot explain",
      "B": "Alternative splicing reduces protein diversity by ensuring that every gene produces only one possible protein product through constitutive splicing of every exon in a fixed order — there is no mechanism for including or excluding specific exons, no regulation of splice site choice, and no capacity for generating multiple protein isoforms from a single gene",
      "C": "Alternative splicing occurs only in prokaryotic organisms such as bacteria and archaea and is completely absent from all eukaryotic organisms including humans, animals, plants, and fungi — which contradicts the fact that >95% of human multi-exon genes undergo alternative splicing to generate the vast proteomic diversity essential for tissue-specific function",
      "D": "Alternative splicing has no effect on protein diversity because all splice variants produce identical proteins"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.786195,
    "y": 0.052424,
    "z": 0.512996,
    "source_article": "alternative splicing",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "alternative splicing",
      "proteome expansion",
      "gene-protein relationship",
      "biological complexity"
    ]
  },
  {
    "id": "00ee12a3abaf26ce",
    "question_text": "Genetic drift is an evolutionary force that changes allele frequencies through random sampling. In what type of population does genetic drift have the strongest effect?",
    "options": {
      "A": "Genetic drift is strongest in very large populations with millions of individuals where random fluctuations are amplified across the enormous population — the larger the population, the greater the sampling variance in allele frequencies, which is the precise opposite of the actual inverse relationship between population size and drift strength",
      "B": "Small populations — random sampling effects are inversely proportional to population size (variance in allele frequency change ∝ 1/2N), so founder effects, bottlenecks, and small isolated populations experience the largest random fluctuations, potentially fixing deleterious alleles or losing beneficial ones through chance alone",
      "C": "Genetic drift affects only allele frequencies at mitochondrial loci and has no effect on nuclear genes",
      "D": "Genetic drift operates with equal strength in all population sizes and is independent of the number of individuals"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.95088,
    "y": 0.066213,
    "z": 0.851804,
    "source_article": "genetic drift",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "genetic drift",
      "population size",
      "stochastic evolution",
      "founder effect"
    ]
  },
  {
    "id": "ae4fbcac49884abd",
    "question_text": "Retrotransposons replicate through an RNA intermediate that is reverse-transcribed back into DNA. What distinguishes retrotransposons from DNA transposons in their mechanism of genomic spread?",
    "options": {
      "A": "Retrotransposons move exclusively by the 'cut-and-paste' mechanism using transposase to excise from their original genomic location and reinsert at a new site — which is the mechanism of DNA transposons, not retrotransposons, and fails to account for the copy-number amplification through RNA intermediates and reverse transcription that has expanded retrotransposons to comprise over 40% of the human genome",
      "B": "Retrotransposons are found only in bacterial genomes and are completely absent from all eukaryotic organisms including humans, animals, plants, and fungi — which contradicts the fact that retrotransposons (LINE-1, Alu, SVA, LTR elements) constitute approximately 42% of the human genome and are present in virtually all eukaryotic species that have been sequenced",
      "C": "Retrotransposons move by 'copy-and-paste' — the original element remains in place while a new copy is inserted elsewhere via reverse transcription — potentially increasing copy number, while DNA transposons typically move by 'cut-and-paste' using transposase to excise from one site and reinsert at another",
      "D": "Retrotransposons and DNA transposons use completely identical mechanisms with absolutely no difference in their mode of transposition, enzyme requirements, or copy number consequences — which ignores the fundamental distinction between copy-and-paste (retrotransposon, via RNA intermediate and reverse transcriptase) and cut-and-paste (DNA transposon, via transposase excision and reinsertion)"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.802328,
    "y": 0.228614,
    "z": 0.797367,
    "source_article": "retrotransposons",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "retrotransposons",
      "DNA transposons",
      "copy-and-paste",
      "reverse transcription"
    ]
  },
  {
    "id": "ceac6261b577e36e",
    "question_text": "The lac operon in E. coli is a classic model of gene regulation. What dual condition must be met for maximal transcription of the lac operon?",
    "options": {
      "A": "High glucose and high lactose must both be present simultaneously for maximal transcription of the lac operon — which ignores catabolite repression, the mechanism by which glucose suppresses lac operon transcription even when lactose is present, because high glucose keeps cAMP levels low, preventing CAP-cAMP activation of the promoter",
      "B": "The lac operon is constitutively expressed at maximum levels under all environmental conditions regardless of whether lactose or glucose is available — there is no repressor, no activator, and no regulation of transcription by carbon source availability, which contradicts the dual negative (LacI repressor) and positive (CAP-cAMP) regulatory mechanisms that Jacob and Monod elegantly described",
      "C": "High lactose must be present for transcription to occur even if no other carbon source is available — this captures only half of the dual control mechanism, ignoring the requirement that glucose must also be absent for full activation, since glucose suppresses cAMP production and prevents the CAP-cAMP positive activation that is essential for maximal lac operon transcription",
      "D": "Lactose must be present (to inactivate the lac repressor, allowing RNA polymerase access) AND glucose must be absent (so that cAMP levels rise, enabling the CAP-cAMP complex to bind and enhance transcription) — this dual control ensures the operon is fully active only when lactose is the best available carbon source"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.864108,
    "y": 0.355726,
    "z": 1.0,
    "source_article": "lac operon",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "lac operon",
      "catabolite repression",
      "dual regulation",
      "CAP-cAMP"
    ]
  },
  {
    "id": "4f28903bf9a555b1",
    "question_text": "Balancing selection maintains genetic variation in a population. What mechanism explains why the sickle cell allele (HbS) remains at high frequency in malaria-endemic regions despite being lethal in homozygotes?",
    "options": {
      "A": "Heterozygote advantage (overdominance) — HbAS heterozygotes have higher fitness than either homozygote because they gain substantial malaria resistance without the severe anemia of HbSS homozygotes, creating a stable polymorphism where natural selection actively maintains both alleles",
      "B": "HbS homozygotes with sickle cell disease are the healthiest individuals in the population and have the highest overall fitness — they experience no vaso-occlusive crises, no hemolytic anemia, no organ damage, and no reduced survival, which contradicts the well-documented lethality of untreated homozygous sickle cell disease in malaria-endemic regions",
      "C": "The HbS allele frequency is decreasing rapidly in all human populations worldwide and will completely disappear within a single generation through purifying natural selection — which ignores the balancing selection maintaining HbS at stable intermediate frequencies in malaria-endemic regions through the fitness advantage of heterozygous carriers",
      "D": "The HbS allele frequency is decreasing rapidly in all populations and will disappear within one generation"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.954235,
    "y": 0.178798,
    "z": 0.665602,
    "source_article": "balancing selection",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "balancing selection",
      "heterozygote advantage",
      "sickle cell",
      "malaria resistance"
    ]
  },
  {
    "id": "709096d311870789",
    "question_text": "Chromatin immunoprecipitation sequencing (ChIP-seq) identifies protein-DNA interactions genome-wide. If you perform ChIP-seq with an antibody against H3K27me3 (histone 3 lysine 27 trimethylation), what type of genomic regions would you expect to be enriched?",
    "options": {
      "A": "H3K27me3 ChIP-seq would enrich for actively transcribed housekeeping gene promoters with high RNA polymerase II occupancy and abundant H3K4me3 and H3K27ac marks — confusing the repressive function of H3K27me3 (Polycomb silencing) with the active chromatin marks that characterize highly expressed genes",
      "B": "H3K27me3 is a repressive mark deposited by Polycomb Repressive Complex 2 (PRC2/EZH2) — it marks silenced developmental genes, bivalent promoters in stem cells, and imprinted loci, so ChIP-seq enrichment would identify transcriptionally repressed regions under Polycomb-mediated silencing",
      "C": "Centromeric satellite repeats exclusively, with no enrichment at any gene regulatory regions, developmental promoters, Polycomb target genes, or bivalent domains — a claim that incorrectly restricts H3K27me3 localization to pericentromeric heterochromatin rather than the developmentally regulated facultative heterochromatin where it actually resides",
      "D": "Mitochondrial DNA sequences, since H3K27me3 is found only in the mitochondrial genome"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.796944,
    "y": 0.338326,
    "z": 0.633229,
    "source_article": "ChIP-seq",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "ChIP-seq",
      "H3K27me3",
      "Polycomb silencing",
      "histone marks"
    ]
  },
  {
    "id": "d88d8a073f53bc94",
    "question_text": "Copy number variation (CNV) involves gains or losses of DNA segments ranging from kilobases to megabases. Why are CNVs clinically significant?",
    "options": {
      "A": "Copy number variations have absolutely no clinical significance whatsoever and are never associated with any human disease, developmental disorder, or phenotypic variation — they are entirely benign structural variants with no capacity to disrupt gene dosage, create fusion genes, unmask recessive alleles, or contribute to complex disease susceptibility in any individual or population",
      "B": "CNVs affect only non-coding junk DNA and never alter any functional genes or regulatory elements",
      "C": "CNVs contribute more base pairs of difference between any two human genomes than single nucleotide polymorphisms — they can disrupt gene dosage, create fusion genes, unmask recessive alleles through deletion, and cause disorders from autism and schizophrenia to immune deficiencies, making them a major source of both normal variation and disease",
      "D": "Copy number variations occur only in cancer cells as somatic mutations and are never found in normal germline genomes — they arise solely through tumor-associated chromosomal instability and are never inherited or present at birth"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.818225,
    "y": 0.236558,
    "z": 0.172051,
    "source_article": "copy number variation",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "copy number variation",
      "structural variation",
      "gene dosage",
      "genomic disorders"
    ]
  },
  {
    "id": "33c18b6405be85cb",
    "question_text": "The central dogma of molecular biology describes the flow of genetic information. In what specific circumstance does information flow from RNA back to DNA, violating the simplest version of the central dogma?",
    "options": {
      "A": "Information never flows from RNA to DNA under any circumstances in any organism or virus — reverse transcriptase does not exist, retroviruses do not convert their RNA genomes to DNA, retrotransposons do not use RNA intermediates for transposition, and telomerase does not use an RNA template for telomere extension, which contradicts the well-established reverse transcription mechanisms discovered by Temin and Baltimore",
      "B": "RNA-to-DNA information flow occurs only in plants through the process of photosynthesis, where chloroplasts convert light energy into genetic information flowing from RNA back to DNA — a claim that confuses energy metabolism with nucleic acid information flow and misidentifies the biological process involved, since photosynthesis converts light to chemical energy and does not involve reverse transcription",
      "C": "RNA-to-DNA information flow occurs only in plants through photosynthesis",
      "D": "Reverse transcriptase enzymes (found in retroviruses like HIV, retrotransposons, and telomerase) synthesize DNA from an RNA template — this RNA→DNA information flow is essential for retroviral replication, LINE-1 transposition, and telomere maintenance, extending rather than truly violating Crick's original formulation"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.829709,
    "y": 0.327641,
    "z": 0.955923,
    "source_article": "central dogma",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "central dogma",
      "reverse transcription",
      "retrovirus",
      "information flow"
    ]
  },
  {
    "id": "3933597312754d63",
    "question_text": "Non-coding RNAs have emerged as major regulators of gene expression. What mechanism allows microRNAs (miRNAs) to repress the translation of specific target mRNAs?",
    "options": {
      "A": "miRNAs (~22 nucleotides) are loaded into the RNA-induced silencing complex (RISC/Argonaute) and guide it to complementary sequences in the 3' UTR of target mRNAs — imperfect base pairing leads to translational repression and/or mRNA deadenylation and decay, while perfect complementarity can trigger mRNA cleavage",
      "B": "miRNAs directly modify the DNA sequence of target genes through enzymatic editing of genomic DNA",
      "C": "miRNAs are large structural RNAs that form the ribosome's catalytic core and have no gene regulatory function",
      "D": "miRNAs function only by activating gene expression and cannot repress translation of any target"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.793585,
    "y": 0.269907,
    "z": 0.695998,
    "source_article": "microRNA",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "microRNA",
      "RISC",
      "post-transcriptional regulation",
      "translational repression"
    ]
  },
  {
    "id": "919d10ef812444f0",
    "question_text": "Epigenetic inheritance refers to heritable changes in gene expression that do not involve DNA sequence changes. What is the strongest evidence that epigenetic states can be transmitted across generations in mammals?",
    "options": {
      "A": "Epigenetic states are always completely erased between every generation and can absolutely never be transmitted from parent to offspring under any circumstances — all epigenetic marks including DNA methylation at imprinting control regions are fully removed during gametogenesis and never re-established in a parent-of-origin-specific manner",
      "B": "Genomic imprinting — certain genes (e.g., IGF2, H19) are expressed exclusively from one parental allele based on parent-of-origin-specific DNA methylation established in the germline, demonstrating that epigenetic marks survive reprogramming at specific loci and produce consistent parent-of-origin effects across generations",
      "C": "Epigenetic inheritance occurs only in plants and bacteria, never in any mammalian species",
      "D": "All genes in mammals are expressed equally from both parental alleles with no parent-of-origin effects"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.880155,
    "y": 0.258871,
    "z": 0.569835,
    "source_article": "epigenetic inheritance",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "epigenetic inheritance",
      "genomic imprinting",
      "parent-of-origin effects",
      "DNA methylation"
    ]
  },
  {
    "id": "72ecbf56c0cd629c",
    "question_text": "Whole-genome duplication (polyploidy) has occurred multiple times in evolutionary history. What evidence supports the hypothesis that two rounds of whole-genome duplication occurred early in vertebrate evolution?",
    "options": {
      "A": "Anticipation is purely an observational artifact with absolutely no molecular basis — the apparent worsening of genetic diseases across generations is caused entirely by ascertainment bias in clinical diagnosis and has no connection to repeat tract instability, meiotic expansion, or any molecular mechanism of increasing severity, contradicting the directly measured correlation between repeat length and disease onset",
      "B": "The trinucleotide repeat region is inherently stable during DNA replication and meiosis — repeats never expand from generation to generation, and longer repeat tracts produce exactly the same phenotype as shorter ones with no dosage effect or length-severity correlation, which contradicts the well-documented expansion bias and the strong inverse correlation between CAG repeat length and age of onset in Huntington disease",
      "C": "The 2R hypothesis is supported by the existence of four paralogous HOX gene clusters in mammals (HOXA, HOXB, HOXC, HOXD) compared to a single cluster in amphioxus — this four-fold multiplication of an ancestral gene cluster, along with similar patterns in other gene families, is consistent with two rounds of whole-genome duplication",
      "D": "Polyploidy occurs exclusively in plants and never in the animal kingdom"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.84969,
    "y": 0.091745,
    "z": 0.78337,
    "source_article": "2R hypothesis",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "2R hypothesis",
      "whole-genome duplication",
      "HOX clusters",
      "vertebrate evolution"
    ]
  },
  {
    "id": "8e0d278e021801f9",
    "question_text": "Genetic anticipation refers to a pattern where a genetic disease becomes more severe or has earlier onset in successive generations. What molecular mechanism explains anticipation in trinucleotide repeat disorders?",
    "options": {
      "A": "Anticipation is an observational artifact with no molecular basis — the apparent worsening is due to ascertainment bias alone",
      "B": "Anticipation is caused by accumulating environmental toxin exposure across generations and has no genetic component",
      "C": "Each successive generation independently acquires entirely new point mutations unrelated to the trinucleotide repeat length that coincidentally cause progressively worse disease — there is no molecular connection between repeat tract instability and intergenerational severity increase, and the apparent worsening across generations has nothing to do with repeat expansion during meiotic DNA replication",
      "D": "The trinucleotide repeat region is inherently unstable during DNA replication and meiosis — repeats tend to expand from generation to generation, and longer repeat tracts produce more severe protein dysfunction (toxic gain-of-function or loss-of-function), causing progressive worsening across generations"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.847277,
    "y": 0.371529,
    "z": 0.276455,
    "source_article": "anticipation",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "anticipation",
      "trinucleotide repeat expansion",
      "dynamic mutation",
      "replication slippage"
    ]
  },
  {
    "id": "d895ede3502785f0",
    "question_text": "Haplotype blocks and linkage disequilibrium (LD) structure vary across human populations. What is the practical significance of LD decay patterns for genetic mapping studies?",
    "options": {
      "A": "In populations with extensive LD (long haplotype blocks, e.g., European or East Asian), fewer markers are needed for genome-wide coverage, but mapping resolution is lower — in populations with less LD (shorter blocks, e.g., African), more markers are needed but finer mapping resolution is achievable because the causal variant is in LD with fewer neighbors",
      "B": "LD patterns have no practical significance for genetic mapping and can be completely ignored in study design",
      "C": "All human populations have completely identical linkage disequilibrium structures with absolutely no variation in haplotype block size, LD decay rates, or recombination history — African, European, East Asian, and all other populations show exactly the same LD patterns, making population-specific considerations entirely unnecessary for genetic mapping study design and marker selection strategies",
      "D": "LD is relevant only for linkage analysis in families and has no application to population-based association studies"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.882353,
    "y": 0.01,
    "z": 0.363732,
    "source_article": "linkage disequilibrium",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "linkage disequilibrium",
      "haplotype blocks",
      "genetic mapping",
      "population genetics"
    ]
  },
  {
    "id": "4646e132ca2ed3b2",
    "question_text": "Long non-coding RNAs (lncRNAs) are transcripts longer than 200 nucleotides that do not encode proteins. What feature of lncRNA biology makes their functional characterization particularly challenging?",
    "options": {
      "A": "lncRNAs are extremely well-characterized and every known lncRNA has a fully understood molecular mechanism",
      "B": "Unlike protein-coding genes, most lncRNAs are poorly conserved across species, expressed at low levels in specific cell types, and function through diverse mechanisms (scaffolding, guiding, decoying, signaling) — this heterogeneity in conservation, expression, and mechanism makes it difficult to predict function from sequence alone or to generalize from one lncRNA to another",
      "C": "lncRNAs do not actually exist — they are artifacts of RNA sequencing technology with no biological reality",
      "D": "All lncRNAs have identical sequences and identical functions, making characterization trivially easy"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.76,
    "y": 0.163993,
    "z": 0.6214,
    "source_article": "lncRNA",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "lncRNA",
      "functional characterization",
      "sequence conservation",
      "mechanistic diversity"
    ]
  },
  {
    "id": "3aa7b10037012476",
    "question_text": "Phase variation is a mechanism bacteria use to rapidly switch gene expression on and off. What molecular mechanism underlies phase variation in many pathogenic bacteria?",
    "options": {
      "A": "Phase variation is caused exclusively by changes in environmental temperature that directly melt bacterial DNA and prevent all gene expression from temperature-sensitive loci — which confuses thermodynamic DNA denaturation with the actual genetic mechanisms of phase variation (DNA inversion, slipped-strand mispairing at simple sequence repeats, and reversible Dam methylation) that stochastically switch individual genes on and off independently of temperature",
      "B": "Phase variation is a phenomenon unique to eukaryotic cells such as those of animals, plants, and fungi, and has never been observed in any bacterial species — which contradicts the extensive documentation of phase variation in pathogenic bacteria including Salmonella (flagellar antigen switching by hin invertase), Haemophilus influenzae (LPS modification by repeat-tract slippage), and Neisseria (pilin antigenic variation through gene conversion)",
      "C": "Reversible DNA inversions (mediated by site-specific recombinases), slipped-strand mispairing at simple sequence repeats during replication, or reversible epigenetic modification (Dam methylation) can stochastically switch genes between ON and OFF states — this generates phenotypic diversity within clonal populations, enabling immune evasion without requiring new mutations",
      "D": "Phase variation occurs only through horizontal gene transfer from other bacterial species, requiring the acquisition of entirely new genetic material from external sources rather than using intrinsic genetic mechanisms — which misidentifies the mechanism, since phase variation relies on endogenous DNA rearrangement, replication slippage, or epigenetic switching within the organism's own genome without any requirement for foreign DNA"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.872302,
    "y": 0.243981,
    "z": 0.917252,
    "source_article": "phase variation",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "phase variation",
      "antigenic switching",
      "slipped-strand mispairing",
      "bacterial gene regulation"
    ]
  },
  {
    "id": "cf9f26d9b6258692",
    "question_text": "Chromosomal inversions can have significant evolutionary consequences even if they don't disrupt any gene. How do inversions suppress recombination, and why is this evolutionarily important?",
    "options": {
      "A": "Inversions have no effect on recombination and are evolutionarily neutral with no consequences for adaptation",
      "B": "Inversions exist only in artificially constructed genomes and have never been observed in any natural population",
      "C": "Inversions increase recombination rates rather than suppressing them, making them detrimental to co-adapted gene combinations",
      "D": "In inversion heterozygotes, crossing over within the inverted segment produces unbalanced gametes (with duplications and deletions) that are typically inviable — this effectively suppresses recombination across the inverted region, locking together co-adapted gene combinations that can function as 'supergenes' controlling complex adaptive phenotypes"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.910326,
    "y": 0.306989,
    "z": 0.855618,
    "source_article": "chromosomal inversions",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "chromosomal inversions",
      "recombination suppression",
      "supergenes",
      "coadaptation"
    ]
  },
  {
    "id": "d206f66a91b5cff0",
    "question_text": "DNA damage tolerance mechanisms allow replication to continue past DNA lesions. What distinguishes translesion synthesis (TLS) from template switching as damage tolerance strategies?",
    "options": {
      "A": "Translesion synthesis uses specialized low-fidelity polymerases (Pol η, ι, κ, Rev1) that can incorporate nucleotides opposite damaged bases but with reduced accuracy — it is inherently error-prone. Template switching uses the undamaged sister chromatid as an alternative template, achieving error-free bypass through a recombination-like mechanism",
      "B": "TLS is perfectly error-free while template switching is error-prone, which is the precise opposite of their actual fidelity profiles — in reality, translesion synthesis by Y-family polymerases (Pol eta, iota, kappa, Rev1) is inherently error-prone due to their spacious active sites that accommodate damaged bases but lack proofreading, while template switching uses the undamaged sister chromatid as a faithful template for error-free damage bypass",
      "C": "Neither translesion synthesis nor template switching exists as a biological mechanism — cells have absolutely no capacity to tolerate or bypass DNA damage during replication and always undergo cell death when lesions block the replication fork, which contradicts the well-documented damage tolerance pathways regulated by PCNA ubiquitination that enable cell survival in the presence of replication-blocking lesions",
      "D": "Both translesion synthesis and template switching are completely identical mechanisms that involve the same DNA polymerases using the same templates and producing the same fidelity outcomes — there is no distinction between error-prone bypass by specialized polymerases and error-free bypass using the sister chromatid, which ignores the fundamentally different enzymology and fidelity characteristics of these two pathways"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.807841,
    "y": 0.339792,
    "z": 0.69681,
    "source_article": "translesion synthesis",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "translesion synthesis",
      "template switching",
      "damage tolerance",
      "DNA repair fidelity"
    ]
  },
  {
    "id": "3caaea97b2ce5964",
    "question_text": "Paramutation is an epigenetic phenomenon where one allele can heritably alter the expression of a homologous allele. In what way does paramutation challenge classical Mendelian genetics?",
    "options": {
      "A": "Paramutation confirms all Mendelian predictions and provides no challenge whatsoever to classical genetics — alleles are always transmitted unchanged through generations and never interact epigenetically with each other in heterozygotes, which contradicts the well-documented phenomenon at the maize b1 locus where the paramutagenic B' allele heritably converts the paramutable B-I allele to a silenced state that is then maintained in subsequent generations",
      "B": "In paramutation (e.g., maize b1 locus), a silenced 'paramutagenic' allele converts an active 'paramutable' allele to a silenced state in the heterozygote, and this silenced state is then heritable through subsequent generations — violating Mendel's assumption that alleles are transmitted unchanged through generations, since one allele permanently alters the other's expression state",
      "C": "Paramutation involves only conventional DNA sequence changes such as point mutations, insertions, and deletions and is fully explained by standard Mendelian mutation theory — there is no epigenetic component, no heritable silencing, and no allele-to-allele transfer of expression state, which contradicts the RNA-directed DNA methylation mechanism and the Mediator of Paramutation (MOP) pathway that maintain paramutant states across generations",
      "D": "Paramutation has been observed only a single time in one individual plant of one species and has absolutely no broader biological significance for understanding genetics, epigenetics, or inheritance — it is an irreproducible curiosity with no implications for gene regulation, which contradicts its documentation in multiple plant and animal species and its involvement of conserved RNA-directed chromatin modification pathways"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.909281,
    "y": 0.340231,
    "z": 0.684767,
    "source_article": "paramutation",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "paramutation",
      "non-Mendelian inheritance",
      "epigenetic allele conversion",
      "heritable silencing"
    ]
  },
  {
    "id": "7ef5d98a32ea322e",
    "question_text": "The concept of genetic heterogeneity means that mutations in different genes can produce the same clinical phenotype. Why does genetic heterogeneity complicate genetic testing and counseling?",
    "options": {
      "A": "Genetic heterogeneity simplifies genetic testing because only one gene ever needs to be tested for any disease",
      "B": "Genetic heterogeneity is a theoretical concept that has never been demonstrated in any actual human disease",
      "C": "When a disease can result from mutations in any of dozens of genes (locus heterogeneity) or from different mutations within the same gene (allelic heterogeneity), a negative test for mutations in one gene does not rule out the disease — comprehensive gene panel testing or whole-exome sequencing is needed, and recurrence risk calculations must account for which gene is affected",
      "D": "Genetic heterogeneity means that all individuals with a given disease have identical mutations in the same gene"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.876353,
    "y": 0.193096,
    "z": 0.159877,
    "source_article": "genetic heterogeneity",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "genetic heterogeneity",
      "locus heterogeneity",
      "allelic heterogeneity",
      "genetic counseling"
    ]
  },
  {
    "id": "418cc7b265a9ed6e",
    "question_text": "Comparative genomics reveals that gene order (synteny) is often conserved between related species. What does synteny conservation tell us about genome evolution?",
    "options": {
      "A": "Synteny conservation — the preservation of gene order between related species — exists only between humans and bacteria, two organisms that diverged billions of years ago, and is paradoxically absent between closely related mammalian species such as humans and mice that share 80 million years of common ancestry, which inverts the actual pattern where synteny conservation is strongest between closely related species",
      "B": "All species in the tree of life have completely identical chromosome numbers and identical gene orders with absolutely no chromosomal rearrangements, inversions, translocations, fissions, or fusions having occurred at any point in evolutionary history — a claim that contradicts the extensive evidence for lineage-specific chromosomal rearrangements documented by comparative cytogenetics and whole-genome sequence alignment",
      "C": "Synteny conservation exists only between humans and bacteria, not between closely related mammalian species",
      "D": "Conserved synteny indicates that large chromosomal segments have been maintained intact through evolution — it reflects the relatively low rate of chromosomal rearrangements (inversions, translocations) compared to sequence divergence, and provides evidence for common ancestry, enables cross-species gene prediction, and reveals the history of chromosomal breakpoints that distinguish species"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.850151,
    "y": 0.097484,
    "z": 0.530729,
    "source_article": "synteny",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "synteny",
      "comparative genomics",
      "chromosomal rearrangement",
      "genome evolution"
    ]
  },
  {
    "id": "6551f2c04585d7e1",
    "question_text": "RNA editing post-transcriptionally alters the nucleotide sequence of an mRNA after transcription. What is the biological significance of adenosine-to-inosine (A-to-I) editing in humans?",
    "options": {
      "A": "ADAR enzymes (adenosine deaminases acting on RNA) convert adenosine to inosine in double-stranded RNA regions — since inosine is read as guanosine by the ribosome, this can recode codons, alter splicing, modify miRNA targeting, and regulate innate immune responses to self-RNA, with millions of A-to-I editing sites in the human transcriptome predominantly within Alu repeat sequences",
      "B": "A-to-I editing never occurs in human cells and is found only in invertebrates",
      "C": "A-to-I editing converts all adenosines in every mRNA to inosine simultaneously, completely changing every codon",
      "D": "RNA editing occurs only at the DNA level through direct modification of genomic adenosine residues"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.777265,
    "y": 0.256947,
    "z": 0.757038,
    "source_article": "RNA editing",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "RNA editing",
      "ADAR",
      "A-to-I editing",
      "Alu elements"
    ]
  },
  {
    "id": "551a319ef4e7088c",
    "question_text": "Genetic rescue can prevent extinction of small, inbred populations. What genetic principle makes introducing individuals from a different population effective at restoring population fitness?",
    "options": {
      "A": "Introducing new individuals from a different population always reduces population fitness through outbreeding depression and should never be attempted under any conservation circumstances — the genetic incompatibilities between populations invariably outweigh any benefits of increased heterozygosity, making genetic rescue counterproductive in all situations",
      "B": "Genetic rescue works by introducing new alleles that mask the effect of deleterious recessive alleles fixed by drift in the small population — heterozygosity is restored, inbreeding depression is reduced, and new genetic variation provides raw material for natural selection to act upon, increasing both survival and adaptive potential",
      "C": "Genetic rescue works only by increasing population size through reproduction, with no genetic mechanism involved",
      "D": "Small inbred populations never suffer fitness reduction and do not need genetic rescue"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.936658,
    "y": 0.065353,
    "z": 0.829154,
    "source_article": "genetic rescue",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "genetic rescue",
      "inbreeding depression",
      "heterozygosity",
      "conservation genetics"
    ]
  },
  {
    "id": "5354336f592b9009",
    "question_text": "Genome-wide CRISPR screens systematically knock out or activate every gene in the genome to identify those required for a specific phenotype. What makes pooled CRISPR screens more powerful than traditional candidate-gene approaches?",
    "options": {
      "A": "CRISPR screens test only a single gene at a time and are no more powerful than traditional candidate-gene approaches in identifying genetic determinants of cellular phenotypes — they offer no unbiased genome-wide discovery capability, no ability to identify unexpected gene-phenotype relationships, and no advantage in throughput or hypothesis-free screening compared to conventional targeted knockdown or knockout experiments",
      "B": "CRISPR screens test the same three genes that traditional methods already identified and add no new information",
      "C": "Pooled CRISPR screens are unbiased and genome-wide — a library of guide RNAs targeting every gene is introduced into a cell population, selective pressure is applied, and surviving cells are sequenced to identify enriched or depleted guides — this reveals essential genes, drug resistance mechanisms, or synthetic lethal partners without prior hypotheses about which genes are involved",
      "D": "CRISPR screens can only be performed in bacteria and have no application in mammalian cell biology"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.781704,
    "y": 0.171214,
    "z": 0.411688,
    "source_article": "CRISPR screen",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "CRISPR screen",
      "functional genomics",
      "pooled screen",
      "unbiased discovery"
    ]
  },
  {
    "id": "db9388194501342c",
    "question_text": "Mosaicism occurs when an organism contains cells with two or more different genotypes derived from a single fertilized egg. What developmental process commonly generates somatic mosaicism?",
    "options": {
      "A": "Mosaicism cannot occur because all cells in an organism are genetically identical from fertilization through death",
      "B": "Somatic mosaicism has never been detected in any human tissue by any method",
      "C": "Mosaicism is caused exclusively by mixing of cells from two different fertilized eggs, which is chimerism rather than mosaicism",
      "D": "Post-zygotic mutations (point mutations, chromosomal rearrangements, or retrotransposon insertions) occurring during embryonic cell division create clonal lineages of cells with different genotypes — the earlier the mutation occurs, the larger the fraction of the body affected, which is why timing of the somatic mutation determines the extent and clinical severity of mosaic conditions"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.88575,
    "y": 0.299625,
    "z": 0.419023,
    "source_article": "somatic mosaicism",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "somatic mosaicism",
      "post-zygotic mutation",
      "clonal expansion",
      "developmental timing"
    ]
  },
  {
    "id": "38601113ef96624f",
    "question_text": "The fitness landscape concept (Sewall Wright) describes how genotype maps to fitness across multiple genetic dimensions. Why are fitness landscapes important for understanding adaptive evolution?",
    "options": {
      "A": "Fitness landscapes visualize how populations can become trapped on local fitness peaks — if reaching a higher peak requires passing through a valley of reduced fitness, natural selection alone cannot drive the transition, and stochastic processes (drift) or epistatic interactions must facilitate peak shifts, shaping the accessibility of evolutionary trajectories",
      "B": "Fitness landscapes are identical to geographic landscapes and describe only the physical terrain where organisms live",
      "C": "Fitness landscapes are purely hypothetical mathematical constructs with no relevance to actual evolutionary processes",
      "D": "All fitness landscapes are perfectly smooth with a single global optimum and no local peaks, making adaptive evolution trivially simple"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.935516,
    "y": 0.034338,
    "z": 0.954892,
    "source_article": "fitness landscape",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "fitness landscape",
      "adaptive evolution",
      "local optima",
      "evolutionary constraints"
    ]
  },
  {
    "id": "3993b334f04e9480",
    "question_text": "A pedigree shows a trait that appears in every generation, affects males and females equally, and every affected individual has at least one affected parent. What inheritance pattern does this suggest?",
    "options": {
      "A": "X-linked recessive inheritance, which typically skips generations and affects mainly males",
      "B": "Autosomal dominant inheritance — the trait requires only one copy of the mutant allele to manifest, appears in every generation because affected individuals are heterozygous and pass the allele to ~50% of offspring, and affects both sexes equally because the gene is on an autosome",
      "C": "Mitochondrial inheritance, which is transmitted only from father to all children",
      "D": "The trait is not genetic and is caused entirely by environmental factors with no hereditary component"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.961852,
    "y": 0.299197,
    "z": 0.392342,
    "source_article": "pedigree analysis",
    "domain_ids": [
      "genetics",
      "biology"
    ],
    "concepts_tested": [
      "pedigree analysis",
      "autosomal dominant",
      "inheritance patterns",
      "vertical transmission"
    ]
  }
]