[
  {
    "id": "116c6f642412da63",
    "question_text": "A cell needs to transport a newly synthesized protein that will be secreted outside the cell. Through which organelle pathway must this protein travel?",
    "options": {
      "A": "Rough endoplasmic reticulum → Golgi apparatus → secretory vesicles → plasma membrane",
      "B": "Free ribosomes in the cytoplasm synthesize the protein, which then enters mitochondria via the TOM/TIM import complexes and is exported through the outer membrane",
      "C": "Smooth endoplasmic reticulum to lysosomes and then out through the plasma membrane",
      "D": "Nucleus to peroxisomes and then out through the plasma membrane"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.51,
    "y": 0.223062,
    "z": 0.703355,
    "source_article": "secretory pathway",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "secretory pathway",
      "endomembrane system",
      "protein trafficking"
    ]
  },
  {
    "id": "93ef88418755664a",
    "question_text": "What is the primary role of ATP synthase in the mitochondrial inner membrane?",
    "options": {
      "A": "Pumping protons from the mitochondrial matrix to the intermembrane space to establish the electrochemical gradient",
      "B": "Using the proton gradient to drive the phosphorylation of ADP to ATP",
      "C": "Transporting high-energy electrons from NADH through the chain of complexes to the final electron acceptor oxygen",
      "D": "Breaking down glucose into pyruvate during glycolysis"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.549973,
    "y": 0.43461,
    "z": 0.554008,
    "source_article": "oxidative phosphorylation",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "oxidative phosphorylation",
      "chemiosmosis",
      "ATP synthase mechanism"
    ]
  },
  {
    "id": "d2de67f1c2c15c35",
    "question_text": "During mitosis, what structure is directly responsible for physically separating sister chromatids?",
    "options": {
      "A": "The nuclear envelope reassembling around chromosomes",
      "B": "Actin microfilaments forming the contractile ring",
      "C": "The mitotic spindle (microtubules attached to kinetochores)",
      "D": "The endoplasmic reticulum tubular network"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.541835,
    "y": 0.140128,
    "z": 0.878383,
    "source_article": "mitosis",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "mitosis",
      "spindle apparatus",
      "chromosome segregation"
    ]
  },
  {
    "id": "4fdfe8ca1f6b9163",
    "question_text": "A mutation completely eliminates a cell's ability to perform autophagy. What is the most direct consequence?",
    "options": {
      "A": "The cell loses the ability to replicate its DNA because autophagy provides essential nucleotide precursors for the replication fork machinery",
      "B": "The cell cannot synthesize new proteins because autophagy recycles amino acids that are required to fuel ongoing translation",
      "C": "The cell cannot produce ATP because autophagy-derived substrates are the primary fuel source for mitochondrial oxidative phosphorylation",
      "D": "The cell accumulates damaged organelles and aggregated proteins that would normally be recycled"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.569007,
    "y": 0.410249,
    "z": 0.837197,
    "source_article": "autophagy",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "autophagy",
      "cellular homeostasis",
      "organelle turnover"
    ]
  },
  {
    "id": "f9412aec7ebb56e7",
    "question_text": "Receptor tyrosine kinases (RTKs) are activated by ligand binding at the cell surface. Why does ligand-induced dimerization lead to kinase activation?",
    "options": {
      "A": "Dimerization brings two intracellular kinase domains into proximity, allowing them to cross-phosphorylate each other's activation loops, which relieves autoinhibition",
      "B": "Dimerization causes the receptor to be rapidly internalized into endosomes where the low pH environment triggers a conformational change that activates the kinase catalytic domain",
      "C": "Dimerization opens an ion channel within the receptor complex that permits calcium influx to activate the kinase",
      "D": "Dimerization triggers proteolytic cleavage of the receptor ectodomain, releasing the intracellular kinase domain freely into the cytoplasm"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.584466,
    "y": 0.122622,
    "z": 0.450953,
    "source_article": "receptor tyrosine kinase signaling",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "receptor tyrosine kinase signaling",
      "trans-autophosphorylation",
      "signal transduction"
    ]
  },
  {
    "id": "234e442020855c11",
    "question_text": "The Wnt/β-catenin signaling pathway controls cell proliferation. In the absence of Wnt ligand, β-catenin is continuously degraded. What molecular mechanism drives this degradation?",
    "options": {
      "A": "β-catenin is degraded through the autophagy-lysosome pathway, where autophagosomes engulf cytoplasmic β-catenin and deliver it to lysosomes for proteolytic breakdown",
      "B": "A destruction complex (including APC, Axin, GSK-3β, and CK1) phosphorylates β-catenin, marking it for ubiquitination and proteasomal degradation",
      "C": "β-catenin is cleaved by activated caspases in the cytoplasm, which are specifically triggered by the absence of Wnt ligand binding to Frizzled receptors at the cell surface",
      "D": "β-catenin is exported from the cell via exosomes that bud from the plasma membrane"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.544103,
    "y": 0.306405,
    "z": 0.713866,
    "source_article": "Wnt signaling",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "Wnt signaling",
      "destruction complex",
      "ubiquitin-proteasome pathway",
      "GSK-3β"
    ]
  },
  {
    "id": "e3d9ddb285a20136",
    "question_text": "During translation, the ribosome must select the correct aminoacyl-tRNA for each codon. Beyond codon-anticodon base pairing, what additional mechanism ensures fidelity?",
    "options": {
      "A": "The mRNA is proofread by DNA polymerase before translation begins to ensure no errors are present in the coding sequence template",
      "B": "Each amino acid is individually tested by the ribosome's peptidyl transferase center, which verifies its identity before allowing peptide bond formation",
      "C": "Kinetic proofreading: the ribosome uses GTP hydrolysis by EF-Tu to introduce a time delay that allows near-cognate (incorrect) tRNAs to dissociate before peptide bond formation",
      "D": "The signal recognition particle screens each incoming aminoacyl-tRNA before it can enter the ribosomal A-site"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.653874,
    "y": 0.361034,
    "z": 0.221469,
    "source_article": "translational fidelity",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "translational fidelity",
      "kinetic proofreading",
      "EF-Tu",
      "GTP hydrolysis"
    ]
  },
  {
    "id": "6b68fc3df159b0f1",
    "question_text": "The nuclear pore complex (NPC) allows selective transport between the nucleus and cytoplasm. What determines whether a protein can pass through the NPC?",
    "options": {
      "A": "Only proteins smaller than 5 kilodaltons can passively diffuse through the nuclear pore complex, while all larger proteins are completely excluded from nuclear entry regardless of any signal sequences they carry",
      "B": "All proteins regardless of size freely diffuse through the nuclear pore complex without any requirement for active transport, signal sequences, or energy-dependent receptor-mediated mechanisms",
      "C": "The nuclear pore complex recognizes specific lipid modifications such as palmitoylation and myristoylation on the surface of proteins, using these hydrophobic anchors as the signal for nuclear import",
      "D": "Proteins bearing nuclear localization signals (NLS) are recognized by importin receptors, which mediate active transport through the NPC's FG-nucleoporin barrier via a RanGTP gradient"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.564319,
    "y": 0.198727,
    "z": 0.484488,
    "source_article": "nuclear transport",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "nuclear transport",
      "nuclear pore complex",
      "importins",
      "RanGTP cycle"
    ]
  },
  {
    "id": "c58af7a06ed125d2",
    "question_text": "Cells maintain membrane asymmetry, with phosphatidylserine (PS) normally confined to the inner leaflet. During apoptosis, PS appears on the outer leaflet. Why is this significant for tissue homeostasis?",
    "options": {
      "A": "Externalized PS acts as an 'eat me' signal recognized by phagocyte receptors, enabling rapid clearance of dying cells before they release inflammatory contents",
      "B": "Externalized PS triggers the complement cascade, leading to assembly of the membrane attack complex that lyses the apoptotic cell through pore formation in its plasma membrane",
      "C": "Externalized PS blocks growth factor receptors on neighboring cells, preventing their continued proliferation",
      "D": "PS exposure on the outer leaflet activates the coagulation cascade, forming a fibrin clot around the dying cell"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.547463,
    "y": 0.340558,
    "z": 0.545861,
    "source_article": "apoptosis",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "apoptosis",
      "phosphatidylserine exposure",
      "phagocytic clearance",
      "efferocytosis"
    ]
  },
  {
    "id": "173457c43a5c76b5",
    "question_text": "The mitochondrial membrane potential (ΔΨm) is critical for ATP synthesis. If an uncoupling agent (like FCCP) dissipates ΔΨm, what happens to oxygen consumption and ATP production?",
    "options": {
      "A": "Both oxygen consumption and ATP production increase proportionally because the uncoupler stimulates the entire oxidative phosphorylation system to work at a higher rate without disrupting the coupling between electron flow and ATP synthesis",
      "B": "Oxygen consumption increases but ATP production decreases, because electron transport continues (even accelerates) but proton flow bypasses ATP synthase",
      "C": "Both oxygen consumption and ATP production decrease because the uncoupler inhibits electron transport chain complexes, halting electron flow from NADH and FADH2 to oxygen",
      "D": "Oxygen consumption decreases while ATP production paradoxically increases"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.583291,
    "y": 0.432785,
    "z": 0.379801,
    "source_article": "mitochondrial uncoupling",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "mitochondrial uncoupling",
      "chemiosmotic coupling",
      "proton motive force",
      "electron transport chain regulation"
    ]
  },
  {
    "id": "95121a78ea7a7199",
    "question_text": "The unfolded protein response (UPR) is activated when misfolded proteins accumulate in the ER lumen. One branch involves the transmembrane kinase/endoribonuclease IRE1. What is IRE1's unique mechanism of action?",
    "options": {
      "A": "IRE1 phosphorylates the translation initiation factor eIF2α, which globally suppresses cap-dependent protein translation throughout the cell",
      "B": "IRE1 is a protease that directly cleaves the ER transmembrane protein ATF6, releasing its cytoplasmic transcription factor domain for nuclear import",
      "C": "IRE1 performs unconventional cytoplasmic splicing of XBP1 mRNA, removing an intron that shifts the reading frame to produce an active transcription factor",
      "D": "IRE1 directly ubiquitinates misfolded proteins in the ER lumen, tagging them for extraction and proteasomal degradation via the ERAD pathway"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.572077,
    "y": 0.357104,
    "z": 0.523923,
    "source_article": "unfolded protein response",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "unfolded protein response",
      "IRE1",
      "unconventional mRNA splicing",
      "XBP1"
    ]
  },
  {
    "id": "a4b8470105aad316",
    "question_text": "Cyclin-dependent kinases (CDKs) drive cell cycle progression, yet CDK protein levels remain relatively constant throughout the cell cycle. How is CDK activity regulated to produce the oscillations needed for orderly cell division?",
    "options": {
      "A": "CDK genes are transcriptionally activated only at specific cell cycle phases by phase-specific transcription factors, with each CDK gene being silenced by chromatin remodeling during the phases when it is not needed",
      "B": "CDKs are activated by binding to specific cell-cycle-regulated phosphatases that remove the inhibitory phosphorylation marks placed on CDK activation loops by constitutively active kinases that operate throughout all cell cycle phases",
      "C": "CDK activity is precisely controlled by dynamically shuttling CDK proteins between the nucleus and the cytoplasm at each specific phase of the cell cycle, with nuclear import signals being exposed or masked by phase-specific modifications",
      "D": "Cyclin partners are synthesized and degraded in phase-specific waves; CDK activity depends on which cyclin is present, combined with inhibitory phosphorylation (Wee1) and activating dephosphorylation (Cdc25)"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.564294,
    "y": 0.211738,
    "z": 0.72202,
    "source_article": "cell cycle regulation",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "cell cycle regulation",
      "cyclin-CDK complexes",
      "oscillatory control",
      "Wee1",
      "Cdc25"
    ]
  },
  {
    "id": "198323992adf6930",
    "question_text": "The mechanistic target of rapamycin complex 1 (mTORC1) integrates nutrient and growth factor signals to regulate cell growth. Through what molecular mechanism does amino acid availability specifically activate mTORC1?",
    "options": {
      "A": "Amino acids are sensed by Rag GTPases on the lysosomal surface, which recruit mTORC1 to the lysosome where it encounters its activator Rheb-GTP (itself controlled by growth factor signaling through TSC1/2)",
      "B": "Amino acids directly bind to the mTOR kinase domain active site, causing a conformational change that allosterically activates its catalytic activity",
      "C": "Amino acid transporters on the plasma membrane phosphorylate mTORC1 directly upon amino acid import into the cell",
      "D": "Amino acids inhibit AMPK, the AMP-activated protein kinase, which otherwise constitutively suppresses mTORC1 activity under all nutrient conditions; removing AMPK inhibition is the sole mechanism by which amino acid sufficiency activates mTORC1-dependent cell growth"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.566323,
    "y": 0.25492,
    "z": 0.642591,
    "source_article": "mTORC1 signaling",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "mTORC1 signaling",
      "Rag GTPases",
      "lysosomal nutrient sensing",
      "Rheb",
      "signal integration"
    ]
  },
  {
    "id": "fed5dbd55a652df2",
    "question_text": "Liquid-liquid phase separation (LLPS) has emerged as a mechanism for organizing biochemical reactions within cells without membrane-bound compartments. What biophysical property of intrinsically disordered protein regions (IDRs) enables them to drive LLPS?",
    "options": {
      "A": "IDRs fold into rigid β-barrel structures that physically exclude water molecules from their interior, creating a hydrophobic microenvironment that concentrates other proteins through non-specific hydrophobic interactions within the barrel cavity",
      "B": "Multivalent weak interactions (charge-charge, cation-π, π-π) among IDRs create a network of transient crosslinks that, above a threshold concentration, undergo demixing into a dense phase — analogous to polymer phase separation",
      "C": "IDRs contain cryptic transmembrane domains that spontaneously insert into and generate vesicle-like lipid bilayer structures when the local protein concentration exceeds a critical threshold in the cytoplasm",
      "D": "IDRs catalyze de novo phospholipid synthesis from cytoplasmic precursors, generating local membrane bilayers that spontaneously close into sealed vesicular structures enclosing the accumulated condensate proteins and their interaction partners within a membrane-bounded compartment"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.597035,
    "y": 0.073114,
    "z": 0.134247,
    "source_article": "phase separation",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "phase separation",
      "intrinsically disordered regions",
      "membraneless organelles",
      "multivalency",
      "polymer physics"
    ]
  },
  {
    "id": "4bc0fd9090b9667b",
    "question_text": "CRISPR-Cas9 achieves genome editing by creating targeted double-strand breaks. The cell then repairs these breaks. Why does non-homologous end joining (NHEJ) typically produce gene knockouts while homology-directed repair (HDR) can produce precise edits?",
    "options": {
      "A": "NHEJ is an error-free repair process that precisely removes exactly one codon at the break site without any additional insertions or deletions, while HDR introduces random DNA sequences at the break point from an unrelated genomic donor template that may or may not be homologous to the target sequence",
      "B": "NHEJ operates exclusively on mitochondrial DNA to repair oxidative damage caused by reactive oxygen species generated during electron transport, while HDR operates exclusively on nuclear DNA to repair replication-associated double-strand breaks during S phase",
      "C": "NHEJ directly ligates broken ends without a template, often introducing small insertions or deletions (indels) that cause frameshifts; HDR uses a homologous template (endogenous or supplied donor DNA) to copy sequence information precisely across the break",
      "D": "NHEJ requires a homologous donor DNA template but frequently introduces copying errors during the strand extension step, while HDR directly ligates broken DNA ends together without any template requirement, using only the endogenous DNA ligase IV enzyme complex"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.713412,
    "y": 0.32076,
    "z": 0.839287,
    "source_article": "DNA repair pathways",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "DNA repair pathways",
      "NHEJ vs HDR",
      "CRISPR mechanism",
      "frameshift mutations"
    ]
  },
  {
    "id": "600190c59e7f25a1",
    "question_text": "Chromatin immunoprecipitation followed by sequencing (ChIP-seq) is used to map protein-DNA interactions genome-wide. A critical limitation is that it captures a population average. How does single-cell CUT&Tag address this limitation, and what is its key technical advantage over ChIP-seq?",
    "options": {
      "A": "CUT&Tag uses long-read sequencing technology such as Oxford Nanopore instead of short-read Illumina sequencing, providing better genomic resolution without requiring additional cells or immunoprecipitation enrichment steps",
      "B": "CUT&Tag simply performs standard ChIP-seq on individual cells that have been pre-sorted by fluorescence-activated cell sorting, without any fundamental change to the immunoprecipitation-based chromatin enrichment protocol",
      "C": "CUT&Tag replaces the primary antibody with a synthetic DNA aptamer that binds chromatin targets with higher specificity, completely eliminating the need for immunoprecipitation-based enrichment of protein-DNA complexes",
      "D": "CUT&Tag uses a protein A-Tn5 transposase fusion that is directed to antibody-bound chromatin targets, where it inserts sequencing adapters directly at binding sites — this requires far fewer cells (even single cells) because there is no immunoprecipitation step and thus minimal material loss"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.68364,
    "y": 0.228389,
    "z": 0.737282,
    "source_article": "epigenomics",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "epigenomics",
      "CUT&Tag",
      "ChIP-seq limitations",
      "tagmentation",
      "single-cell epigenetics"
    ]
  },
  {
    "id": "ffd2de5bc8ca4864",
    "question_text": "The Warburg effect describes how many cancer cells preferentially use glycolysis over oxidative phosphorylation even in the presence of oxygen. This seems paradoxical because glycolysis produces far less ATP per glucose. What is the most compelling current explanation for why this metabolic shift benefits rapidly proliferating cells?",
    "options": {
      "A": "Glycolysis provides biosynthetic precursors (nucleotides, amino acids, lipids) through branching pathways (pentose phosphate pathway, serine biosynthesis) faster than oxidative metabolism can, supporting the high anabolic demand of rapid cell division",
      "B": "Cancer cells have extensively damaged mitochondria with disrupted cristae structure and cannot perform oxidative phosphorylation at all, forcing exclusive reliance on glycolysis as their only available energy source",
      "C": "Glycolysis produces ATP much faster per unit time than oxidative phosphorylation can, and cancer cells require rapid bursts of energy to fuel their continuous rounds of cell division and migration",
      "D": "The Warburg effect is entirely an artifact of standard in vitro cell culture conditions using high glucose media and atmospheric oxygen, and this metabolic pattern does not actually occur in tumors growing in vivo"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.599597,
    "y": 0.49,
    "z": 0.478478,
    "source_article": "Warburg effect",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "Warburg effect",
      "cancer metabolism",
      "anabolic metabolism",
      "metabolic reprogramming"
    ]
  },
  {
    "id": "a9084ecdafe644e4",
    "question_text": "Yamanaka factors (Oct4, Sox2, Klf4, c-Myc) can reprogram somatic cells into induced pluripotent stem cells (iPSCs). The process is extremely inefficient (~0.01-0.1%). What is the primary molecular barrier that makes reprogramming so rare?",
    "options": {
      "A": "Most cells lack the genes encoding Oct4 and Sox2 entirely because these pluripotency genes are physically deleted from the genome during somatic cell differentiation through a programmed DNA excision mechanism",
      "B": "Epigenetic barriers — somatic cells have stable, self-reinforcing chromatin states (DNA methylation, repressive histone marks like H3K9me3) at pluripotency loci that resist transcription factor access; only rare stochastic chromatin remodeling events permit factor binding and activation of the pluripotency network",
      "C": "The Yamanaka factors are directly cytotoxic to the vast majority of somatic cells, rapidly triggering apoptosis through p53-dependent and p53-independent pathways before the transcription factors can access and activate the endogenous pluripotency gene regulatory network; only the rare cells with unusually low p53 activity or high anti-apoptotic protein levels survive long enough to undergo successful reprogramming",
      "D": "Reprogramming absolutely requires active cell division to dilute existing epigenetic marks, and the vast majority of terminally differentiated somatic cells have permanently exited the cell cycle and are physically incapable of dividing again; since these postmitotic cells cannot undergo the requisite rounds of DNA replication needed to passively dilute repressive chromatin modifications, they remain inaccessible to the Yamanaka factors"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.665707,
    "y": 0.32699,
    "z": 0.857258,
    "source_article": "cellular reprogramming",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "cellular reprogramming",
      "epigenetic barriers",
      "chromatin accessibility",
      "pluripotency",
      "stochastic model"
    ]
  },
  {
    "id": "ccbf3a126f7b4759",
    "question_text": "Topologically associating domains (TADs) organize the genome into spatial compartments where sequences within a TAD interact more frequently than sequences in adjacent TADs. What is the current leading mechanistic model for how TADs are formed?",
    "options": {
      "A": "TADs form because DNA sequences within each domain share similar GC content, causing spontaneous phase separation of AT-rich and GC-rich regions into distinct nuclear compartments",
      "B": "Histones within each TAD are connected by disulfide bonds that physically tether the chromatin fiber together into a constrained looped configuration",
      "C": "Loop extrusion by cohesin: the cohesin complex threads chromatin through its ring structure, progressively enlarging loops until it encounters convergently oriented CTCF binding sites, which act as boundary elements that halt extrusion",
      "D": "TADs are purely artifacts of the Hi-C chromosome conformation capture technique and do not represent genuine three-dimensional genome organization within living cells; they emerge from systematic biases in proximity ligation, crosslinking efficiency, and restriction enzyme accessibility that create the false appearance of preferential intra-domain contacts"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.678593,
    "y": 0.108751,
    "z": 0.708809,
    "source_article": "3D genome organization",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "3D genome organization",
      "TADs",
      "loop extrusion",
      "cohesin",
      "CTCF"
    ]
  },
  {
    "id": "06668d5a01ce4c24",
    "question_text": "Ferroptosis is a recently characterized form of regulated cell death distinct from apoptosis and necroptosis. It is driven by iron-dependent lipid peroxidation. The enzyme GPX4 (glutathione peroxidase 4) is the primary defense against ferroptosis. Through what specific biochemical mechanism does GPX4 prevent ferroptotic death?",
    "options": {
      "A": "GPX4 chelates free intracellular iron ions through its selenocysteine active site, sequestering them away from membrane phospholipids and thereby preventing the Fenton chemistry reactions that generate the hydroxyl radicals responsible for initiating lipid peroxidation chain reactions",
      "B": "GPX4 functions as a specialized DNA repair enzyme that recognizes and excises oxidized nucleotide bases caused by iron-generated reactive oxygen species, thereby preventing the accumulation of oxidative DNA damage that would otherwise trigger the ferroptotic cell death program",
      "C": "GPX4 directly inhibits the enzyme ACSL4 through competitive binding to its active site, preventing the incorporation of polyunsaturated fatty acids into membrane phospholipids and thereby eliminating the substrate required for iron-dependent lipid peroxidation",
      "D": "GPX4 uses glutathione as a cofactor to reduce toxic lipid hydroperoxides (phospholipid-OOH) in membranes to non-toxic lipid alcohols (phospholipid-OH), directly breaking the chain reaction of lipid peroxidation"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.597989,
    "y": 0.472301,
    "z": 0.402043,
    "source_article": "ferroptosis",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "ferroptosis",
      "GPX4",
      "lipid peroxidation",
      "glutathione",
      "membrane integrity"
    ]
  },
  {
    "id": "243c515cf9d39d28",
    "question_text": "The endoplasmic reticulum (ER) and Golgi apparatus work together to process proteins. What is the functional significance of N-linked glycosylation that begins in the ER?",
    "options": {
      "A": "Glycosylation serves as a quality control tag — the specific sugar modifications added in the ER allow calnexin and calreticulin chaperones to monitor protein folding status, retaining misfolded proteins for additional folding attempts or targeting them for degradation",
      "B": "Glycosylation has absolutely no function and is a completely random chemical modification with no biological significance whatsoever — it serves no quality control purpose, provides no folding information, enables no chaperone recognition, and confers no targeting or sorting signal on any glycoprotein in any cellular compartment",
      "C": "Glycosylation serves only to increase the molecular weight of proteins for purely structural support purposes with absolutely no signaling role, no quality control function, no folding monitoring capability, and no involvement in the calnexin/calreticulin chaperone cycle that actually recognizes glucose-tagged glycoproteins in the ER",
      "D": "Glycosylation occurs only in prokaryotic cells and never in any eukaryotic cell type — it is a bacterial modification that is completely absent from the endoplasmic reticulum, Golgi apparatus, and secretory pathway of all eukaryotic organisms, contradicting the well-established eukaryotic N-linked glycosylation pathway"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.547704,
    "y": 0.212284,
    "z": 0.592458,
    "source_article": "N-linked glycosylation",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "N-linked glycosylation",
      "protein quality control",
      "calnexin cycle",
      "ER processing"
    ]
  },
  {
    "id": "b0d26a30e919ff62",
    "question_text": "Cells communicate through gap junctions. What property of gap junctions makes them fundamentally different from other cell-cell communication mechanisms like paracrine signaling?",
    "options": {
      "A": "Gap junctions only transmit bioluminescent light signals between cells using specialized fluorescent protein complexes embedded in the membrane — they have no capacity to transfer ions, metabolites, second messengers, or any small molecules between coupled cells",
      "B": "Gap junctions allow direct cytoplasmic continuity between adjacent cells through connexin hexamer channels, enabling small molecules (ions, second messengers, metabolites up to ~1 kDa) to pass directly without secretion into extracellular space",
      "C": "Gap junctions function only in plant cells and never in animal tissues",
      "D": "Gap junctions are permanent, non-regulatable structures that cannot be opened or closed"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.563829,
    "y": 0.1048,
    "z": 0.689789,
    "source_article": "gap junctions",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "gap junctions",
      "connexins",
      "direct cell communication",
      "electrical coupling"
    ]
  },
  {
    "id": "6b9b6378a65da4e5",
    "question_text": "The cytoskeleton comprises three major filament systems. What is the key structural difference between microtubules and actin filaments that determines their distinct mechanical properties?",
    "options": {
      "A": "Both are identical in structure — they are composed of exactly the same protein subunit arranged in the same geometry, with the same diameter, the same stiffness, and the same mechanical properties, making them completely interchangeable within the cell with no functional distinction between the two filament types whatsoever",
      "B": "Actin filaments are rigid hollow tubes composed of thirteen protofilaments while microtubules are thin flexible solid fibers only seven nanometers in diameter, which is the precise opposite of their actual structural and mechanical properties — this reversal confuses the stiff hollow microtubule with the flexible thin actin filament",
      "C": "Microtubules are hollow tubes of 13 protofilaments (25 nm diameter) providing rigidity for long-range transport and structural support, while actin filaments are thinner solid helical polymers (7 nm diameter) providing flexible networks for cell shape, motility, and cortical mechanics",
      "D": "Neither microtubules nor actin filaments are polymers — both are single continuous molecules with no subunit structure"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.558383,
    "y": 0.017181,
    "z": 0.624513,
    "source_article": "cytoskeleton",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "cytoskeleton",
      "microtubules",
      "actin filaments",
      "polymer structure"
    ]
  },
  {
    "id": "326fcede57aa2b43",
    "question_text": "The proteasome is the cell's primary protein degradation machine. Why does the proteasome require the target protein to be tagged with polyubiquitin chains rather than degrading proteins indiscriminately?",
    "options": {
      "A": "The proteasome actually does degrade all proteins completely indiscriminately with no selectivity mechanism whatsoever — it randomly destroys whatever proteins it encounters in the cytoplasm without requiring any ubiquitin tag, E3 ligase recognition, or targeting signal, which would result in the catastrophic loss of essential proteins that is never actually observed",
      "B": "Ubiquitin tagging is a purely cosmetic post-translational decoration that has absolutely no effect on whether a protein is degraded, retained, or stabilized — the ubiquitin molecule is merely an inert chemical modification with no recognition function, no signal capacity, and no connection to the proteasome's substrate selection mechanism",
      "C": "Polyubiquitin chains serve only to increase protein solubility in the cytoplasm by acting as a hydrophilic surface modification, with absolutely no connection to proteasomal degradation, no recognition by the 19S regulatory particle, and no role as a destruction signal — they function purely as solubility enhancers rather than as degradation tags",
      "D": "Ubiquitin tagging provides exquisite selectivity — the E1-E2-E3 enzyme cascade ensures only specific proteins (damaged, misfolded, or regulatory targets whose destruction is needed at a precise time) are marked for destruction, preventing catastrophic loss of essential proteins"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.543792,
    "y": 0.370629,
    "z": 0.489963,
    "source_article": "ubiquitin-proteasome system",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "ubiquitin-proteasome system",
      "protein degradation",
      "E3 ligase specificity",
      "regulated proteolysis"
    ]
  },
  {
    "id": "2f2615ed57ebed71",
    "question_text": "Vesicular transport between organelles requires coat proteins. What functional role do COPI, COPII, and clathrin coat complexes serve beyond simply shaping the vesicle membrane?",
    "options": {
      "A": "Coat proteins actively select cargo by binding sorting signals on cargo proteins, ensuring that each vesicle carries the correct molecular passengers to the correct destination — they function as both membrane-bending machinery and cargo-selective filters",
      "B": "Coat proteins have absolutely no cargo selectivity and merely form random spherical vesicles that transport whatever soluble and membrane proteins happen to be nearby at the moment of budding — they function purely as mechanical membrane-bending machines with no capacity to recognize sorting signals, select specific cargo, or determine vesicle destination",
      "C": "Coat proteins function only in bacterial cells and are completely absent from all eukaryotic intracellular vesicular transport pathways — they are prokaryotic proteins with no homologs, no functional equivalents, and no role in the secretory, endocytic, or lysosomal sorting pathways of any eukaryotic organism",
      "D": "Coat proteins serve only a decorative function and can be removed without affecting vesicle transport"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.530026,
    "y": 0.120293,
    "z": 0.60566,
    "source_article": "vesicular transport",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "vesicular transport",
      "coat proteins",
      "cargo selection",
      "sorting signals"
    ]
  },
  {
    "id": "8dd1ec24c0d985eb",
    "question_text": "The Notch signaling pathway is unusual among cell signaling mechanisms. What makes Notch activation mechanistically distinctive?",
    "options": {
      "A": "Notch is a conventional secreted hormone that diffuses freely through the bloodstream to distant target organs, requiring no direct cell-cell contact between signal-sending and signal-receiving cells — it functions identically to insulin or growth hormone in systemic endocrine signaling rather than requiring the juxtacrine contact mechanism that actually defines it",
      "B": "Notch requires direct cell-cell contact — binding of Delta/Jagged ligand on one cell to the Notch receptor on an adjacent cell triggers sequential proteolytic cleavages (ADAM metalloprotease then γ-secretase) that release the Notch intracellular domain, which translocates directly to the nucleus as a transcription factor",
      "C": "Notch signaling occurs entirely within a single cell with no requirement for ligand, receptor, or cell-cell interaction",
      "D": "Notch is activated by ultraviolet light rather than by any protein ligand"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.583211,
    "y": 0.169362,
    "z": 0.710749,
    "source_article": "Notch signaling",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "Notch signaling",
      "juxtacrine signaling",
      "regulated proteolysis",
      "γ-secretase"
    ]
  },
  {
    "id": "271b9eaba1ef4963",
    "question_text": "Mitochondria possess their own genome and ribosomes. Why do mitochondria still depend on the nuclear genome for most of their proteins?",
    "options": {
      "A": "Mitochondria are completely self-sufficient organelles that encode all of their own proteins using their own genome with absolutely no contribution from the nuclear genome — they require no protein import, no TOM/TIM translocase complexes, and no nuclear-encoded gene products, which contradicts the established fact that the vast majority of mitochondrial proteins are nuclear-encoded",
      "B": "Mitochondrial DNA does not actually encode any proteins whatsoever — it contains only non-coding regulatory sequences and repetitive elements with no open reading frames, no ribosomal RNA genes, no transfer RNA genes, and no protein-coding capacity of any kind, which contradicts the 13 polypeptides, 22 tRNAs, and 2 rRNAs actually encoded by human mtDNA",
      "C": "Over evolutionary time, most genes from the original endosymbiotic α-proteobacterial ancestor were transferred to the host nuclear genome — mitochondrial DNA now encodes only ~13 proteins (in humans), requiring import of ~1,500 nuclear-encoded proteins via TOM/TIM translocase complexes",
      "D": "Mitochondria do not contain any DNA and have no genome of their own — they are entirely dependent on nuclear gene expression for all components, with no endogenous genetic material, no mitochondrial ribosomes, and no organellar transcription or translation machinery, which contradicts the well-established endosymbiotic origin of mitochondrial DNA"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.638756,
    "y": 0.331666,
    "z": 0.802763,
    "source_article": "endosymbiotic theory",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "endosymbiotic theory",
      "mitochondrial genome",
      "protein import",
      "TOM/TIM complex"
    ]
  },
  {
    "id": "dbf20645330a5e5c",
    "question_text": "Apoptosis (programmed cell death) proceeds through intrinsic and extrinsic pathways. What is the critical irreversible commitment point in the intrinsic (mitochondrial) apoptotic pathway?",
    "options": {
      "A": "The binding of growth factors to their receptors on the cell surface is the critical irreversible commitment point in the intrinsic apoptotic pathway — this event alone is sufficient to trigger irreversible mitochondrial outer membrane permeabilization, which contradicts the fact that growth factor signaling actually promotes cell survival and suppresses rather than triggers apoptosis",
      "B": "Ribosome biogenesis in the nucleolus is the critical irreversible commitment point in the intrinsic apoptotic pathway — the assembly of new ribosomes directly triggers cytochrome c release from mitochondria, which makes no biological sense since ribosome biogenesis is a normal growth-associated process and not a stress signal or apoptotic trigger",
      "C": "DNA replication during S phase of the cell cycle is the critical irreversible commitment point in the intrinsic apoptotic pathway — every round of DNA synthesis automatically and inevitably triggers mitochondrial outer membrane permeabilization, which contradicts the fact that billions of cells replicate DNA without undergoing apoptosis",
      "D": "Mitochondrial outer membrane permeabilization (MOMP) — when pro-apoptotic BAX/BAK oligomerize to form pores in the outer mitochondrial membrane, releasing cytochrome c into the cytoplasm, triggering apoptosome assembly and caspase activation in a process that cannot be reversed"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.55504,
    "y": 0.374356,
    "z": 0.66871,
    "source_article": "apoptosis",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "apoptosis",
      "MOMP",
      "BAX/BAK",
      "cytochrome c release"
    ]
  },
  {
    "id": "3b51f84903381590",
    "question_text": "Integrin receptors mediate cell adhesion to the extracellular matrix (ECM). What distinguishes integrins from simple 'molecular glue'?",
    "options": {
      "A": "Integrins are bidirectional signaling receptors — 'outside-in' signaling transduces ECM binding into intracellular signals (activating FAK, Src, Rho GTPases), while 'inside-out' signaling allows intracellular events to modulate integrin affinity for ECM ligands, making them dynamic regulators of adhesion, migration, and survival",
      "B": "Integrins function only as passive adhesion molecules that mechanically attach cells to the extracellular matrix with absolutely no signaling capability — they cannot transmit information across the membrane, cannot activate intracellular kinases, cannot connect to the actin cytoskeleton through adaptor proteins, and have no bidirectional signaling capacity whatsoever",
      "C": "Integrins function only inside the nucleus as transcription factors with no role at the cell surface",
      "D": "Integrins are found only in plant cells and do not exist in any animal tissues — they are plant-specific cell wall adhesion molecules with no counterpart in mammalian cell biology, and the focal adhesions, integrin-linked signaling cascades, and mechanotransduction pathways described in animal cells involve entirely different receptor families"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.602076,
    "y": 0.01,
    "z": 0.520184,
    "source_article": "integrins",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "integrins",
      "bidirectional signaling",
      "focal adhesions",
      "mechanotransduction"
    ]
  },
  {
    "id": "80242e919e7773fc",
    "question_text": "Epigenetic modifications regulate gene expression without altering DNA sequence. What mechanistic principle distinguishes DNA methylation at CpG islands from histone acetylation in their effects on transcription?",
    "options": {
      "A": "Both DNA methylation and histone acetylation have exactly identical mechanistic effects on gene expression with absolutely no functional difference — they operate through the same molecular mechanisms, target the same genomic sites, and produce equivalent transcriptional outcomes, making them completely redundant and interchangeable epigenetic modifications with no unique regulatory logic",
      "B": "CpG methylation (by DNMTs) recruits methyl-binding proteins that attract repressive complexes, establishing stable long-term silencing (X-inactivation, imprinting), while histone acetylation (by HATs) neutralizes positive histone charges to open chromatin structure, enabling more dynamic and reversible transcriptional activation",
      "C": "DNA methylation at CpG islands is only found in bacteria and never occurs in eukaryotic cells",
      "D": "Histone acetylation permanently and irreversibly destroys histone proteins, physically removing them from chromatin entirely and degrading them through the proteasome — once acetylated, histones can never be restored, making histone acetylation a permanent one-way modification completely unlike the rapid and reversible regulation actually mediated by histone acetyltransferases and deacetylases"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.710939,
    "y": 0.232476,
    "z": 0.711706,
    "source_article": "epigenetics",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "epigenetics",
      "DNA methylation",
      "histone acetylation",
      "chromatin regulation"
    ]
  },
  {
    "id": "8055097b0c71c9e5",
    "question_text": "The Hippo signaling pathway regulates organ size. What happens when the Hippo pathway kinase cascade (MST1/2→LATS1/2) is active?",
    "options": {
      "A": "The Hippo pathway promotes unlimited cell growth with absolutely no size control mechanism — when the pathway's kinase cascade is active, it stimulates maximal cell proliferation, organ overgrowth, and unrestrained tissue expansion, which is the exact opposite of its actual tumor-suppressive function of restraining growth by phosphorylating and inactivating YAP/TAZ",
      "B": "The Hippo pathway functions only in insects and has no mammalian counterpart",
      "C": "Active LATS1/2 phosphorylates YAP/TAZ, causing their cytoplasmic retention and degradation — preventing these transcriptional co-activators from entering the nucleus and driving proliferation and survival gene expression, thereby restraining organ growth",
      "D": "Active Hippo signaling promotes cell division by directly activating cyclin D transcription"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.574398,
    "y": 0.223672,
    "z": 0.695536,
    "source_article": "Hippo pathway",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "Hippo pathway",
      "YAP/TAZ",
      "organ size control",
      "tumor suppression"
    ]
  },
  {
    "id": "54fb6e2d9b26ae54",
    "question_text": "Clathrin-mediated endocytosis requires dynamin GTPase activity. What is dynamin's specific mechanical function in vesicle formation?",
    "options": {
      "A": "Dynamin transports vesicles along microtubules like kinesin, functioning as a long-distance motor protein that walks processively along the microtubule lattice rather than participating in vesicle budding, membrane constriction, or the scission of nascent vesicles from the plasma membrane",
      "B": "Dynamin serves only as a structural scaffold with absolutely no enzymatic activity, no GTPase function, and no membrane-severing capability — it is a passive structural protein that merely stabilizes the vesicle neck without any capacity to generate mechanical force for membrane constriction or scission",
      "C": "Dynamin is a nuclear transcription factor that regulates gene expression but has no role at the plasma membrane",
      "D": "Dynamin assembles as a helical collar around the neck of the budding vesicle and uses GTP hydrolysis to constrict and sever the membrane, releasing the vesicle from the plasma membrane — functioning as a molecular 'pinchase'"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.536219,
    "y": 0.09111,
    "z": 0.560541,
    "source_article": "dynamin",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "dynamin",
      "endocytosis",
      "membrane scission",
      "GTPase mechanoenzyme"
    ]
  },
  {
    "id": "9d504febf3016a0d",
    "question_text": "Telomeres protect chromosome ends from degradation and fusion. Why does the 'end replication problem' cause telomere shortening with each cell division?",
    "options": {
      "A": "DNA polymerase can synthesize DNA only in the 5'→3' direction and requires an RNA primer — when the terminal primer is removed from the lagging strand, the resulting gap cannot be filled because there is no upstream sequence to provide a 3'-OH for extension, leading to progressive shortening",
      "B": "Telomeres shorten because nucleases specifically target and destroy telomeric DNA after each division",
      "C": "Telomeres do not actually shorten — they remain constant length throughout an organism's lifetime",
      "D": "Telomere shortening is caused by exposure to sunlight rather than by any replication mechanism"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.633813,
    "y": 0.261641,
    "z": 0.865433,
    "source_article": "end replication problem",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "end replication problem",
      "telomere shortening",
      "lagging strand",
      "Okazaki fragments"
    ]
  },
  {
    "id": "fb5f1f5f7c5c8d58",
    "question_text": "The p53 tumor suppressor is called the 'guardian of the genome.' Why is p53 the most frequently mutated gene in human cancers?",
    "options": {
      "A": "p53 has absolutely no role in cancer biology and is rarely if ever mutated in human tumors — it functions exclusively as a housekeeping metabolic enzyme with no connection to cell cycle control, DNA damage response, apoptosis, or tumor suppression, and its mutation has no consequences for cell proliferation or genomic integrity",
      "B": "p53 responds to DNA damage, oncogene activation, and other stress signals by inducing cell cycle arrest (p21), DNA repair, or apoptosis — its inactivation removes the critical checkpoint that prevents damaged cells from proliferating, allowing accumulation of further oncogenic mutations",
      "C": "p53 promotes tumor growth when functioning normally, so mutations that inactivate it actually prevent cancer",
      "D": "p53 mutations are found only in benign, non-cancerous tissues and never in malignant tumors"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.638628,
    "y": 0.441951,
    "z": 0.814592,
    "source_article": "p53",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "p53",
      "tumor suppression",
      "DNA damage response",
      "cell cycle checkpoint"
    ]
  },
  {
    "id": "a6fb7f1d2d6082d1",
    "question_text": "Macroautophagy involves the formation of double-membrane autophagosomes. What molecular machinery initiates autophagosome formation, and what is its origin?",
    "options": {
      "A": "Autophagosomes form completely spontaneously from free lipids floating in the cytoplasm without any protein machinery, enzymatic activity, or membrane source — no ULK1 initiation, no PI3K nucleation, no ATG conjugation system, and no phagophore expansion mechanism is required for their assembly, contradicting the elaborate multi-step biogenesis that actually occurs",
      "B": "Autophagosomes are pre-formed organelles that exist constitutively in every cell and do not need to be synthesized de novo — they are permanent residents of the cytoplasm like mitochondria or the endoplasmic reticulum, waiting passively to engulf cargo without requiring any signal-dependent biogenesis, membrane nucleation, or expansion process",
      "C": "The ULK1 complex initiates a PI3K class III (VPS34) complex to generate PI3P on ER membranes, recruiting WIPI proteins and the ATG conjugation systems (ATG12-ATG5-ATG16L1 and LC3-PE) that expand the isolation membrane (phagophore) — the ER-mitochondria contact site (MAM) is a key membrane source",
      "D": "Autophagy occurs only in yeast cells and has no counterpart in mammalian biology"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.514859,
    "y": 0.244881,
    "z": 0.709473,
    "source_article": "autophagy",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "autophagy",
      "ULK1",
      "phagophore",
      "LC3 conjugation"
    ]
  },
  {
    "id": "495eae76250d0a0f",
    "question_text": "Single-molecule fluorescence microscopy reveals that many transcription factors bind DNA in transient 'bursts.' What does this stochastic binding behavior imply about gene regulation?",
    "options": {
      "A": "Transcription factors bind DNA permanently and never dissociate once bound",
      "B": "Transcription factors never actually contact DNA at any point in gene regulation — they regulate gene expression exclusively through protein-protein interactions that occur entirely in the cytoplasm, without entering the nucleus, without binding promoter or enhancer sequences, and without any direct physical interaction with chromatin or regulatory DNA elements",
      "C": "Stochastic binding has no effect on gene expression, which is perfectly deterministic at all levels",
      "D": "Gene expression is inherently noisy at the single-cell level — stochastic bursting of transcription factor binding produces pulsatile mRNA synthesis, creating cell-to-cell variability in protein levels even among genetically identical cells in the same environment, with important consequences for cell fate decisions"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.697353,
    "y": 0.06537,
    "z": 0.383767,
    "source_article": "transcriptional bursting",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "transcriptional bursting",
      "gene expression noise",
      "stochastic regulation",
      "single-molecule imaging"
    ]
  },
  {
    "id": "e26c04222c6e4475",
    "question_text": "The unfolded protein response (UPR) has three branches (IRE1, PERK, ATF6). If persistent ER stress overwhelms the adaptive UPR, what determines the switch from protective to apoptotic signaling?",
    "options": {
      "A": "Sustained PERK activation drives apoptosis through CHOP (C/EBP homologous protein), which transcriptionally activates pro-apoptotic genes (BIM, DR5) and suppresses anti-apoptotic BCL-2 — the duration and intensity of PERK-eIF2α-ATF4-CHOP axis activation determines whether the cell adapts or dies",
      "B": "The UPR never triggers apoptosis under any circumstances — it is exclusively a survival pathway",
      "C": "The switch from adaptive UPR signaling to apoptotic signaling is a completely random stochastic event that has absolutely no molecular determinant, no signaling pathway logic, and no dose- or time-dependent mechanism — cells under persistent ER stress die or survive based on pure chance with no predictable relationship to the duration or intensity of the stress",
      "D": "Only the ATF6 branch can trigger apoptosis, while IRE1 and PERK have no role in cell death"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.582793,
    "y": 0.32236,
    "z": 0.547397,
    "source_article": "UPR",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "UPR",
      "CHOP",
      "ER stress-induced apoptosis",
      "PERK-ATF4-CHOP axis"
    ]
  },
  {
    "id": "7624377f91058689",
    "question_text": "Cajal bodies are nuclear suborganelles involved in RNA processing. What is their primary function, and how does it relate to spliceosome assembly?",
    "options": {
      "A": "Cajal bodies function only in protein degradation and have no role in RNA processing or spliceosome biology",
      "B": "Cajal bodies are sites of snRNP maturation — small nuclear RNAs (snRNAs) undergo guided modification (2'-O-methylation and pseudouridylation by scaRNAs/guide RNAs) and assembly with Sm proteins in Cajal bodies before being incorporated into functional spliceosomes",
      "C": "Cajal bodies are found only in plant cells and do not exist in animal cell nuclei",
      "D": "Cajal bodies are mitochondrial structures involved in oxidative phosphorylation rather than nuclear RNA processing"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.599891,
    "y": 0.187649,
    "z": 1.0,
    "source_article": "Cajal bodies",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "Cajal bodies",
      "snRNP maturation",
      "scaRNAs",
      "spliceosome assembly"
    ]
  },
  {
    "id": "9f85b0afc317338e",
    "question_text": "R-loops are three-stranded nucleic acid structures consisting of an RNA-DNA hybrid and a displaced single-stranded DNA. Why have R-loops become a major focus of genome instability research?",
    "options": {
      "A": "R-loops are exclusively beneficial structures that never cause any problems for cells under any circumstances — they stabilize the genome, protect against mutations, prevent replication fork stalling, and enhance chromosomal integrity in all cellular contexts, which contradicts the substantial evidence linking persistent R-loops to DNA damage, replication stress, and chromosomal rearrangements",
      "B": "R-loops exist only in cell-free experimental systems such as test tubes and in vitro reconstitution assays, and they never form inside living cells under any physiological or pathological conditions — they are purely artifactual structures with no biological relevance, which contradicts extensive in vivo mapping of R-loops using DRIP-seq, S9.6 immunofluorescence, and other genome-wide methods",
      "C": "R-loops expose single-stranded DNA that is vulnerable to mutagenic deamination, oxidative damage, and nuclease attack — persistent R-loops at actively transcribed loci can cause replication fork collisions, double-strand breaks, and chromosomal rearrangements, linking transcription directly to genome instability",
      "D": "R-loops are protein aggregates with absolutely no nucleic acid component — they contain no RNA, no DNA, no RNA-DNA hybrids, and no displaced single-stranded DNA, consisting entirely of misfolded protein deposits similar to amyloid fibrils, which contradicts the defining biochemical composition of an R-loop as a three-stranded nucleic acid structure"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.690997,
    "y": 0.202924,
    "z": 0.593872,
    "source_article": "R-loops",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "R-loops",
      "genome instability",
      "transcription-replication conflict",
      "DNA damage"
    ]
  },
  {
    "id": "6ad6021d3d8d3434",
    "question_text": "The spindle assembly checkpoint (SAC) prevents premature anaphase entry. What molecular event satisfies the checkpoint and triggers anaphase?",
    "options": {
      "A": "Anaphase is triggered by external growth factor signaling rather than by any intracellular checkpoint mechanism",
      "B": "Anaphase begins at a fixed time after nuclear envelope breakdown regardless of chromosome attachment status",
      "C": "The checkpoint is satisfied by a random timer that has no relationship to kinetochore-microtubule attachments",
      "D": "The checkpoint is satisfied when every kinetochore achieves stable bipolar attachment to spindle microtubules — the last unattached kinetochore generates MAD1/MAD2 'wait' signal; once all kinetochores are attached and under tension, the mitotic checkpoint complex (MCC) is no longer produced, APC/C-CDC20 is activated, and securin/cyclin B are ubiquitinated for destruction"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.54167,
    "y": 0.221893,
    "z": 0.77633,
    "source_article": "spindle assembly checkpoint",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "spindle assembly checkpoint",
      "kinetochore",
      "APC/C",
      "anaphase trigger"
    ]
  },
  {
    "id": "948825d953f399ae",
    "question_text": "Phase separation drives formation of stress granules in the cytoplasm. What determines which mRNAs and proteins are recruited to stress granules versus processing bodies (P-bodies)?",
    "options": {
      "A": "Stress granules accumulate stalled translation pre-initiation complexes (40S subunits, eIF4G, PABP, stalled mRNAs), while P-bodies are enriched in mRNA decay machinery (DCP1/2, XRN1, LSM complexes) — the distinction reflects whether an mRNA is being stored for potential re-entry into translation or targeted for degradation",
      "B": "Stress granules and P-bodies contain completely identical molecular components with absolutely no compositional difference whatsoever — they have the same RNA-binding proteins, the same mRNA populations, the same enzymatic activities, and the same functional roles in mRNA metabolism, making them redundant and interchangeable cytoplasmic structures with no distinct biological identity",
      "C": "Stress granules form only in the nucleus while P-bodies form only in the mitochondrial matrix — neither structure is found in the cytoplasm where they have actually been extensively characterized by immunofluorescence, live-cell imaging, and proteomics, making this localization claim inconsistent with decades of cell biological observations",
      "D": "Neither stress granules nor P-bodies contains any RNA whatsoever — both are purely protein aggregates composed entirely of misfolded polypeptides with no mRNA, no ribosomal subunits, no RNA-binding proteins, and no connection to mRNA metabolism, which contradicts their well-established roles in mRNA storage, triage, and degradation"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.615618,
    "y": 0.211438,
    "z": 0.663166,
    "source_article": "stress granules",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "stress granules",
      "P-bodies",
      "mRNA fate",
      "phase separation"
    ]
  },
  {
    "id": "7230073baca1391b",
    "question_text": "CRISPR-based epigenome editing (e.g., dCas9-p300 or dCas9-KRAB) differs fundamentally from traditional CRISPR-Cas9 gene editing. What is the conceptual advance?",
    "options": {
      "A": "Both CRISPR-Cas9 gene editing and dCas9-based epigenome editing are entirely identical approaches — there is absolutely no difference between cutting genomic DNA to create permanent sequence changes and modifying epigenetic marks to reversibly alter gene expression without DNA cleavage, making the distinction between the two approaches meaningless and the development of dCas9 fusions unnecessary",
      "B": "Epigenome editing uses catalytically dead Cas9 (dCas9) fused to chromatin-modifying domains to alter gene expression at specific loci without cutting DNA — enabling reversible, graded transcriptional modulation rather than permanent irreversible sequence changes, and avoiding double-strand break repair complications",
      "C": "Epigenome editing requires making much larger and more extensive DNA cuts than standard CRISPR-Cas9 genome editing, and it is substantially more mutagenic — dCas9-based tools create massive deletions and chromosomal rearrangements at far higher rates than nuclease-active Cas9, which is the precise opposite of their actual advantage of avoiding DNA breaks entirely",
      "D": "CRISPR-based epigenome editing can only silence genes through CRISPRi approaches and has absolutely no ability to activate transcription — there are no dCas9-activator fusions, no CRISPRa systems, and no transcriptional activation domains that can be recruited to genomic loci, which contradicts the widely used VP64, p65, Rta, and VPR activation systems"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.74,
    "y": 0.313833,
    "z": 0.790658,
    "source_article": "epigenome editing",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "epigenome editing",
      "dCas9",
      "CRISPRa/CRISPRi",
      "reversible gene regulation"
    ]
  },
  {
    "id": "9ad42e74d48e84a3",
    "question_text": "Condensin and cohesin are both members of the SMC (structural maintenance of chromosomes) protein family, yet they have opposing effects on chromosome organization. What distinguishes their roles?",
    "options": {
      "A": "Condensin and cohesin have identical functions and are completely interchangeable",
      "B": "Neither protein has any effect on chromosome structure — both function only as metabolic enzymes",
      "C": "Cohesin holds sister chromatids together after DNA replication (mediating cohesion via ring-shaped topological embrace) and also organizes interphase chromatin into loops/TADs, while condensin compacts individual chromatid arms during mitosis through loop extrusion — cohesion connects chromosomes, condensation compresses them",
      "D": "Cohesin functions only in meiosis and condensin functions only in interphase, with neither playing any role in mitotic chromosome segregation"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.603959,
    "y": 0.033827,
    "z": 0.903955,
    "source_article": "SMC complexes",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "SMC complexes",
      "cohesin",
      "condensin",
      "chromosome organization"
    ]
  },
  {
    "id": "30a8c2927096f55f",
    "question_text": "Lipid rafts are cholesterol- and sphingolipid-enriched membrane microdomains. Why is their biological significance debated?",
    "options": {
      "A": "There is absolutely no debate about lipid rafts — they are universally accepted by all membrane biologists as large, stable, easily visualized structures that can be directly observed as micrometer-scale permanent domains in any conventional fluorescence microscope image of any living cell, and no serious scientist has ever questioned their existence, their size, their lifetime, or their functional significance in cell signaling",
      "B": "Lipid rafts are clearly visible as permanent, micrometer-scale structures in all electron microscopy images of every cell type examined — they appear as distinct, sharply bounded membrane patches that persist indefinitely and can be photographed, measured, and cataloged with routine imaging techniques, contradicting the actual difficulty of visualizing these nanoscale, transient, and controversially defined membrane microdomains",
      "C": "Lipid rafts exist only in artificial lipid bilayers and have been definitively proven to be absent from all biological membranes",
      "D": "The debate centers on their size, lifetime, and even existence in living cells — while detergent-resistant membranes and biophysical studies support ordered lipid domains, the rafts are nanoscale (~10-200 nm) and transient (milliseconds), making direct visualization in intact cells extremely difficult and raising questions about their functional relevance"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.622365,
    "y": 0.018059,
    "z": 0.22822,
    "source_article": "lipid rafts",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "lipid rafts",
      "membrane microdomains",
      "liquid-ordered phase",
      "membrane heterogeneity"
    ]
  },
  {
    "id": "99edf952176113c6",
    "question_text": "Pioneer transcription factors have a unique ability that distinguishes them from conventional transcription factors. What is this ability?",
    "options": {
      "A": "Pioneer factors can access and bind their target DNA sequences within compacted, nucleosome-occupied chromatin — displacing or remodeling nucleosomes to create accessible regions that allow subsequent binding of conventional transcription factors, effectively 'opening' closed chromatin",
      "B": "Pioneer factors function only in prokaryotic cells that lack chromatin structure",
      "C": "Pioneer factors are identical to all other transcription factors with no special chromatin-accessing ability",
      "D": "Pioneer factors bind only to promoters that are already fully open and accessible, requiring other factors to open chromatin first"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.663179,
    "y": 0.178418,
    "z": 0.74835,
    "source_article": "pioneer factors",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "pioneer factors",
      "chromatin accessibility",
      "nucleosome displacement",
      "transcriptional competence"
    ]
  },
  {
    "id": "5682e0c4a28e526e",
    "question_text": "The Hedgehog (Hh) signaling pathway uses an unusual mechanism involving the primary cilium in vertebrate cells. What role does the primary cilium play in Hh signal transduction?",
    "options": {
      "A": "The primary cilium has absolutely no role in Hedgehog signaling and is entirely irrelevant to the pathway's activation, signal transduction, or transcriptional output — it functions exclusively as a vestigial evolutionary remnant with no signaling capability, and its removal has no effect on Hedgehog pathway activity or GLI transcription factor processing in any vertebrate cell type",
      "B": "The primary cilium serves as a dedicated signaling organelle — in the absence of Hh ligand, Patched (PTCH1) localizes to the cilium and prevents Smoothened (SMO) entry; upon Hh binding to PTCH1, SMO accumulates in the cilium and activates GLI transcription factors, which are processed at the ciliary tip from repressor to activator forms",
      "C": "The primary cilium functions only in locomotion and plays no role in cell signaling of any kind",
      "D": "Hedgehog signaling occurs exclusively in invertebrates and has no counterpart in vertebrate biology"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.535474,
    "y": 0.156178,
    "z": 0.768116,
    "source_article": "Hedgehog pathway",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "Hedgehog pathway",
      "primary cilium",
      "Smoothened",
      "GLI processing"
    ]
  },
  {
    "id": "528c63c08c490cd8",
    "question_text": "The concept of 'kinetic proofreading' explains how biological systems achieve higher specificity than equilibrium binding alone would predict. How does the ribosome use this principle during translation?",
    "options": {
      "A": "The ribosome relies solely on thermodynamic binding affinity between the codon and anticodon, with absolutely no energy-dependent enhancement of selectivity — there is no GTP hydrolysis step, no kinetic checkpoint, and no time-dependent discrimination mechanism during aminoacyl-tRNA selection, making translation accuracy entirely dependent on the base-pairing free energy difference alone",
      "B": "Kinetic proofreading is a theoretical concept that has never been demonstrated experimentally in any biological system",
      "C": "After initial codon-anticodon recognition, GTP hydrolysis by EF-Tu introduces an irreversible step that creates a time delay — near-cognate (incorrect) tRNAs, which bind more weakly, are more likely to dissociate during this delay than cognate tRNAs, amplifying selectivity beyond what binding affinity alone could achieve",
      "D": "The ribosome does not perform translation — it functions only as a structural scaffold with no catalytic activity"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.660386,
    "y": 0.322402,
    "z": 0.0,
    "source_article": "kinetic proofreading",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "kinetic proofreading",
      "translation fidelity",
      "EF-Tu",
      "Hopfield mechanism"
    ]
  },
  {
    "id": "a41101b623ed9df7",
    "question_text": "The nuclear lamina (lamin A/C and B-type lamins) provides structural support to the nucleus. What happens when lamin A is mutated, and why does this cause disease?",
    "options": {
      "A": "Lamin mutations have no effect on cell function and are completely benign",
      "B": "Lamin A is a cytoplasmic enzyme involved in sugar metabolism with no structural or nuclear function",
      "C": "Lamin mutations affect only plant cells and have no relevance to human disease",
      "D": "Lamin A mutations cause laminopathies — a remarkable spectrum of diseases (progeria, muscular dystrophy, cardiomyopathy, lipodystrophy) because the nuclear lamina is essential for nuclear mechanical integrity, chromatin organization, gene expression regulation, and DNA damage repair, and different mutations disrupt different subsets of these functions in tissue-specific ways"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.634426,
    "y": 0.25638,
    "z": 0.791827,
    "source_article": "nuclear lamina",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "nuclear lamina",
      "laminopathies",
      "progeria",
      "nuclear mechanics"
    ]
  },
  {
    "id": "18f4cf21025b21f5",
    "question_text": "Optogenetics has been adapted for cell biology (optogenetic control of signaling). What makes light-inducible dimerization systems (e.g., CRY2-CIB1, iLID) powerful tools for studying signal transduction?",
    "options": {
      "A": "They enable activation of specific signaling pathways with subcellular spatial precision and millisecond temporal resolution — a researcher can activate Ras, Rho GTPases, or PI3K at a defined membrane location and time, then observe the downstream response in real time, achieving a level of spatiotemporal control impossible with diffusible chemical agonists",
      "B": "Light-inducible systems have no advantage over chemical activators and provide no improvement in temporal or spatial control",
      "C": "Light-inducible systems function only in plant cells and cannot be used in animal cells",
      "D": "Optogenetic tools are used only in neuroscience for controlling neuronal firing and have no applications in cell biology or signal transduction research"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.624634,
    "y": 0.089432,
    "z": 0.494718,
    "source_article": "optogenetics",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "optogenetics",
      "light-inducible dimerization",
      "spatiotemporal control",
      "signal transduction tools"
    ]
  },
  {
    "id": "b566eea3e98bea8c",
    "question_text": "Lysosomes are acidic organelles responsible for intracellular degradation. What maintains their low internal pH (~4.5-5.0), and why is this acidity essential for lysosomal function?",
    "options": {
      "A": "Lysosomes maintain neutral pH (7.0) identical to the cytoplasm with no acidification mechanism",
      "B": "V-type H+-ATPase proton pumps in the lysosomal membrane actively transport H+ ions into the lumen using ATP hydrolysis — the resulting acidic environment is essential because lysosomal hydrolases (proteases, lipases, nucleases, glycosidases) have optimal catalytic activity only at low pH and are largely inactive at cytoplasmic pH, providing a safety mechanism against leakage",
      "C": "Lysosomal acidity is generated by photosynthesis occurring within the lysosome",
      "D": "Lysosomes are alkaline organelles with pH above 9.0 and contain no acid hydrolases"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.531083,
    "y": 0.37713,
    "z": 0.595236,
    "source_article": "lysosomes",
    "domain_ids": [
      "molecular-cell-biology",
      "biology"
    ],
    "concepts_tested": [
      "lysosomes",
      "V-ATPase",
      "pH-dependent hydrolases",
      "organelle acidification"
    ]
  }
]