[
  {
    "id": "28c39233e68ded92",
    "question_text": "Neurons communicate at synapses by releasing chemical neurotransmitters. What triggers the release of neurotransmitter from the presynaptic terminal?",
    "options": {
      "A": "An action potential arriving at the presynaptic terminal opens voltage-gated calcium channels — the resulting influx of Ca²⁺ ions causes synaptic vesicles to fuse with the presynaptic membrane and release their contents into the synaptic cleft",
      "B": "The electrical signal of the action potential directly crosses the synaptic cleft and depolarizes the postsynaptic cell without any chemical intermediary",
      "C": "Neurotransmitters are continuously released at a constant rate regardless of neural activity, and the action potential temporarily halts this ongoing release",
      "D": "The postsynaptic cell sends a chemical signal (a retrograde messenger such as endocannabinoids or nitric oxide) backward across the synaptic cleft that binds to receptors on the presynaptic terminal, triggering the release of neurotransmitter-filled vesicles from the presynaptic membrane into the cleft — this retrograde signaling mechanism is the primary trigger for normal synaptic transmission"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.448366,
    "y": 0.830762,
    "z": 0.301164,
    "source_article": "synaptic transmission",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "synaptic transmission",
      "calcium signaling",
      "vesicle fusion",
      "exocytosis",
      "voltage-gated calcium channel"
    ]
  },
  {
    "id": "9918f85c4624af83",
    "question_text": "The myelin sheath wraps around axons and dramatically increases the speed of action potential propagation. How does myelination achieve this?",
    "options": {
      "A": "Myelin increases the effective diameter of the axon by adding concentric layers of lipid membrane around the nerve fiber, which increases the cross-sectional area available for internal current flow and reduces the longitudinal resistance to ion movement — larger-diameter fibers conduct action potentials faster according to cable theory, so myelination works primarily by mimicking the effect of a thicker axon",
      "B": "Myelin acts as an electrical insulator that prevents ion leakage across the membrane, forcing the action potential to 'jump' between gaps in the myelin (nodes of Ranvier) where ion channels are concentrated — this saltatory conduction is much faster than continuous propagation",
      "C": "Myelin directly generates electrical current through piezoelectric properties of its lipid layers that push the action potential along the axon faster",
      "D": "Myelin increases the number and density of voltage-gated sodium and potassium ion channels distributed along the entire length of the axon, rather than concentrating them at nodes — this uniform high channel density allows faster depolarization and repolarization at every point along the membrane, increasing the maximum conduction velocity achievable by the axon"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.416255,
    "y": 0.736804,
    "z": 0.766038,
    "source_article": "myelin sheath",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "myelin sheath",
      "saltatory conduction",
      "nodes of Ranvier",
      "action potential propagation"
    ]
  },
  {
    "id": "3b14be20e5edddba",
    "question_text": "Long-term potentiation (LTP) at hippocampal synapses is considered a cellular mechanism of learning and memory. What makes LTP 'long-term' rather than a transient change?",
    "options": {
      "A": "LTP lasts only as long as the stimulus is being applied — it decays immediately when stimulation stops",
      "B": "LTP is simply an increase in the amount of neurotransmitter released, which runs out after a few minutes",
      "C": "The persistent strengthening of LTP requires new protein synthesis and structural changes at the synapse — including insertion of additional AMPA receptors into the postsynaptic membrane and growth of new dendritic spines — that physically remodel the connection",
      "D": "LTP persists because the presynaptic neuron fires at a permanently higher rate after induction"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.49062,
    "y": 0.977023,
    "z": 0.316828,
    "source_article": "long-term potentiation",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "long-term potentiation",
      "synaptic plasticity",
      "AMPA receptor",
      "protein synthesis",
      "dendritic spine"
    ]
  },
  {
    "id": "d320567ff7c7e73c",
    "question_text": "The blood-brain barrier (BBB) restricts which substances can enter the brain from the bloodstream. What structural feature is primarily responsible for this barrier function?",
    "options": {
      "A": "The skull physically blocks molecules from reaching the brain by acting as an impermeable bone barrier that prevents any substances in the bloodstream from contacting neural tissue — molecules must be actively transported through microscopic pores in the skull to reach the brain parenchyma, and these pores are selectively permeable to nutrients but block toxins and pathogens",
      "B": "Brain capillaries have unusually large pores (fenestrations) between their endothelial cells that passively filter out harmful substances based purely on molecular size, allowing only small molecules through while blocking larger proteins and pathogens — this size-exclusion filtration is the structural basis of the blood-brain barrier",
      "C": "Neurons secrete a chemical shield composed of specialized glycoproteins and mucopolysaccharides that surrounds each neuron individually, creating a protective barrier that repels foreign molecules and prevents them from contacting the neural membrane — this pericellular chemical shield is the primary mechanism of the blood-brain barrier",
      "D": "Brain capillary endothelial cells are connected by tight junctions that prevent paracellular diffusion, forcing most molecules to cross through the cells themselves — only small lipophilic molecules or those with specific transporters can pass"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.455516,
    "y": 0.51,
    "z": 0.576372,
    "source_article": "blood-brain barrier",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "blood-brain barrier",
      "tight junction",
      "endothelial cell",
      "paracellular transport"
    ]
  },
  {
    "id": "4f6bb9eafc233511",
    "question_text": "The resting membrane potential of a typical neuron is approximately $-70$ mV. What primarily establishes and maintains this negative potential?",
    "options": {
      "A": "The selective permeability of the resting membrane to K⁺ ions (through leak channels) combined with the K⁺ concentration gradient (high inside, low outside) drives K⁺ outward, leaving the interior relatively negative — the Na⁺/K⁺-ATPase maintains the concentration gradients over time",
      "B": "Chloride ions accumulate inside the neuron through active Cl⁻ transport, creating a net negative intracellular charge",
      "C": "The sodium-potassium pump directly generates the $-70$ mV resting potential through its electrogenic activity, pumping 3 Na⁺ ions out of the cell for every 2 K⁺ ions pumped in — this net export of one positive charge per pump cycle creates the transmembrane voltage difference, and inhibiting the pump with ouabain immediately collapses the membrane potential to zero",
      "D": "Negatively charged DNA and RNA molecules inside the cell create the resting potential through their electrostatic effects on nearby ions"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.420162,
    "y": 0.753824,
    "z": 0.681648,
    "source_article": "resting membrane potential",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "resting membrane potential",
      "Nernst equation",
      "potassium leak channels",
      "Na/K-ATPase",
      "Goldman equation"
    ]
  },
  {
    "id": "9146014e26258f53",
    "question_text": "Parkinson's disease involves the progressive loss of dopaminergic neurons in the substantia nigra pars compacta. Why does this specific cell loss produce the characteristic motor symptoms (tremor, rigidity, bradykinesia)?",
    "options": {
      "A": "Dopamine directly contracts skeletal muscles in the limbs by binding to dopamine receptors on muscle fibers and triggering calcium release from the sarcoplasmic reticulum — loss of dopaminergic neurons therefore weakens muscles directly, explaining the bradykinesia and rigidity of Parkinson's disease as a peripheral neuromuscular deficit rather than a central nervous system disorder",
      "B": "Loss of dopaminergic input to the striatum disrupts the balance between the direct (movement-facilitating) and indirect (movement-inhibiting) pathways of the basal ganglia — the resulting excessive inhibition of the thalamus by the globus pallidus interna suppresses voluntary movement initiation",
      "C": "Dopamine neurons in the substantia nigra project directly to spinal cord motor neurons via a nigroспinal pathway, and their loss physically disconnects the brain from the muscles of the limbs and trunk",
      "D": "The substantia nigra produces acetylcholine rather than dopamine, and this cholinergic output is sent directly to the motor cortex where it activates upper motor neurons — degeneration of substantia nigra neurons eliminates the cortical cholinergic drive for voluntary movement, explaining why Parkinson's patients have difficulty initiating and executing motor commands"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.488422,
    "y": 0.697209,
    "z": 0.042007,
    "source_article": "Parkinson's disease",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "Parkinson's disease",
      "basal ganglia",
      "direct and indirect pathways",
      "dopamine",
      "substantia nigra"
    ]
  },
  {
    "id": "050f26da287a5268",
    "question_text": "Functional MRI (fMRI) is widely used to study brain activity. What does the BOLD signal actually measure?",
    "options": {
      "A": "Direct electrical activity of individual neurons firing action potentials",
      "B": "The concentration of neurotransmitters released at synapses",
      "C": "Changes in the ratio of oxygenated to deoxygenated hemoglobin in local blood vessels — neural activity increases local blood flow and oxygen delivery beyond what is consumed, creating a detectable change in the magnetic properties of nearby blood",
      "D": "The structural anatomy of brain tissue, which changes shape when neurons are active"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.516425,
    "y": 0.68212,
    "z": 0.300643,
    "source_article": "fMRI",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "fMRI",
      "BOLD signal",
      "hemodynamic response",
      "neurovascular coupling",
      "deoxyhemoglobin"
    ]
  },
  {
    "id": "b173eebffac29cee",
    "question_text": "Hebbian learning is summarized as 'neurons that fire together wire together.' What is the precise synaptic mechanism that implements this principle at excitatory synapses?",
    "options": {
      "A": "When two neurons fire simultaneously, new axonal branches physically grow between them within minutes through rapid cytoskeletal remodeling — growth cones emerge from the presynaptic neuron's axon, extend across the neuropil, and form new synaptic contacts with the postsynaptic neuron, establishing permanent structural connections that encode the learned association",
      "B": "Neurons that fire together release a special 'wiring hormone' — a secreted neurotrophin discovered in 2015 — that permanently fuses their plasma membranes at the synaptic contact into a continuous cytoplasmic bridge (a gap junction), converting the chemical synapse into an electrical synapse with zero transmission delay",
      "C": "Simultaneous firing has no lasting effect on synaptic transmission strength — synaptic weights are determined entirely by the organism's genome during early development and remain fixed throughout adult life, which is why learning is restricted to a brief critical period in early childhood",
      "D": "The NMDA receptor acts as a coincidence detector — it opens only when the postsynaptic membrane is depolarized (relieving the Mg²⁺ block) AND glutamate is bound (presynaptic activity), allowing Ca²⁺ influx that triggers intracellular signaling cascades leading to synaptic strengthening"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.482528,
    "y": 0.975385,
    "z": 0.401096,
    "source_article": "Hebbian learning",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "Hebbian learning",
      "NMDA receptor",
      "coincidence detection",
      "synaptic plasticity",
      "magnesium block"
    ]
  },
  {
    "id": "c6229c8dbd1d4f21",
    "question_text": "Place cells in the hippocampus fire when an animal occupies a specific location in its environment. What computational role do these cells play in spatial navigation?",
    "options": {
      "A": "Place cells provide an allocentric (world-centered) cognitive map of the environment — each cell's firing represents a specific location, and the population activity collectively encodes the animal's position, enabling spatial memory and navigation",
      "B": "Place cells directly control leg muscles and locomotor pattern generators to guide the animal's movement through physical space — each place cell's firing drives specific motor neurons that adjust stride length and direction to navigate toward the cell's preferred location, functioning as a sensorimotor controller rather than a cognitive spatial representation",
      "C": "Place cells detect specific visual patterns in the environment (such as landmarks and boundary features) and have no genuine role in abstract spatial representation or cognitive mapping",
      "D": "Place cells simply respond to the animal's running speed with no spatial selectivity, encoding only locomotor velocity"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.564159,
    "y": 0.756477,
    "z": 0.711761,
    "source_article": "place cells",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "place cells",
      "cognitive map",
      "hippocampus",
      "spatial navigation",
      "allocentric representation"
    ]
  },
  {
    "id": "77cbe6ed01d41d93",
    "question_text": "Selective serotonin reuptake inhibitors (SSRIs) like fluoxetine increase synaptic serotonin levels within hours, yet their antidepressant effects take 2-4 weeks to emerge. What is the leading explanation for this therapeutic delay?",
    "options": {
      "A": "SSRIs must physically accumulate in brain tissue for several weeks before reaching pharmacologically effective concentrations — the drug molecules slowly partition from the bloodstream into the lipid-rich brain parenchyma, and the rate-limiting step is passive diffusion across the blood-brain barrier, which requires weeks of daily dosing to establish a sufficient brain tissue reservoir",
      "B": "The therapeutic effect requires downstream adaptive changes — including desensitization of inhibitory serotonin autoreceptors (5-HT1A), increased BDNF expression, enhanced neurogenesis in the hippocampus, and synaptic remodeling — that take weeks to develop",
      "C": "Serotonin is synthesized very slowly from its amino acid precursor tryptophan, so it takes weeks for synaptic serotonin levels to increase meaningfully",
      "D": "The liver must convert the inactive SSRI prodrug into its pharmacologically active metabolite through cytochrome P450-mediated enzymatic oxidation, and this hepatic biotransformation process takes several weeks to reach steady-state levels of the active compound in the systemic circulation — the therapeutic delay reflects the slow kinetics of hepatic enzyme induction"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.487906,
    "y": 0.889504,
    "z": 0.239713,
    "source_article": "SSRI mechanism",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "SSRI mechanism",
      "serotonin autoreceptors",
      "neuroplasticity",
      "BDNF",
      "antidepressant lag"
    ]
  },
  {
    "id": "88a70715f4ebe794",
    "question_text": "The visual cortex is organized into a hierarchy of areas (V1, V2, V4, IT). What fundamental principle describes how visual features are represented as signals move up this hierarchy?",
    "options": {
      "A": "Higher areas process faster temporal signals while lower areas handle slow changes",
      "B": "Each area processes an independent, non-overlapping portion of the visual field",
      "C": "Neurons in progressively higher areas respond to increasingly complex and abstract features — V1 neurons respond to oriented edges, V2 to contours and textures, V4 to shapes and color, and inferotemporal cortex (IT) to whole objects and faces — with receptive fields that grow larger at each stage",
      "D": "All visual areas process identical features in parallel, with higher areas simply having faster neurons"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.551747,
    "y": 0.754626,
    "z": 0.515992,
    "source_article": "visual cortex hierarchy",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "visual cortex hierarchy",
      "receptive field",
      "feature complexity",
      "ventral visual stream"
    ]
  },
  {
    "id": "393c3007f0da950f",
    "question_text": "During neural development, axons navigate over long distances to reach their correct targets. What guides a growth cone to its destination?",
    "options": {
      "A": "Axons grow randomly in all possible directions without any molecular guidance, and only those that happen to reach the correct synaptic target by stochastic exploration survive — the vast majority of randomly growing axons fail to reach appropriate targets and are eliminated through programmed cell death (apoptosis), making axon guidance an entirely probabilistic process of growth-and-selection",
      "B": "The growth cone is pulled mechanically toward its target by physical tension in the surrounding extracellular matrix and tissue substrate — collagen fibers and fibronectin networks create oriented tension lines that the growth cone follows through mechanotransduction, with no involvement of chemical signaling molecules or receptor-mediated guidance",
      "C": "Electrical current flows continuously from the target tissue to the neuronal cell body through the extracellular space, creating a voltage gradient that the growing axon follows through a process called galvanotropism — the growth cone senses the electric field through asymmetric ion channel activation and turns toward the cathode",
      "D": "Growth cones navigate using a combination of attractive and repulsive molecular cues — both contact-dependent (laminins, ephrins) and diffusible chemotactic gradients (netrins, semaphorins, Slits) — that steer the growth cone by rearranging its cytoskeleton through Rho GTPase signaling"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.455346,
    "y": 0.771143,
    "z": 0.61299,
    "source_article": "axon guidance",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "axon guidance",
      "growth cone",
      "netrin",
      "semaphorin",
      "chemotaxis",
      "Rho GTPases"
    ]
  },
  {
    "id": "8bfb5a41b0e3e9a3",
    "question_text": "Mirror neurons, originally discovered in macaque premotor cortex (area F5), fire both when an animal performs an action and when it observes the same action performed by another. What is the most rigorously supported interpretation of their functional role?",
    "options": {
      "A": "Mirror neurons enable action understanding by mapping observed actions onto the observer's own motor representations — they provide a neural substrate for recognizing the goals and intentions behind others' actions through motor simulation",
      "B": "Mirror neurons are the sole neural basis of empathy, language acquisition, and consciousness — damage to the mirror neuron system in premotor cortex completely eliminates all forms of social cognition, including theory of mind, emotional recognition, language comprehension, and imitative learning, because these higher cognitive functions depend entirely on motor simulation via mirror neurons",
      "C": "Mirror neurons are an artifact of electrode placement during single-unit recording experiments and do not actually respond during action observation",
      "D": "Mirror neurons control imitative behavior exclusively and have no role in action understanding or social cognition"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.539985,
    "y": 0.771073,
    "z": 0.345903,
    "source_article": "mirror neurons",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "mirror neurons",
      "action understanding",
      "motor simulation",
      "premotor cortex",
      "social cognition"
    ]
  },
  {
    "id": "b796502d01561d2e",
    "question_text": "Optogenetics allows researchers to activate or silence specific neuron types with millisecond precision using light. What makes this technique so much more powerful than traditional electrical stimulation for establishing causal relationships between neural activity and behavior?",
    "options": {
      "A": "Optogenetics uses much brighter light than electrical stimulation uses current, and this intense light penetrates deeper into brain tissue than electrical current can travel — the improved depth of penetration allows optogenetics to reach neurons in deep brain structures that electrical stimulation cannot access, and the brightness of the light provides more consistent and reliable activation of neurons regardless of their distance from the light source, making it superior for deep brain structure experiments",
      "B": "Optogenetics can target genetically defined cell types — by expressing light-sensitive opsins (e.g., channelrhodopsin for excitation, halorhodopsin for inhibition) only in specific cell populations using cell-type-specific promoters, researchers can activate or silence one neuron type while leaving neighboring cells of other types unaffected",
      "C": "Optogenetics works by heating brain tissue with focused laser light, which increases neural firing rates nonspecifically through thermal activation of ion channels",
      "D": "Optogenetics measures neural activity with unprecedented temporal resolution rather than manipulating it — light-sensitive proteins fluoresce in proportion to membrane voltage changes, making optogenetics an improved recording technique that has replaced traditional electrophysiology for measuring action potentials and synaptic currents in genetically defined cell populations in vivo"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.486849,
    "y": 0.867842,
    "z": 0.739875,
    "source_article": "optogenetics",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "optogenetics",
      "channelrhodopsin",
      "cell-type specificity",
      "causal neuroscience",
      "Cre-lox system"
    ]
  },
  {
    "id": "ec82e5ffc967886f",
    "question_text": "Working memory — the ability to hold and manipulate information over short delays — was traditionally attributed solely to persistent neural firing during the delay period. What has recent evidence revealed about the underlying mechanism?",
    "options": {
      "A": "Working memory is stored entirely in the hippocampus, not in prefrontal cortex — the hippocampal formation maintains short-term memory traces through persistent activity in CA1 pyramidal neurons, and prefrontal cortex damage has no effect on working memory span or manipulation, as demonstrated by the intact performance of prefrontal lesion patients on delayed response tasks",
      "B": "Persistent firing of prefrontal cortex neurons during the delay period fully and completely accounts for all aspects of working memory, and no other neural mechanism is needed or has been discovered — the idea of 'activity-silent' storage mechanisms is purely theoretical speculation that has never been supported by experimental evidence from electrophysiology or imaging studies",
      "C": "Information can be maintained in 'activity-silent' states through short-term synaptic plasticity — temporary changes in synaptic weights store information without sustained firing and can be reactivated by a probe stimulus, complementing the traditional persistent-activity model",
      "D": "Working memory is maintained by continuous high-frequency oscillatory coupling between the left and right cerebral hemispheres through the corpus callosum — information is passed back and forth between homologous cortical areas at approximately 40 Hz (gamma rhythm), and each transfer cycle refreshes the memory trace, preventing it from decaying"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.545067,
    "y": 0.830647,
    "z": 0.27906,
    "source_article": "working memory",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "working memory",
      "persistent activity",
      "activity-silent memory",
      "short-term synaptic plasticity",
      "prefrontal cortex"
    ]
  },
  {
    "id": "9f5dc0fe4e85ef70",
    "question_text": "The default mode network (DMN) — including medial prefrontal cortex, posterior cingulate, and angular gyrus — is more active during rest than during externally focused tasks. What is the current understanding of the DMN's function?",
    "options": {
      "A": "The DMN represents brain regions that are 'idle' during rest and serve no cognitive purpose — they are simply wasting energy",
      "B": "The DMN is exclusively responsible for processing visual information during daydreaming",
      "C": "The DMN processes only emotional information and has no role in cognition",
      "D": "The DMN supports internally directed cognition — including self-referential thought, autobiographical memory retrieval, mental simulation of future scenarios, and theory of mind — and its abnormal connectivity is implicated in disorders including Alzheimer's disease, depression, and autism spectrum disorder"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.554319,
    "y": 0.759103,
    "z": 0.135934,
    "source_article": "default mode network",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "default mode network",
      "resting state",
      "self-referential processing",
      "functional connectivity",
      "mind wandering"
    ]
  },
  {
    "id": "bf8792efa2949be7",
    "question_text": "Spike-timing-dependent plasticity (STDP) refines the Hebbian rule by incorporating the precise temporal order of pre- and postsynaptic spikes. What is the key timing-dependence?",
    "options": {
      "A": "If the presynaptic spike consistently precedes the postsynaptic spike by milliseconds (pre-before-post), the synapse is strengthened (LTP); if the order is reversed (post-before-pre), the synapse is weakened (LTD) — this asymmetric window enforces causal, predictive learning",
      "B": "The exact timing of spikes doesn't matter — any correlated firing produces identical synaptic strengthening regardless of order",
      "C": "Both pre-before-post and post-before-pre pairings produce synaptic strengthening, just at different magnitudes",
      "D": "Spike timing has no effect on synaptic strength; plasticity depends only on average firing rates over seconds"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.516022,
    "y": 0.99,
    "z": 0.452422,
    "source_article": "spike-timing-dependent plasticity",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "spike-timing-dependent plasticity",
      "STDP",
      "temporal coding",
      "synaptic plasticity",
      "causal learning"
    ]
  },
  {
    "id": "c435e430fc0d9db7",
    "question_text": "Classical models treated dendrites as passive cables that linearly sum synaptic inputs. What discovery about dendritic processing fundamentally changed our understanding of single-neuron computation?",
    "options": {
      "A": "Dendrites were found to have no voltage-gated ion channels of any type, confirming that they function as purely passive cable structures that propagate synaptic potentials decrementally toward the soma — the absence of dendritic channels means that all nonlinear signal processing occurs exclusively at the axon initial segment and soma, and dendrites serve only as passive conduits that attenuate signals according to the cable equation's length constant and time constant",
      "B": "Dendrites generate local regenerative events — dendritic spikes mediated by voltage-gated Na⁺, Ca²⁺, and NMDA receptor channels — that enable nonlinear integration of synaptic inputs, effectively making individual dendritic branches function as semi-independent computational subunits capable of local thresholding, coincidence detection, and input-specific plasticity",
      "C": "Dendrites function primarily as long-term memory storage devices by permanently trapping neurotransmitter molecules in their spine heads",
      "D": "Dendritic computation involving active voltage-gated channels occurs only in invertebrate neurons such as those in the stomatogastric ganglion of crustaceans and has never been observed in any mammalian neuron — all mammalian dendrites are strictly passive structures, and claims of active dendritic processing in mammals are based on misinterpretation of calcium imaging artifacts caused by indicator dye compartmentalization"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.526443,
    "y": 0.893036,
    "z": 0.670336,
    "source_article": "dendritic computation",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "dendritic computation",
      "dendritic spike",
      "nonlinear integration",
      "NMDA spike",
      "compartmental model"
    ]
  },
  {
    "id": "1f41f25a16d3acec",
    "question_text": "Predictive coding theory proposes that the brain constantly generates predictions about incoming sensory input. What is the core computational principle of this framework?",
    "options": {
      "A": "The brain passively receives and processes all sensory information in a purely bottom-up fashion without any top-down modulation or prediction",
      "B": "Higher cortical areas store fixed perceptual templates — complete, static representations of objects, faces, and scenes — that are matched against incoming stimuli through a rigid template-matching procedure, where the best-matching template determines the percept, and no learning or updating of templates occurs after the critical period of early development closes",
      "C": "Higher cortical areas send top-down predictions to lower areas, which compute prediction errors (the mismatch between predicted and actual input) — only these error signals propagate upward, and learning consists of updating the internal model to minimize prediction error across the hierarchy",
      "D": "The brain predicts only motor outcomes, not sensory inputs — predictive coding applies exclusively to the motor system and has no role in perception"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.558677,
    "y": 0.759089,
    "z": 0.629544,
    "source_article": "predictive coding",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "predictive coding",
      "prediction error",
      "hierarchical inference",
      "top-down processing",
      "Bayesian brain"
    ]
  },
  {
    "id": "d2a9da050aa92608",
    "question_text": "Grid cells in the medial entorhinal cortex fire in a remarkable hexagonal pattern as an animal moves through space. What computational advantage does this hexagonal lattice provide for spatial representation?",
    "options": {
      "A": "The hexagonal firing pattern of grid cells is simply an artifact of the animal's typical running trajectory in a rectangular testing enclosure — when the animal runs in straight lines parallel to the walls and makes 90-degree turns at corners, the resulting path creates a sampling bias that produces hexagonal-looking spatial autocorrelation patterns in the firing rate map, even though the underlying neural representation has no genuine spatial structure",
      "B": "Grid cells fire exclusively at the physical boundaries and walls of an environment rather than in a periodic spatial pattern throughout the open space — the apparent hexagonal firing pattern is a misinterpretation of boundary-related activity that appears periodic only because standard experimental arenas have straight walls arranged in regular geometric shapes, and testing in irregularly shaped environments reveals that grid cell firing is confined to boundary-adjacent locations",
      "C": "Hexagonal grid patterns encode running speed information through their spatial frequency rather than position — faster running speeds produce finer hexagonal grids (smaller spacing between firing fields) while slower speeds produce coarser grids, and the grid pattern itself carries no information about the animal's current location in the environment",
      "D": "A hexagonal lattice is the most efficient periodic tiling of 2D space — it maximizes spatial resolution per neuron by providing the densest uniform coverage with the fewest cells, and the multiple spatial scales of grid cells across dorsoventral MEC form a multi-scale code that can uniquely encode vast environments with a compact neural population"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.581818,
    "y": 0.750553,
    "z": 1.0,
    "source_article": "grid cells",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "grid cells",
      "hexagonal lattice",
      "entorhinal cortex",
      "spatial coding",
      "efficient coding"
    ]
  },
  {
    "id": "b95d60a116542f30",
    "question_text": "A neuron at rest maintains a resting membrane potential of approximately −70 mV. Which mechanism is primarily responsible for establishing this electrical gradient?",
    "options": {
      "A": "The Na⁺/K⁺-ATPase pump and selective potassium leak channels — the pump creates unequal ion distributions (more K⁺ inside, more Na⁺ outside), and potassium leak channels allow K⁺ to flow outward down its concentration gradient, leaving behind a net negative charge inside the cell",
      "B": "Chloride ions flowing freely in both directions across the membrane until equilibrium is reached, creating an even distribution of charge that settles at approximately −70 mV purely through passive chloride redistribution across the neuronal plasma membrane without active transport involvement",
      "C": "Voltage-gated sodium channels that remain partially open at rest, allowing a steady inward sodium current that is balanced by an equal and opposite outward current through calcium-activated potassium channels, establishing a dynamic equilibrium at the resting potential of approximately −70 millivolts",
      "D": "The mitochondria inside the neuron generate a strong negative charge from electron transport chain activity in the inner mitochondrial membrane, and this intracellular negativity radiates outward through the cytoplasm to establish the membrane potential difference across the plasma membrane"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.41042,
    "y": 0.738357,
    "z": 0.690331,
    "source_article": "resting membrane potential",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "resting membrane potential",
      "Na/K-ATPase",
      "potassium leak channels"
    ]
  },
  {
    "id": "464181da7a3e14c1",
    "question_text": "During an action potential, sodium channels open and sodium ions rush into the neuron, causing depolarization. What mechanism terminates this depolarization and initiates repolarization?",
    "options": {
      "A": "The Na⁺/K⁺-ATPase pump immediately activates at maximum capacity to remove all the sodium ions that entered during depolarization, restoring the resting potential within the same millisecond time frame as the action potential itself",
      "B": "Sodium channel inactivation (the inactivation gate closes) combined with delayed opening of voltage-gated potassium channels, which allow K⁺ efflux that drives the membrane potential back toward the potassium equilibrium potential",
      "C": "Calcium ions enter through NMDA receptors and activate calcium-dependent enzymes that physically destroy the sodium channels in the membrane, requiring new channels to be synthesized before the next action potential can occur",
      "D": "The myelin sheath absorbs the excess positive charge from sodium influx and transfers it to the extracellular space through specialized gap junctions in the paranodal regions"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.41,
    "y": 0.792109,
    "z": 0.489139,
    "source_article": "action potential",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "action potential",
      "sodium channel inactivation",
      "repolarization"
    ]
  },
  {
    "id": "362136eaf6827031",
    "question_text": "Broca's area (left inferior frontal gyrus) and Wernicke's area (left posterior superior temporal gyrus) are both involved in language processing. A patient can comprehend speech perfectly but produces halting, effortful speech with poor grammar. Which area is most likely damaged?",
    "options": {
      "A": "Wernicke's area, because damage there always produces effortful speech by disrupting the auditory feedback loop that controls the motor output of articulation in the frontal cortex through a backward projection from temporal to frontal regions",
      "B": "Both areas are simultaneously damaged, since any language deficit necessarily involves disruption to the entire perisylvian language network rather than individual components operating independently of each other",
      "C": "Broca's area — damage here produces non-fluent (Broca's) aphasia characterized by effortful speech with preserved comprehension, because this region is critical for speech production and grammatical processing",
      "D": "The primary auditory cortex in Heschl's gyrus, which controls both speech comprehension and production timing through its role as the master clock that synchronizes all language processing"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.535731,
    "y": 0.658571,
    "z": 0.164194,
    "source_article": "Broca's aphasia",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "Broca's aphasia",
      "language areas",
      "speech production"
    ]
  },
  {
    "id": "64fb71d2e30915e9",
    "question_text": "Myelin sheaths dramatically increase the speed of action potential propagation along axons. What is the biophysical mechanism by which myelin achieves this speedup?",
    "options": {
      "A": "Myelin increases the axon's diameter tenfold by physically swelling the surrounding membrane layers, and larger-diameter axons conduct faster due to lower internal resistance — the speed increase is entirely a consequence of this diameter effect rather than the myelin's electrical properties",
      "B": "Myelin amplifies the action potential signal by actively pumping ions at each myelin segment, boosting signal strength so it can travel farther before needing regeneration at the next node of Ranvier — each segment acts as a biological amplifier",
      "C": "Myelin chemically converts the action potential from an electrical signal to a chemical diffusion process that travels through the multilayered lipid wrapping faster than ionic currents travel through the axon's aqueous cytoplasm",
      "D": "Myelin acts as an electrical insulator that prevents ion leakage across the membrane, forcing the depolarizing current to jump between nodes of Ranvier (saltatory conduction), which is far faster than continuous propagation"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.414798,
    "y": 0.749391,
    "z": 0.800417,
    "source_article": "myelination",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "myelination",
      "saltatory conduction",
      "nerve conduction velocity"
    ]
  },
  {
    "id": "d5a52678ad54f072",
    "question_text": "The hippocampus is critical for forming new declarative memories. Patient H.M. had bilateral hippocampal removal and could no longer form new explicit memories, yet he could still learn new motor skills. What does this dissociation demonstrate?",
    "options": {
      "A": "There are distinct memory systems — declarative (explicit) memory depends on the hippocampus, while procedural (implicit) memory relies on different brain structures such as the basal ganglia and cerebellum",
      "B": "Memory is a single unified system, and H.M.'s motor learning was actually a residual fragment of his hippocampal function that survived the surgery because the excision was incomplete in the posterior regions",
      "C": "Motor skills do not actually involve memory storage at all — they are reflexive behaviors controlled entirely by the spinal cord that require no encoding or consolidation in any brain structure",
      "D": "The hippocampus only stores memories for the first 24 hours and then transfers them to the cortex, so H.M. could still learn anything that took more than one day of practice because it bypassed hippocampal processing entirely"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.546001,
    "y": 0.78291,
    "z": 0.171964,
    "source_article": "memory systems",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "memory systems",
      "hippocampus",
      "procedural vs declarative memory"
    ]
  },
  {
    "id": "cbf297988748bb4f",
    "question_text": "Neurotransmitter release at a synapse requires calcium influx into the presynaptic terminal. Why is calcium specifically required for this process?",
    "options": {
      "A": "Calcium has no specific role — any divalent cation (Mg²⁺, Zn²⁺, Ba²⁺) can substitute for Ca²⁺ with equal effectiveness because the mechanism only requires a positive charge to neutralize the negative charge on synaptic vesicle membranes",
      "B": "Ca²⁺ binds to synaptotagmin on synaptic vesicles, triggering a conformational change that promotes vesicle fusion with the presynaptic membrane through interaction with the SNARE complex, enabling neurotransmitter exocytosis",
      "C": "Calcium dissolves the vesicle membrane by acting as a detergent, releasing the neurotransmitter contents into the synaptic cleft through membrane lysis rather than fusion",
      "D": "Calcium activates the Na⁺/K⁺-ATPase pump which reverses direction to pump neurotransmitters out of vesicles and across the presynaptic membrane into the cleft"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.433547,
    "y": 0.862047,
    "z": 0.313991,
    "source_article": "calcium signaling",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "calcium signaling",
      "synaptic vesicle fusion",
      "synaptotagmin",
      "SNARE complex"
    ]
  },
  {
    "id": "990c11024e842929",
    "question_text": "Long-term potentiation (LTP) at hippocampal CA3-CA1 synapses requires activation of NMDA receptors. Why don't NMDA receptors respond to glutamate alone under normal resting conditions?",
    "options": {
      "A": "NMDA receptors are not glutamate receptors at all — they are activated exclusively by the synthetic compound N-methyl-D-aspartate and only respond to endogenous glutamate when artificially modified in laboratory conditions using site-directed mutagenesis to alter their ligand-binding domain structure and specificity",
      "B": "Glutamate degrades far too rapidly in the synaptic cleft to ever reach NMDA receptors, being enzymatically destroyed within microseconds by the enzyme acetylcholinesterase before it can diffuse across the full width of the synaptic cleft to reach the postsynaptic density where NMDA receptors are concentrated",
      "C": "At resting membrane potential, a Mg²⁺ ion blocks the NMDA receptor channel pore — the postsynaptic membrane must first be depolarized (typically by AMPA receptor activation) to expel the Mg²⁺ block, allowing ion flow through the NMDA channel only when both glutamate binding and depolarization coincide",
      "D": "NMDA receptors require prior phosphorylation by protein kinase C before they are able to bind glutamate, and this particular kinase is only active during sleep states when cortical cholinergic tone is at its minimum value, which explains why LTP consolidation occurs predominantly during non-REM slow-wave sleep"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.473684,
    "y": 0.930327,
    "z": 0.290084,
    "source_article": "NMDA receptor",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "NMDA receptor",
      "magnesium block",
      "coincidence detection",
      "LTP"
    ]
  },
  {
    "id": "910883901df4ba4c",
    "question_text": "The blood-brain barrier (BBB) restricts the passage of most molecules from blood into brain tissue. A new drug is designed to treat a brain tumor, but it's a large hydrophilic molecule. What is the primary obstacle it faces at the BBB?",
    "options": {
      "A": "Brain capillary endothelial cells have tight junctions that eliminate paracellular transport, and without specific carrier-mediated or receptor-mediated transport mechanisms, large hydrophilic molecules cannot cross the lipid bilayer of the endothelial cells to enter the brain parenchyma",
      "B": "The skull bone is impermeable to hydrophilic molecules, creating the actual physical barrier rather than the vasculature — drugs must be injected directly through the skull to reach brain tissue because the cranial bone constitutes the true blood-brain barrier",
      "C": "The BBB only blocks molecules during waking hours but opens completely during sleep to allow metabolic waste clearance through the glymphatic system, so the drug should simply be administered at bedtime for unrestricted brain access through the dormant barrier",
      "D": "Brain capillary endothelial cells have tight junctions that eliminate paracellular transport, and without specific carrier-mediated or receptor-mediated transport, large hydrophilic molecules cannot cross the lipid bilayer of the endothelial cells"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.461847,
    "y": 0.511274,
    "z": 0.49897,
    "source_article": "blood-brain barrier",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "blood-brain barrier",
      "tight junctions",
      "drug delivery"
    ]
  },
  {
    "id": "9557290f74706e78",
    "question_text": "A patient suffers a stroke affecting the right primary motor cortex. Which body parts will be paralyzed, and why?",
    "options": {
      "A": "The left side of the body, because motor cortex axons cross the midline (decussate) at the medullary pyramids in the brainstem, so the right cortex controls left-sided movement through contralateral innervation",
      "B": "The right side of the body, because each hemisphere controls the same side through uncrossed corticospinal projections",
      "C": "Both sides of the body are paralyzed equally, because the motor cortex sends bilateral projections to both sides of the spinal cord through a system of commissural fibers that ensures redundant motor control of all limbs from each hemisphere",
      "D": "Only the right hand and right foot are affected, because the primary motor cortex exclusively controls fine distal movements of the ipsilateral extremities while proximal and axial muscles are controlled by brainstem motor nuclei that are resistant to cortical stroke damage"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.512197,
    "y": 0.651522,
    "z": 0.252073,
    "source_article": "motor cortex",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "motor cortex",
      "decussation",
      "contralateral control"
    ]
  },
  {
    "id": "67e827f474e3a005",
    "question_text": "Parkinson's disease involves the degeneration of dopaminergic neurons in the substantia nigra pars compacta. Why does this loss produce the characteristic motor symptoms of tremor, rigidity, and bradykinesia?",
    "options": {
      "A": "Dopamine from the substantia nigra directly contracts muscle fibers in the limbs through a peripheral neuromuscular mechanism — without dopamine, muscles cannot generate force, leading to tremor from residual weak contractions and rigidity from unopposed connective tissue elasticity in surrounding tendons",
      "B": "Loss of dopaminergic input to the striatum disrupts the balance between the direct pathway (which facilitates movement) and the indirect pathway (which inhibits movement), resulting in excessive inhibition of thalamic output to motor cortex and thus reduced movement initiation",
      "C": "Without dopamine, serotonin floods the motor cortex and directly inhibits pyramidal neurons from firing action potentials, creating a chemical blockade of the corticospinal tract",
      "D": "The substantia nigra normally produces acetylcholine for the neuromuscular junction — when it degenerates, acetylcholine supply drops below the threshold needed for normal muscle contraction at motor end plates, producing widespread skeletal muscle weakness and the characteristic parkinsonian motor deficits"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.486021,
    "y": 0.70077,
    "z": 0.0,
    "source_article": "basal ganglia",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "basal ganglia",
      "direct and indirect pathways",
      "dopamine"
    ]
  },
  {
    "id": "20da36e622ea7838",
    "question_text": "The vestibular system detects head motion and orientation. When you spin in a circle and then suddenly stop, you experience vertigo and your eyes exhibit nystagmus (involuntary rhythmic eye movements). Why does this occur after you stop spinning?",
    "options": {
      "A": "The blood in your inner ear vessels continues flowing in circles due to inertia and creates hydraulic pressure on the vestibular hair cells long after the spinning stops",
      "B": "The vestibular organs can only detect angular acceleration, not constant velocity, and they have no mechanism to detect deceleration — they simply shut off when spinning stops, causing a brief sensory void",
      "C": "The endolymph fluid in the semicircular canals continues moving by inertia after the head stops, deflecting the cupula and hair cells in the opposite direction from the original rotation, creating a false signal of spinning in the opposite direction",
      "D": "Spinning damages the otoconia (ear crystals), which take 30-60 seconds to resettle on the otolith membrane — during this time the displaced crystals stimulate random hair cells creating chaotic vestibular signals that the brain misinterprets as rotational movement"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.502932,
    "y": 0.616251,
    "z": 0.38062,
    "source_article": "vestibular system",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "vestibular system",
      "semicircular canals",
      "endolymph inertia"
    ]
  },
  {
    "id": "4bd5b9a2d954311e",
    "question_text": "Hebbian learning is often summarized as 'neurons that fire together wire together.' At the molecular level, what does 'wiring together' primarily involve at excitatory glutamatergic synapses?",
    "options": {
      "A": "New axons physically grow from the presynaptic neuron to create additional synaptic contacts on the postsynaptic neuron within milliseconds of coincident firing, which accounts for all forms of synaptic strengthening observed in the hippocampus and throughout the neocortex",
      "B": "The presynaptic neuron begins releasing more glutamate per action potential, but the postsynaptic neuron's receptors remain completely unchanged in number, sensitivity, and type",
      "C": "The presynaptic neuron begins releasing substantially more glutamate per action potential as the sole mechanism of synaptic strengthening, but the postsynaptic neuron's receptors remain completely unchanged in number, sensitivity, conductance, and subunit composition",
      "D": "Calcium influx through NMDA receptors activates CaMKII and other kinases that phosphorylate existing AMPA receptors (increasing their conductance) and promote insertion of additional AMPA receptors into the postsynaptic membrane, increasing synaptic strength"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.481989,
    "y": 0.964674,
    "z": 0.309963,
    "source_article": "Hebbian learning",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "Hebbian learning",
      "LTP mechanism",
      "AMPA receptor trafficking",
      "CaMKII"
    ]
  },
  {
    "id": "7306616ef55c09fd",
    "question_text": "The default mode network (DMN) is a set of brain regions that show increased activity during rest and decreased activity during externally-directed tasks. What cognitive function is the DMN most strongly associated with?",
    "options": {
      "A": "Self-referential thought, autobiographical memory retrieval, mind-wandering, and mental simulation of future scenarios — the DMN activates when attention is directed inward rather than at external stimuli",
      "B": "Coordinating autonomic functions like heart rate and blood pressure during rest when the body needs homeostatic regulation without conscious oversight",
      "C": "Processing visual motion and spatial navigation, which the brain performs as background computation during idle moments to maintain an updated spatial map of the environment for emergency responses",
      "D": "Consolidating motor skills learned earlier in the day by replaying motor sequences through the premotor and supplementary motor cortices during wakeful rest periods between practice sessions"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.554186,
    "y": 0.695523,
    "z": 0.12186,
    "source_article": "default mode network",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "default mode network",
      "self-referential processing",
      "mind-wandering"
    ]
  },
  {
    "id": "9655cd6f92b7efff",
    "question_text": "Optogenetics allows researchers to control specific neurons with light. The technique requires expressing light-sensitive ion channels (like channelrhodopsin-2) in target neurons. Why is this method more powerful than electrical stimulation for establishing causal relationships between neural activity and behavior?",
    "options": {
      "A": "Optogenetics is more powerful because light can penetrate the skull non-invasively and reach any brain region without surgical implantation, whereas electrical stimulation requires invasive electrode placement — this non-invasive advantage eliminates confounds from surgical tissue damage",
      "B": "Cell-type specificity — optogenetics activates only neurons expressing the opsin (targeted by genetic promoters), while electrical stimulation indiscriminately activates all nearby neurons and fibers of passage regardless of cell type",
      "C": "Light stimulation produces cleaner action potentials with higher amplitude, and these stronger signals propagate more reliably to downstream targets",
      "D": "Optogenetics produces permanent activation lasting hours after light-off, providing sustained effects easier to measure than brief electrical effects"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.480988,
    "y": 0.856358,
    "z": 0.728919,
    "source_article": "optogenetics",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "optogenetics",
      "cell-type specificity",
      "causal neuroscience"
    ]
  },
  {
    "id": "b148cd175564c36c",
    "question_text": "Mirror neurons, originally discovered in macaque premotor cortex (area F5), fire both when an animal performs a goal-directed action and when it observes another individual performing the same action. What is the most scientifically rigorous interpretation of their function?",
    "options": {
      "A": "Mirror neurons definitively prove that empathy, language, and theory of mind all evolved from a single motor-simulation mechanism, and damage to mirror neuron areas is the sole cause of autism spectrum disorders",
      "B": "They likely contribute to action understanding and motor learning by mapping observed actions onto the observer's own motor repertoire, though their exact role in higher cognitive functions like empathy remains debated and the evidence for broader social cognition claims is mixed",
      "C": "They likely contribute to action understanding and motor learning by mapping observed actions onto the observer's own motor repertoire, though their exact role in higher cognitive functions like empathy remains debated and the evidence for broader claims is mixed",
      "D": "Mirror neurons store permanent memories of every action the animal has ever observed, functioning as a video-recording system in motor cortex that replays stored action sequences during sleep for memory consolidation of all observed behaviors throughout the animal's entire lifetime"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.541147,
    "y": 0.774296,
    "z": 0.354725,
    "source_article": "mirror neurons",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "mirror neurons",
      "action understanding",
      "motor simulation"
    ]
  },
  {
    "id": "542f24657f3aa8e8",
    "question_text": "Spike-timing-dependent plasticity (STDP) modifies synaptic strength based on the precise timing of pre- and postsynaptic spikes. If the presynaptic neuron fires 10 ms before the postsynaptic neuron, what happens to the synapse?",
    "options": {
      "A": "The synapse is eliminated entirely through rapid retraction, because any timing offset greater than 5 ms triggers a complement-mediated pruning cascade that physically removes the synaptic connection within minutes of the mistimed activity",
      "B": "Nothing happens — STDP only operates during development and is completely absent in the adult brain, where synaptic strengths are permanently fixed after critical period closure",
      "C": "The synapse weakens (long-term depression), because pre-before-post timing means the presynaptic input was too early to have caused the postsynaptic spike and is therefore deemed non-causal by the STDP learning rule",
      "D": "The synapse strengthens (long-term potentiation), because the pre-before-post timing order means the presynaptic input plausibly contributed to the postsynaptic firing — this causal timing relationship drives synaptic strengthening"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.49719,
    "y": 0.945707,
    "z": 0.363823,
    "source_article": "STDP",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "STDP",
      "synaptic plasticity",
      "spike timing"
    ]
  },
  {
    "id": "c3137d9aaaf652b5",
    "question_text": "The enteric nervous system (ENS) in the gastrointestinal tract contains approximately 500 million neurons and can operate largely independently of the brain. Why is this autonomy functionally important?",
    "options": {
      "A": "ENS autonomy allows coordinated digestive functions (peristalsis, secretion, blood flow regulation) to continue even if the vagus nerve is severed, because local reflex circuits can sense gut contents and generate appropriate motor patterns without central nervous system input",
      "B": "The ENS has more neurons than the brain and actually controls most cognitive functions through the gut-brain axis, which is why intestinal disorders cause immediate severe cognitive impairment and memory loss in all patients",
      "C": "The ENS operates independently because it uses a completely different set of neurotransmitters than the brain — gut neurons communicate exclusively through hormones rather than conventional neurotransmitters, and this hormonal signaling is inherently autonomous and does not require neural input from the central nervous system",
      "D": "ENS autonomy exists only in invertebrates — in mammals, every gut contraction requires a descending command from the brainstem dorsal motor nucleus of the vagus, and severing the vagus nerve causes immediate and permanent intestinal paralysis"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.499778,
    "y": 0.635691,
    "z": 0.355024,
    "source_article": "enteric nervous system",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "enteric nervous system",
      "gut autonomy",
      "peristalsis"
    ]
  },
  {
    "id": "e4115251da4e1f99",
    "question_text": "Place cells in the hippocampus fire when an animal occupies a specific location in its environment. When the animal is placed in a completely new environment, what happens to the place fields?",
    "options": {
      "A": "All place cells die through excitotoxic apoptosis from novelty-induced glutamate, requiring weeks of neurogenesis before navigating new environments",
      "B": "The place cell population undergoes global remapping — individual cells acquire entirely new place fields (or become silent, or newly active) in the new environment, creating a distinct and independent spatial representation unrelated to the previous map",
      "C": "Place cells maintain exactly the same firing patterns in new environments because fields are genetically hardcoded during development and cannot be modified",
      "D": "Place cells temporarily shut down for exactly 24 hours while the hippocampus processes the new environment offline during the next sleep cycle, and no spatial coding occurs during the initial exposure to any novel environment"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.564556,
    "y": 0.81628,
    "z": 0.68656,
    "source_article": "place cells",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "place cells",
      "remapping",
      "hippocampal spatial coding"
    ]
  },
  {
    "id": "6176d6b6362bbaf2",
    "question_text": "The connectome of C. elegans (302 neurons, ~7,000 synapses) was fully mapped in the 1980s, yet we still cannot fully predict the worm's behavior from this wiring diagram alone. What is the fundamental reason for this gap between structure and function?",
    "options": {
      "A": "The connectome was mapped incorrectly due to limitations of 1980s electron microscopy — modern high-resolution reconstructions show completely different wiring that contradicts the original White et al. (1986) dataset in every major neural circuit, rendering the entire original connectome scientifically useless",
      "B": "Neural dynamics depend not just on connectivity but also on continuously variable synaptic weights, neuromodulatory state (which dynamically reconfigures circuit function), intrinsic membrane properties of individual neurons, and extrasynaptic signaling — the static wiring diagram is necessary but insufficient",
      "C": "Neural dynamics depend not just on connectivity but also on synaptic weights (which vary continuously), neuromodulatory state (which reconfigures circuit function), intrinsic membrane properties, and extrasynaptic signaling — the static wiring diagram is necessary but not sufficient for predicting behavior",
      "D": "The connectome only describes electrical synapses (gap junctions) and completely omits all chemical synapses, which constitute approximately 99% of the worm's total synaptic connections and which drive all behaviorally relevant neural computation throughout the entire nervous system of Caenorhabditis elegans"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.528482,
    "y": 0.774966,
    "z": 0.328937,
    "source_article": "connectomics",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "connectomics",
      "neural dynamics",
      "neuromodulation",
      "structure-function gap"
    ]
  },
  {
    "id": "32a896547242dd86",
    "question_text": "Transcranial magnetic stimulation (TMS) applied to the primary visual cortex can induce phosphenes (perceived flashes of light) in subjects who have been blind from birth due to retinal degeneration. What does this imply about cortical visual processing?",
    "options": {
      "A": "It disproves critical periods for visual cortex development, showing that V1 maintains full adult-like function without any visual experience throughout life",
      "B": "It disproves the existence of critical periods for visual cortex development, demonstrating that visual cortex maintains full adult-like function and normal retinotopic organization even without any visual experience throughout the entire lifespan",
      "C": "It proves that blindness from retinal degeneration is actually a psychological condition — the retina and optic nerve are intact but the brain suppresses visual signals, and TMS overrides this cortical suppression to restore normal vision",
      "D": "It implies that visual experience is unnecessary for the basic capacity of primary visual cortex to generate visual percepts when directly stimulated, suggesting that the neural machinery for visual awareness can develop without visual input from the retina"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.531958,
    "y": 0.775918,
    "z": 0.397265,
    "source_article": "TMS",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "TMS",
      "visual cortex",
      "critical periods",
      "cortical plasticity"
    ]
  },
  {
    "id": "90bae6ede39b7a11",
    "question_text": "Grid cells in the medial entorhinal cortex fire in a regular hexagonal pattern as an animal moves through space. Why is the hexagonal grid pattern computationally significant for spatial navigation?",
    "options": {
      "A": "Hexagonal tiling provides the most efficient and uniform coverage of 2D space among all regular lattices, and a population of grid cells with different spatial scales and orientations can provide a compact, noise-resistant code for position through their combined activity patterns",
      "B": "Hexagonal tiling provides the most efficient and uniform coverage of 2D space among all regular lattices, and a population of grid cells with different spatial scales and orientations can provide a compact, noise-resistant code for position through their combined activity patterns in the entorhinal cortex",
      "C": "The hexagonal pattern directly encodes the animal's running speed — each vertex of the hexagon represents a specific speed, and the grid deforms into a rectangle at high speeds and a circle at rest, providing a speedometer readout independent of the animal's position in the environment",
      "D": "Grid cells fire hexagonally because the entorhinal cortex has a crystalline hexagonal cytoarchitecture (like a honeycomb) imposed by the physical arrangement of neurons in cortical columns, and the firing pattern simply reflects this anatomical constraint with no computational purpose"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.59,
    "y": 0.712298,
    "z": 0.926959,
    "source_article": "grid cells",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "grid cells",
      "spatial coding",
      "hexagonal lattice efficiency"
    ]
  },
  {
    "id": "ebd4c2c0f1857236",
    "question_text": "Synaptic homeostasis (also called synaptic scaling) adjusts all of a neuron's excitatory synapses proportionally in response to chronic changes in activity. How does this differ mechanistically from Hebbian LTP/LTD?",
    "options": {
      "A": "There is no difference — synaptic homeostasis and Hebbian plasticity are simply different names for the same molecular mechanism operating on different timescales, both involving identical NMDA receptor-dependent calcium signaling cascades that produce identical molecular changes at the postsynaptic density through phosphorylation of the same target proteins",
      "B": "Homeostatic scaling is cell-wide and adjusts all synapses multiplicatively (proportionally) based on the neuron's average firing rate, while Hebbian plasticity is input-specific and adjusts individual synapses based on correlated pre-post activity patterns — scaling preserves relative synaptic weights while Hebbian plasticity changes them",
      "C": "Hebbian plasticity operates only during developmental critical periods while synaptic homeostasis operates only in the mature adult brain — the two mechanisms are temporally segregated across the lifespan and never active simultaneously in any neuron at any point during either development or adulthood in any mammalian species studied to date",
      "D": "Synaptic homeostasis strengthens inhibitory GABAergic synapses while Hebbian plasticity strengthens excitatory glutamatergic synapses — the two mechanisms target completely non-overlapping synapse populations and never modify the same synaptic connection, maintaining a strict division of labor between excitatory and inhibitory plasticity processes"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.494331,
    "y": 0.921319,
    "z": 0.4234,
    "source_article": "synaptic homeostasis",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "synaptic homeostasis",
      "synaptic scaling",
      "Hebbian plasticity"
    ]
  },
  {
    "id": "d38a8074b0d8775c",
    "question_text": "Sharp-wave ripples (SWRs) are brief (~100ms) high-frequency oscillations (~200 Hz) in the hippocampus that occur primarily during quiet wakefulness and non-REM sleep. What role do they play in memory?",
    "options": {
      "A": "SWRs erase hippocampal memory traces by inducing widespread synaptic depression, clearing the hippocampus for new encoding the following day — disrupting SWRs should therefore improve memory by preventing this erasure process",
      "B": "SWRs have no function — they are pathological discharges similar to epileptic spikes that the healthy brain tolerates without consequence, and their presence during sleep is merely an incidental byproduct of reduced cholinergic tone",
      "C": "SWRs are essential for memory consolidation — during ripples, hippocampal place cells replay recently experienced spatial trajectories in compressed form, and this replay is coordinated with neocortical slow oscillations and thalamocortical spindles to transfer memory traces from hippocampus to long-term neocortical storage",
      "D": "SWRs encode the current sensory environment by synchronizing hippocampal activity with real-time visual and auditory cortical processing, creating a binding code that links multimodal sensory features into unified percepts during active exploration"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.547045,
    "y": 0.800979,
    "z": 0.437005,
    "source_article": "sharp-wave ripples",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "sharp-wave ripples",
      "memory consolidation",
      "hippocampal replay"
    ]
  },
  {
    "id": "e7393992eda6f5da",
    "question_text": "The free-energy principle (Karl Friston) proposes that the brain minimizes variational free energy — a mathematical quantity related to prediction error. How does this framework reconceptualize perception?",
    "options": {
      "A": "Perception is purely bottom-up — sensory data flows from receptors through the thalamus to cortex without any top-down influence whatsoever, and the free-energy principle applies only to motor control and not to perception at all, because sensory cortex entirely lacks the recurrent connectivity required for any predictive processing",
      "B": "The free-energy principle eliminates the concept of perception entirely, proposing that consciousness is merely an illusion and that organisms are nothing more than thermodynamic engines that respond to stimuli through purely reflexive mechanisms without any internal representations, generative models, or predictions about the external world",
      "C": "The free-energy principle eliminates the concept of perception entirely, proposing that consciousness is an illusion and organisms are thermodynamic engines that respond to stimuli through purely reflexive mechanisms without any internal representations or models of the external world",
      "D": "Perception becomes an active inference process: the brain generates top-down predictions about sensory input, compares them with actual input (prediction error), and iteratively updates its generative model to minimize the discrepancy — what we 'perceive' is the brain's best prediction, not a direct readout of sensory data"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.559209,
    "y": 0.666097,
    "z": 0.581072,
    "source_article": "free-energy principle",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "free-energy principle",
      "predictive coding",
      "active inference"
    ]
  },
  {
    "id": "321206e4ab6f8e47",
    "question_text": "Neural oscillations at different frequencies (delta, theta, alpha, beta, gamma) coexist in the brain. Cross-frequency coupling, particularly theta-gamma phase-amplitude coupling in the hippocampus, is thought to serve what computational function?",
    "options": {
      "A": "Gamma oscillation amplitude is modulated by theta phase, creating a temporal multiplexing scheme: different gamma bursts at different theta phases carry distinct information items (e.g., different place cells firing at specific theta phases encode a sequence of spatial positions), effectively organizing multiple memory items within each theta cycle",
      "B": "Theta-gamma coupling has no functional significance — it is an artifact of volume conduction and electrode proximity effects that disappears when proper source localization techniques are applied to the electrophysiological recordings",
      "C": "Theta oscillations drive gamma oscillations purely as a metabolic epiphenomenon — the energy demands of theta-frequency firing create periodic nutrient depletion that forces gamma-frequency neurons to fire in bursts synchronized to the theta metabolic cycle, with no informational content",
      "D": "Gamma oscillations generate the theta rhythm by entraining slow-firing neurons through an inverse frequency cascade — without gamma activity, theta oscillations cannot exist because they are simply the envelope of summed gamma bursts with no independent generation mechanism"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.559938,
    "y": 0.766399,
    "z": 0.480125,
    "source_article": "cross-frequency coupling",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "cross-frequency coupling",
      "theta-gamma",
      "temporal coding",
      "phase-amplitude coupling"
    ]
  },
  {
    "id": "d0b99abfd4619196",
    "question_text": "Neuromorphic computing chips (e.g., Intel's Loihi, IBM's TrueNorth) implement spiking neural networks in hardware. What fundamental computational advantage do spiking networks offer over traditional artificial neural networks (ANNs)?",
    "options": {
      "A": "Spiking networks can solve NP-complete problems in polynomial time by exploiting the quantum properties of individual spikes — each spike exists in a superposition of firing and not-firing states, enabling exponential parallelism that conventional artificial neural networks cannot achieve with classical digital computation alone",
      "B": "Spiking networks use temporal coding (information in spike timing, not just rates), enabling event-driven computation where neurons consume power only when they fire — this provides massive energy efficiency advantages over ANNs where every unit computes at every time step regardless of input activity",
      "C": "Spiking networks always achieve higher classification accuracy than deep learning on every benchmark task, which is why all major tech companies have abandoned GPU-based deep learning in favor of neuromorphic hardware for commercial AI products",
      "D": "The only advantage is physical size — neuromorphic chips are smaller than GPUs but offer no computational or energy benefits, and all spiking network algorithms can be perfectly simulated on conventional hardware with identical energy consumption per operation"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.534191,
    "y": 0.832163,
    "z": 0.788125,
    "source_article": "neuromorphic computing",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "neuromorphic computing",
      "spiking neural networks",
      "temporal coding",
      "energy efficiency"
    ]
  },
  {
    "id": "ceb05c86aa9beda9",
    "question_text": "The claustrum is a thin sheet of neurons located deep to the insular cortex with extensive reciprocal connections to nearly every cortical area. Francis Crick hypothesized it serves as the 'conductor of consciousness.' What is the current scientific status of this hypothesis?",
    "options": {
      "A": "Crick's hypothesis has been definitively proven — electrical stimulation of the claustrum reliably and reproducibly produces immediate loss of consciousness in every subject tested in clinical studies, and claustral lesions invariably cause permanent vegetative state with zero documented recovery in any patient in the entire clinical literature",
      "B": "The claustrum has been conclusively shown to have no neural function — it is a vestigial structure with no physiological activity in any mammalian species, comparable to the human appendix, and Crick's hypothesis was published as a speculative thought experiment with no empirical basis whatsoever",
      "C": "The hypothesis remains largely untested due to the claustrum's small size and deep location, though recent studies suggest roles in salience detection, attention switching, and cross-modal integration rather than consciousness per se — single case studies of claustral disruption show impaired consciousness but are not conclusive",
      "D": "The claustrum has been definitively shown to function exclusively as a pain processing center — it receives input only from nociceptive pathways and its stimulation produces only pain sensations, completely ruling out any role in consciousness, attention, or sensory integration"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.521424,
    "y": 0.674681,
    "z": 0.523081,
    "source_article": "claustrum",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "claustrum",
      "consciousness",
      "Crick hypothesis",
      "neural correlates"
    ]
  },
  {
    "id": "76e2b040e81b60e7",
    "question_text": "Dendritic computation challenges the classical 'point neuron' model. Experiments show that individual dendrites can perform local nonlinear operations (dendritic spikes, plateau potentials). Why does this matter for neural computation theory?",
    "options": {
      "A": "It doesn't matter — dendritic spikes are pathological events that occur only in damaged or dying neurons, and healthy neurons conform perfectly to the point neuron model where dendrites are passive cables that linearly sum their inputs without any local processing",
      "B": "It matters only for invertebrate neurons which have fundamentally different dendritic structure — mammalian pyramidal neurons have passive dendrites that conform to the point neuron model, making dendritic computation irrelevant for understanding the human brain",
      "C": "Dendritic spikes are important only because they cause epilepsy — understanding them is medically relevant for seizure control but contributes nothing to computational neuroscience or theories of how the brain processes information",
      "D": "It matters because dendritic nonlinearities multiply the computational capacity of each neuron — instead of being a single integrator, a pyramidal neuron with active dendrites can implement multiple independent processing units (functional subunits), each performing nonlinear operations before the results are combined at the soma"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.536097,
    "y": 0.85692,
    "z": 0.681843,
    "source_article": "dendritic computation",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "dendritic computation",
      "point neuron model",
      "neural complexity"
    ]
  },
  {
    "id": "b5db155d22fabb8a",
    "question_text": "The discovery of adult hippocampal neurogenesis (new neurons born in the dentate gyrus throughout life) was controversial. What is the primary proposed computational function of these new neurons?",
    "options": {
      "A": "Pattern separation — immature adult-born granule cells are more excitable and broadly tuned than mature neurons, allowing them to encode new memories with distinct representations that minimize interference with previously stored memories, enhancing the hippocampus's ability to discriminate similar experiences",
      "B": "Adult-born neurons replace all existing dentate gyrus neurons every 6 months through a complete turnover process, meaning the hippocampus is entirely rebuilt twice per year and no neuron in the dentate gyrus is older than 6 months at any given time",
      "C": "Adult-born neurons function exclusively as interneurons providing inhibition — they never become excitatory granule cells and serve only to regulate the excitation-inhibition balance in the dentate gyrus",
      "D": "Neurogenesis provides spare neurons compensating for the ~10,000 neurons that die daily from metabolic stress, maintaining constant neuron count without any computational purpose beyond replacement"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.552155,
    "y": 0.891576,
    "z": 0.489982,
    "source_article": "adult neurogenesis",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "adult neurogenesis",
      "pattern separation",
      "dentate gyrus"
    ]
  },
  {
    "id": "b5db155d22fabb8a",
    "question_text": "The discovery of adult hippocampal neurogenesis (new neurons born in the dentate gyrus throughout life) was controversial. What is the primary proposed computational function of these new neurons?",
    "options": {
      "A": "Adult-born neurons replace all existing dentate gyrus neurons every 6 months through complete turnover, meaning the hippocampus is entirely rebuilt twice per year and no neuron in the DG is older than 6 months",
      "B": "Pattern separation — immature adult-born granule cells are more excitable and broadly tuned than mature neurons, allowing them to encode new memories with distinct representations that minimize interference with previously stored memories",
      "C": "Adult-born neurons are exclusively interneurons providing inhibition — they never become excitatory granule cells, serving only to regulate E-I balance",
      "D": "Neurogenesis replaces ~10,000 neurons dying daily from metabolic stress, maintaining constant count without computational purpose"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.552323,
    "y": 0.899561,
    "z": 0.47985,
    "source_article": "adult neurogenesis",
    "domain_ids": [
      "neuroscience"
    ],
    "concepts_tested": [
      "adult neurogenesis",
      "pattern separation",
      "dentate gyrus"
    ]
  }
]