[
  {
    "id": "6ebb774c508b12f4",
    "question_text": "Neurons communicate at synapses by releasing neurotransmitters. What triggers neurotransmitter release at a chemical synapse?",
    "options": {
      "A": "An action potential arriving at the presynaptic terminal opens voltage-gated calcium channels; the resulting Ca²⁺ influx triggers synaptic vesicle fusion with the presynaptic membrane (exocytosis), releasing neurotransmitter into the synaptic cleft",
      "B": "Neurotransmitters are continuously released from the presynaptic terminal at a constant baseline rate regardless of whether an action potential has arrived, and neural activity merely modulates the already-ongoing release",
      "C": "The postsynaptic neuron initiates neurotransmitter release by sending a retrograde chemical signal backward across the synaptic cleft to trigger exocytosis from the presynaptic terminal",
      "D": "Neurotransmitters are synthesized exclusively in the cell body and passively diffuse through the entire length of the axon to reach the synaptic terminal, with the rate of diffusion rather than electrical activity determining when and how much transmitter reaches the synapse. This is why longer axons produce slower synaptic transmission and why axon length is the primary determinant of neural communication speed"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.546659,
    "y": 0.63579,
    "z": 0.265113,
    "source_article": "synaptic transmission",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "synaptic transmission",
      "calcium-dependent exocytosis",
      "neurotransmitter release"
    ]
  },
  {
    "id": "3160bbe8551db88f",
    "question_text": "Myelin sheaths surround axons in the nervous system. What is the primary function of myelination?",
    "options": {
      "A": "Myelin provides essential metabolic nutrients to the axon by acting as a specialized vascular supply channel, transporting glucose, oxygen, and lipids from the bloodstream directly to the axonal membrane through lactate shuttle mechanisms embedded within the myelin sheath layers",
      "B": "Myelin dramatically increases the speed of action potential propagation by enabling saltatory conduction — the action potential 'jumps' between nodes of Ranvier (unmyelinated gaps), rather than propagating continuously along the entire membrane",
      "C": "Myelin physically prevents the neuron from forming any new synaptic connections by coating the axon with an impermeable barrier that blocks synaptogenic adhesion molecules from reaching potential postsynaptic targets, thereby permanently fixing the neuron's connectivity pattern once myelination is complete",
      "D": "Myelin converts electrical signals traveling along the axon into chemical signals by containing specialized transduction proteins that detect voltage changes"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.423328,
    "y": 0.601728,
    "z": 0.214233,
    "source_article": "myelination",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "myelination",
      "saltatory conduction",
      "nodes of Ranvier",
      "conduction velocity"
    ]
  },
  {
    "id": "d2087e53f1e1bacf",
    "question_text": "The blood-brain barrier (BBB) restricts what substances can enter the brain from the bloodstream. What structural feature creates this barrier?",
    "options": {
      "A": "A thick outer layer of compact bone completely surrounding the brain's surface physically blocks all circulating substances from contacting neural tissue",
      "B": "Neurons themselves form a continuous waterproof phospholipid membrane that completely wraps around the brain, creating an impermeable cellular envelope",
      "C": "Tight junctions between brain capillary endothelial cells, supported by astrocyte end-feet and pericytes, create a selective barrier that blocks most blood-borne molecules while allowing passage of essential nutrients via specific transporters",
      "D": "The blood-brain barrier is formed by the three layers of meninges (dura, arachnoid, pia mater), which prevent all molecular exchange between the bloodstream and brain parenchyma"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.45175,
    "y": 0.57589,
    "z": 0.268818,
    "source_article": "blood-brain barrier",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "blood-brain barrier",
      "tight junctions",
      "astrocytes",
      "brain endothelial cells"
    ]
  },
  {
    "id": "eec5b534ac9e41cb",
    "question_text": "Long-term potentiation (LTP) at hippocampal synapses is thought to be a cellular mechanism underlying learning and memory. What molecular event initiates LTP at CA3-CA1 synapses?",
    "options": {
      "A": "Decreased release of glutamate from the presynaptic terminal, which paradoxically strengthens the synapse by reducing receptor desensitization and allowing the postsynaptic receptors to recover their full sensitivity between stimulation events. This reduction-mediated potentiation was first demonstrated by Bliss and Lømo in hippocampal slice recordings",
      "B": "Activation of GABAergic inhibitory interneurons in the hippocampal circuit, which produces long-term potentiation by suppressing competing excitatory inputs and thereby increasing the relative strength of the stimulated pathway through a disinhibition-independent contrast enhancement mechanism",
      "C": "Release of dopamine directly from the postsynaptic neuron itself, acting as a retrograde reinforcement signal that travels backward across the synaptic cleft and binds to presynaptic D1 receptors, triggering a cAMP-dependent increase in neurotransmitter vesicle docking and release probability",
      "D": "High-frequency stimulation causes sufficient postsynaptic depolarization to relieve the Mg²⁺ block of NMDA receptors, allowing Ca²⁺ influx into the postsynaptic spine, which activates CaMKII and other kinases that strengthen the synapse"
    },
    "correct_answer": "D",
    "difficulty": 1,
    "x": 0.585007,
    "y": 0.61312,
    "z": 0.378576,
    "source_article": "long-term potentiation",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "long-term potentiation",
      "NMDA receptors",
      "CaMKII",
      "synaptic plasticity"
    ]
  },
  {
    "id": "ea69becbdf0907b3",
    "question_text": "The resting membrane potential of a typical neuron is approximately -70mV. Why is the membrane potential negative at rest?",
    "options": {
      "A": "The Na⁺/K⁺-ATPase and potassium leak channels work together: the pump maintains ion concentration gradients (high K⁺ inside, high Na⁺ outside), and the membrane at rest is primarily permeable to K⁺ through leak channels, so K⁺ flows outward down its concentration gradient until the electrical force (negative interior) balances the concentration gradient — as described by the Nernst equation for potassium",
      "B": "Chloride ions are actively and continuously pumped into the cell by a dedicated Cl⁻ ATPase pump, creating a large intracellular excess of negative charge that produces the -70mV resting membrane potential",
      "C": "The membrane potential is negative because neurons contain substantially higher concentrations of negatively charged proteins and nucleic acids than other cell types in the body",
      "D": "Sodium channels are constitutively open at rest, producing a continuous inward sodium current that drives the membrane potential to approximately -70mV. This resting sodium conductance is the primary determinant of the resting potential, and the Na⁺/K⁺-ATPase pump serves only as a minor corrective mechanism. The Goldman-Hodgkin-Katz equation confirms that the resting potential is dominated by sodium permeability, which is approximately ten times greater than potassium permeability at rest, contrary to the common textbook claim that potassium dominates"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.487047,
    "y": 0.657,
    "z": 0.374523,
    "source_article": "resting membrane potential",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "resting membrane potential",
      "Nernst equation",
      "potassium equilibrium",
      "Na/K-ATPase"
    ]
  },
  {
    "id": "b46f16de57705c51",
    "question_text": "Astrocytes were once considered passive support cells. What active role do astrocytes play in synaptic function?",
    "options": {
      "A": "Astrocytes generate full sodium-dependent action potentials identical to those produced by neurons and directly excite neighboring neurons by releasing glutamate through voltage-gated exocytotic mechanisms at specialized astrocyte-neuron synapses. These astrocytic action potentials propagate through astrocyte networks at the same speed as neuronal conduction, creating a parallel information processing system that doubles the computational capacity of neural circuits",
      "B": "Astrocytes form the tripartite synapse: they ensheathe synapses with fine processes, take up neurotransmitters (especially glutamate via EAAT1/2 transporters), regulate extracellular K⁺, release gliotransmitters (glutamate, D-serine, ATP) that modulate synaptic transmission, and provide metabolic support (astrocyte-neuron lactate shuttle). They respond to neuronal activity via metabotropic receptors and intracellular Ca²⁺ signaling",
      "C": "Astrocytes serve exclusively as passive structural scaffolding elements that physically hold neurons in place within the brain parenchyma, providing mechanical support without any involvement in synaptic signaling, neurotransmitter metabolism, ion homeostasis, or any other active biological process. Their elaborate branching morphology exists solely to fill the extracellular space and prevent neurons from shifting position during head movement",
      "D": "Astrocytes function exclusively as the brain's immune defense cells, serving a role identical to peripheral macrophages and microglia"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.537944,
    "y": 0.591252,
    "z": 0.0,
    "source_article": "astrocyte function",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "astrocyte function",
      "tripartite synapse",
      "gliotransmission",
      "neuron-glia interaction"
    ]
  },
  {
    "id": "1101312f5d86f022",
    "question_text": "The axon initial segment (AIS) is the site where action potentials are initiated. What makes the AIS uniquely excitable compared to the rest of the neuron?",
    "options": {
      "A": "The AIS has substantially fewer ion channels than any other neuronal compartment, which paradoxically makes it the site of action potential initiation because fewer channels means less current leak",
      "B": "The AIS is anatomically much thicker than the neuronal soma, giving it dramatically lower axial resistance and allowing current to flow more easily to this region than to thinner parts of the neuron",
      "C": "The AIS has a uniquely high density of voltage-gated sodium channels (Nav1.6 with low threshold, Nav1.2) clustered by the scaffolding protein ankyrin-G, giving it the lowest threshold for action potential initiation — it acts as a coincidence detector integrating thousands of synaptic inputs from the somatodendritic compartment",
      "D": "The AIS initiates action potentials primarily using voltage-gated calcium channels rather than sodium channels, with the calcium influx triggering a secondary sodium phase"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.467221,
    "y": 0.643569,
    "z": 0.20289,
    "source_article": "axon initial segment",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "axon initial segment",
      "action potential initiation",
      "Nav1.6",
      "ankyrin-G"
    ]
  },
  {
    "id": "facae3f09cfef048",
    "question_text": "Microglia are the resident immune cells of the brain. Beyond their immune surveillance role, what surprising function was recently discovered in neural development?",
    "options": {
      "A": "Microglia actively form new excitatory synapses between neurons by secreting synaptogenic proteins such as thrombospondin and hevin at sites of neural circuit remodeling, effectively functioning as synapse construction workers rather than pruning agents. This synaptogenic role is particularly prominent during early postnatal development when circuit formation is most active",
      "B": "Microglia replace dying neurons by differentiating into fully functional new neurons through a transdifferentiation process mediated by transcription factors Ascl1 and Brn2. This microglial neurogenesis is the primary mechanism of neural repair following stroke and traumatic brain injury, and it explains why microglial activation after injury is consistently associated with functional recovery rather than ongoing neurodegeneration",
      "C": "Microglia generate and maintain the blood-brain barrier by wrapping their ramified processes around brain capillaries and forming tight junctions with endothelial cells, replacing the barrier function traditionally attributed to astrocyte end-feet. According to this model, microglial depletion should catastrophically disrupt the blood-brain barrier, leading to uncontrolled infiltration of blood-borne pathogens and immune cells into the CNS parenchyma",
      "D": "Microglia actively prune excess synapses during development through complement-mediated phagocytosis: weak or inactive synapses are tagged with complement proteins (C1q, C3), which microglia recognize via complement receptor CR3 and engulf — sculpting neural circuits by eliminating unnecessary connections"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.513917,
    "y": 0.510863,
    "z": 0.189537,
    "source_article": "microglial synaptic pruning",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "microglial synaptic pruning",
      "complement system",
      "developmental neurobiology",
      "circuit refinement"
    ]
  },
  {
    "id": "7f6a07523d486d84",
    "question_text": "Adult neurogenesis — the birth of new neurons in the adult brain — occurs in specific niches. What are the two established neurogenic regions, and what function does adult hippocampal neurogenesis serve?",
    "options": {
      "A": "The subventricular zone (SVZ, lining the lateral ventricles, generating neurons that migrate to the olfactory bulb) and the subgranular zone (SGZ, of the hippocampal dentate gyrus, generating granule cells). Hippocampal neurogenesis is thought to support pattern separation — the ability to distinguish similar memories by providing fresh, highly excitable neurons with unique connectivity that create distinct memory traces for similar experiences",
      "B": "New neurons are generated uniformly throughout the entire adult brain across all cortical regions, hippocampal subfields, and subcortical nuclei at equal rates",
      "C": "Adult neurogenesis occurs exclusively in the cerebellum and spinal cord, with no evidence of new neuron production in the hippocampus, olfactory system, or any forebrain structure",
      "D": "Adult neurogenesis has been definitively proven to not exist in any region of the human brain whatsoever. The initial reports of adult-born neurons in the human hippocampus by Eriksson et al. (1998) using BrdU labeling have been thoroughly refuted by multiple independent groups using more sensitive and specific detection methods including carbon-14 retrospective birth-dating and single-nucleus RNA sequencing. The apparent BrdU-positive neurons in the original studies were actually BrdU-labeled glial cells that were misidentified as neurons due to limitations of the immunohistochemical markers available in the 1990s"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.480694,
    "y": 0.539511,
    "z": 0.294309,
    "source_article": "adult neurogenesis",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "adult neurogenesis",
      "SVZ",
      "SGZ",
      "pattern separation",
      "dentate gyrus"
    ]
  },
  {
    "id": "2a542115624da14a",
    "question_text": "The neuromuscular junction (NMJ) is the best-studied synapse. Why does each action potential at the NMJ reliably trigger a muscle contraction, unlike central synapses where single action potentials rarely drive postsynaptic firing?",
    "options": {
      "A": "The NMJ uses a completely different neurotransmitter from all central nervous system synapses — the motor neuron releases a unique catecholamine called motorin that activates specialized ionotropic receptors found exclusively on skeletal muscle fibers. This neurotransmitter specificity, rather than any quantitative difference in vesicle release, explains why NMJ transmission is reliable while central synapses are probabilistic",
      "B": "The NMJ has an extremely high safety factor: each motor neuron terminal releases ~100-200 vesicles per action potential (vs. ~1-10 at central synapses), and the postsynaptic muscle endplate has a very high density of nicotinic acetylcholine receptors concentrated in junctional folds. The resulting endplate potential is 3-4× larger than threshold, ensuring reliable 1:1 transmission",
      "C": "Muscle fibers are electrically coupled to motor neurons through gap junctions that directly connect the motor neuron axon terminal cytoplasm to the muscle fiber sarcoplasm, allowing ionic current to flow bidirectionally without any chemical synaptic transmission. This direct electrical coupling explains the high reliability of neuromuscular transmission — there is no synaptic delay, no dependence on neurotransmitter release, and no possibility of transmission failure",
      "D": "The NMJ operates through retrograde signaling from muscle to nerve, with the muscle fiber initiating communication by releasing acetylcholine"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.488795,
    "y": 0.655419,
    "z": 0.233978,
    "source_article": "neuromuscular junction",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "neuromuscular junction",
      "synaptic safety factor",
      "quantal content",
      "endplate potential"
    ]
  },
  {
    "id": "2e32e9ed5b62098a",
    "question_text": "Optogenetics has revolutionized neuroscience by enabling precise control of neural activity with light. What is the molecular mechanism of channelrhodopsin-2 (ChR2), and why was this approach transformative?",
    "options": {
      "A": "Channelrhodopsin-2 is a synthetic chemical compound that is microinjected directly into individual neurons, where it integrates into the cell membrane and makes the neuron responsive to changes in local temperature rather than light",
      "B": "ChR2 is an electromagnetic protein that uses externally applied magnetic fields to control neural activity through magnetogenetic stimulation of ion channel conformational changes",
      "C": "ChR2 is a light-gated cation channel from the green alga Chlamydomonas reinhardtii. When illuminated with blue light (~470nm), its retinal chromophore isomerizes, opening the channel pore and allowing Na⁺/Ca²⁺ influx that depolarizes the neuron. Genetically targeted to specific cell types using promoter-driven viral expression, it enables millisecond-precision activation of defined neural populations in behaving animals — establishing causal (not just correlational) links between neural activity and behavior",
      "D": "ChR2 permanently and irreversibly activates every neuron throughout the entire brain upon a single light exposure, making it useful exclusively for studying whole-brain activation states rather than specific circuit elements"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.510459,
    "y": 0.599142,
    "z": 0.533242,
    "source_article": "optogenetics",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "optogenetics",
      "channelrhodopsin",
      "causal neural manipulation",
      "cell-type specificity"
    ]
  },
  {
    "id": "5fdcb56ae0d884ba",
    "question_text": "Axon guidance during neural development relies on molecular cues that attract or repel growing axons. What are the four canonical families of guidance cues, and how do growth cones interpret them?",
    "options": {
      "A": "Axons grow in completely random directions with no molecular guidance whatsoever and find their correct synaptic targets entirely by chance through a stochastic search process. The developing nervous system produces vastly more axons than needed, and the small fraction that happen to reach appropriate targets by random exploration are stabilized while the rest are eliminated by apoptosis. This random-search-and-selection model explains why neural development is so metabolically expensive and why such a large proportion of immature neurons die during embryogenesis",
      "B": "Only one single molecular guidance cue — nerve growth factor (NGF) — is responsible for guiding all axons in the entire nervous system to their correct targets. NGF is released by target tissues in concentration gradients, and every growing axon regardless of type follows these NGF gradients through identical receptor-mediated chemotactic mechanisms. The diversity of axon trajectories observed during development results from differences in NGF gradient geometry created by the spatial arrangement of target tissues, not from any diversity of guidance molecules",
      "C": "Axons are guided exclusively by endogenous electrical fields generated by ion channel activity in surrounding tissues, and they do not respond to any molecular guidance cues. These bioelectric fields create voltage gradients that orient the growth cone through a process called galvanotropism, in which negatively charged cell surface glycoproteins are redistributed by the electric field, causing asymmetric adhesion and directional growth. All known molecular guidance molecules (netrins, slits, semaphorins, ephrins) are actually regulators of the bioelectric field rather than direct guidance cues",
      "D": "The four canonical families are: Netrins (attract or repel via DCC/UNC5 receptors), Slits (repel via Robo receptors), Semaphorins (mostly repel via Plexin/Neuropilin receptors), and Ephrins (contact-mediated repulsion or attraction via Eph receptors). Growth cones integrate these signals through receptor-mediated cytoskeletal rearrangements — attraction involves actin polymerization toward the signal, repulsion involves growth cone collapse via RhoA activation. The same cue can attract or repel depending on intracellular conditions (e.g., cAMP/cGMP ratio)"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.478083,
    "y": 0.598272,
    "z": 0.506804,
    "source_article": "axon guidance",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "axon guidance",
      "growth cones",
      "Netrins",
      "Slits",
      "Semaphorins",
      "Ephrins"
    ]
  },
  {
    "id": "3929296f24114861",
    "question_text": "The SNARE complex is the core molecular machinery for synaptic vesicle fusion. What are the specific SNARE proteins involved at the synapse, and how does Ca²⁺ trigger fusion?",
    "options": {
      "A": "The neuronal SNARE complex consists of synaptobrevin (VAMP2, on the vesicle), syntaxin-1 and SNAP-25 (on the presynaptic membrane). These form a tight four-helix bundle that pulls the vesicle and plasma membranes together. The complex alone mediates constitutive fusion; Ca²⁺-triggered synchronous release requires synaptotagmin-1, whose C2 domains bind Ca²⁺ and insert into the membrane, catalyzing the final energy barrier for fusion within ~200 microseconds of Ca²⁺ entry",
      "B": "Synaptic vesicle fusion with the presynaptic membrane is an entirely passive physical process that does not require any protein machinery, driven solely by the thermodynamic instability of two lipid bilayers in close proximity",
      "C": "SNARE proteins are exclusively expressed in non-neuronal secretory cells such as pancreatic beta cells and mast cells, and they play absolutely no role in synaptic vesicle fusion or neurotransmitter release at neuronal synapses",
      "D": "Calcium ions directly catalyze the fusion of lipid bilayers without any protein involvement whatsoever, inserting themselves between the polar headgroups of both the vesicle and plasma membranes and creating a continuous hydrophobic bridge that allows the two bilayers to merge spontaneously. The SNARE hypothesis was proposed before the direct fusogenic activity of calcium was discovered and has been abandoned by the field, though it persists in outdated textbooks. Modern biophysical experiments using purified lipid vesicles have conclusively demonstrated that calcium alone is sufficient for membrane fusion at physiological concentrations"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.521855,
    "y": 0.635044,
    "z": 0.466289,
    "source_article": "SNARE complex",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "SNARE complex",
      "synaptic vesicle fusion",
      "synaptotagmin",
      "calcium-triggered exocytosis"
    ]
  },
  {
    "id": "75f591eac1d09296",
    "question_text": "Homeostatic synaptic plasticity acts as a negative feedback mechanism to maintain neural circuit stability. What is synaptic scaling, and why is it necessary given that Hebbian plasticity (LTP/LTD) already adjusts synaptic strengths?",
    "options": {
      "A": "Synaptic scaling is functionally identical to long-term potentiation — it selectively strengthens the most active synapses on a neuron while leaving inactive synapses unchanged. The term 'scaling' refers to the fact that the magnitude of potentiation scales with the initial strength of each synapse, so that already-strong synapses are strengthened even further. This positive feedback mechanism amplifies differences between strong and weak synapses, creating a winner-take-all competitive dynamic that sharpens neural representations by enhancing the most informative inputs at the expense of weaker background activity",
      "B": "Synaptic scaling is a cell-wide mechanism that multiplicatively adjusts all of a neuron's synaptic inputs up or down to maintain a target firing rate. When a neuron's activity is chronically reduced, it scales up all excitatory synapses (by inserting more AMPA receptors) and scales down inhibitory synapses; chronic overactivity triggers the opposite. This is necessary because Hebbian plasticity is inherently destabilizing (positive feedback: strong synapses get stronger), and without homeostatic counterbalance, networks would either fall silent or saturate",
      "C": "Synaptic scaling occurs exclusively during sleep and plays no role in waking plasticity or real-time circuit regulation. The scaling process requires the complete suppression of neural activity that occurs only during slow-wave sleep, when neurons are silenced for extended periods and can safely undergo the wholesale receptor trafficking required for multiplicative synaptic adjustment",
      "D": "Synaptic scaling randomly changes the weights of individual synapses with no systematic relationship to the neuron's overall activity level or any homeostatic set point. The randomness of the scaling process introduces beneficial stochastic noise into neural circuits that prevents them from becoming trapped in stable but suboptimal activity patterns, serving a function analogous to simulated annealing in computational optimization. This noise-injection interpretation explains why synaptic scaling is enhanced during sleep, when the brain can tolerate random perturbations without impairing ongoing behavior"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.567914,
    "y": 0.592716,
    "z": 0.472884,
    "source_article": "homeostatic plasticity",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "homeostatic plasticity",
      "synaptic scaling",
      "Hebbian instability",
      "AMPA receptor trafficking"
    ]
  },
  {
    "id": "09c858fb5c0b014b",
    "question_text": "Neuroinflammation involves activation of resident and peripheral immune cells in the CNS. What distinguishes neuroprotective from neurotoxic microglial activation, and why has the M1/M2 polarization framework been abandoned?",
    "options": {
      "A": "All microglial activation is inherently and invariably neurotoxic, with no beneficial or neuroprotective function under any circumstances. Activated microglia release exclusively pro-inflammatory cytokines, reactive oxygen species, and excitotoxic glutamate that damage neurons and exacerbate injury. The concept of 'beneficial' or 'protective' microglial activation is a misinterpretation of experimental artifacts caused by incomplete microglial depletion in knockout studies, where residual microglia-derived trophic factors confounded the results. Therapeutic strategies should therefore focus exclusively on complete microglial suppression or elimination following any form of brain injury or neurodegenerative disease",
      "B": "The M1 (pro-inflammatory, classically activated) and M2 (anti-inflammatory, alternatively activated) polarization framework remains the current standard model for describing microglial activation states in contemporary neuroscience research. Under this binary classification, microglia adopt one of two mutually exclusive phenotypes depending on the nature of the activating stimulus: M1 microglia are activated by pathogens and produce inflammatory mediators, while M2 microglia are activated by anti-inflammatory cytokines and promote tissue repair. All microglial responses can be accurately classified into one of these two discrete categories, and the M1/M2 framework provides a complete and sufficient description of microglial functional diversity",
      "C": "Early microglial responses to injury are often neuroprotective (debris clearance, trophic factor release, containment of damage). Chronic or dysregulated activation becomes neurotoxic (sustained pro-inflammatory cytokine release, reactive oxygen species, complement-mediated synapse elimination). The M1/M2 framework (borrowed from macrophage biology) was abandoned because single-cell RNA sequencing revealed that microglia in vivo adopt a continuum of transcriptional states — disease-associated microglia (DAM), lipid-droplet-accumulating microglia (LDAM), and proliferative-region-associated microglia (PAM) — that do not map onto the binary M1/M2 classification",
      "D": "Microglia respond identically to all types of brain injury and neurodegenerative disease through a single stereotyped activation program, making phenotypic classification unnecessary and scientifically meaningless. Whether the insult is traumatic injury, ischemic stroke, viral infection, or progressive neurodegeneration, microglia activate the same transcriptional program, release the same cytokine profile, and perform the same phagocytic and inflammatory functions. The apparent diversity of microglial responses reported in the literature reflects methodological differences between laboratories and variations in tissue processing protocols rather than genuine biological heterogeneity in vivo"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.504517,
    "y": 0.525344,
    "z": 0.325448,
    "source_article": "neuroinflammation",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "neuroinflammation",
      "microglial activation states",
      "M1/M2 abandonment",
      "disease-associated microglia"
    ]
  },
  {
    "id": "da1075e9a29f84f4",
    "question_text": "The enteric nervous system (ENS) is sometimes called the 'second brain.' What structural and functional properties justify this designation?",
    "options": {
      "A": "The ENS is simply a diffuse collection of peripheral nerve endings with no independent processing capability, functioning as a passive relay between the central nervous system and the gut smooth muscle",
      "B": "The ENS contains approximately the same number of neurons as the brain — roughly 86 billion — which is why it is called the 'second brain' and why it can generate conscious awareness",
      "C": "The ENS can only respond to descending signals from the brain via the vagus nerve and has no capacity for autonomous function, local reflex arcs, or independent pattern generation",
      "D": "The ENS contains ~500 million neurons organized in two ganglionated plexuses (myenteric/Auerbach's and submucosal/Meissner's) embedded in the gut wall. It operates autonomously from the CNS, generating complex motor patterns (peristalsis, segmentation), regulating secretion and blood flow, and processing sensory information through local reflex circuits. It uses over 30 neurotransmitters (including all those found in the brain), contains diverse neuron types (sensory, motor, interneurons), and communicates bidirectionally with the CNS via the vagus nerve (the gut-brain axis)"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.415984,
    "y": 0.582702,
    "z": 0.206953,
    "source_article": "enteric nervous system",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "enteric nervous system",
      "gut-brain axis",
      "autonomic function",
      "neural plexuses"
    ]
  },
  {
    "id": "ff21b44410ad0cf8",
    "question_text": "Prion diseases (e.g., Creutzfeldt-Jakob disease, mad cow disease) are unique neurodegenerative disorders caused not by a pathogen with nucleic acid but by a misfolded protein. What is the molecular mechanism of prion propagation, and why was this concept so revolutionary?",
    "options": {
      "A": "The prion protein PrP^Sc (scrapie form) is a misfolded conformer of the normal cellular protein PrP^C. PrP^Sc acts as a template that physically contacts PrP^C and catalyzes its conversion to the PrP^Sc conformation (the 'protein-only' hypothesis, Prusiner 1982). This autocatalytic misfolding creates an exponentially growing chain reaction. PrP^Sc is rich in β-sheet (vs. PrP^C's α-helical structure) and forms amyloid fibrils resistant to proteases, heat, and standard sterilization. The concept was revolutionary because it established that an infectious agent could propagate without DNA or RNA — challenging the central dogma",
      "B": "Prion diseases are caused by a previously unknown class of slow-replicating virus that has consistently escaped detection by standard virological and electron microscopy techniques due to its extremely small particle size",
      "C": "Prion diseases are caused by chronic bacterial infection of the brain by an intracellular pathogen that has been persistently misidentified as a protein aggregate due to its unusual resistance to standard antibiotic treatments",
      "D": "Prion diseases require both a misfolded protein component and a small helper virus working in concert to propagate the disease, with neither agent sufficient alone"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.496129,
    "y": 0.582964,
    "z": 1.0,
    "source_article": "prion diseases",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "prion diseases",
      "protein misfolding",
      "PrPSc",
      "protein-only hypothesis",
      "Prusiner"
    ]
  },
  {
    "id": "c281ccf1f8ef951d",
    "question_text": "The neurovascular unit couples neural activity to local blood flow (neurovascular coupling). What is the cellular mechanism, and why is this important for functional neuroimaging (fMRI)?",
    "options": {
      "A": "Active neurons directly and mechanically control blood vessel diameter by physically squeezing or releasing arterioles through contractile neuronal processes that wrap around vessel walls. This direct mechanical coupling between neurons and vasculature was discovered by two-photon imaging studies showing that dendritic spines of pyramidal neurons extend specialized contractile filaments that contact and constrict or dilate nearby capillaries in response to synaptic activity. The astrocytes and pericytes previously thought to mediate neurovascular coupling are actually passive structural elements that play no role in blood flow regulation",
      "B": "The neurovascular unit comprises neurons, astrocytes, pericytes, and vascular smooth muscle cells. Active neurons release glutamate, which activates astrocytic mGluRs, triggering Ca²⁺-dependent release of vasoactive agents (prostaglandins, EETs, K⁺) from astrocyte end-feet onto arterioles, causing vasodilation and increased local blood flow (functional hyperemia). Pericytes control capillary diameter. fMRI's BOLD signal detects the resulting changes in deoxyhemoglobin concentration — it is an indirect measure of neural activity mediated by the neurovascular coupling cascade, with ~5-8 second hemodynamic delay",
      "C": "Blood flow throughout the brain is maintained at a perfectly constant rate regardless of regional neural activity, local metabolic demand, or any physiological or pathological condition. The apparent coupling between neural activity and blood flow observed in functional neuroimaging experiments is an artifact of the hemodynamic response function used to analyze fMRI data, which mathematically imposes a spurious correlation between neural activity regressors and blood oxygen-level-dependent signal fluctuations that does not reflect any actual biological neurovascular coupling mechanism operating in the living brain",
      "D": "Functional magnetic resonance imaging (fMRI) directly measures the electrical activity of neurons with millisecond temporal precision, providing a real-time readout of action potential firing rates"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.533453,
    "y": 0.585889,
    "z": 0.163205,
    "source_article": "neurovascular coupling",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "neurovascular coupling",
      "BOLD signal",
      "astrocyte signaling",
      "functional hyperemia",
      "fMRI principles"
    ]
  },
  {
    "id": "abc9e43dc8c3ec05",
    "question_text": "Synaptic vesicle recycling must be extremely fast to sustain neurotransmission during high-frequency firing. What are the three recognized modes of vesicle recycling, and when does each predominate?",
    "options": {
      "A": "There is only one single mode of synaptic vesicle recycling — all vesicles throughout the nervous system are recycled through an identical clathrin-mediated endocytosis pathway",
      "B": "Synaptic vesicles are never recycled at all — new vesicles are synthesized de novo in the neuronal soma, packaged with neurotransmitter, and transported along the axon by kinesin motor proteins for each individual release event",
      "C": "The three modes are: (1) Kiss-and-run — the vesicle opens a transient fusion pore, releases transmitter, and reseals without full collapse, enabling the fastest recycling (~1s); (2) Clathrin-mediated endocytosis (CME) — after full vesicle collapse into the membrane, clathrin-coated pits form to retrieve membrane and proteins, taking ~15-30s; (3) Activity-dependent bulk endocytosis (ADBE) — during intense stimulation, large membrane invaginations are internalized and processed into new vesicles. Kiss-and-run predominates during low-frequency firing, CME during moderate activity, and ADBE during high-frequency bursts when CME cannot keep pace",
      "D": "Vesicle recycling occurs exclusively during prolonged periods of neural silence when no synaptic transmission is occurring, because the endocytic machinery requires a quiescent, unstimulated presynaptic membrane to assemble properly. During sustained high-frequency firing, all fusion-competent vesicles are expended without recycling, and transmission ceases entirely until a recovery period of silence allows the clathrin-coated pit machinery to reassemble and retrieve the fused vesicle membranes from the expanded plasma membrane. This activity-dependent pause in transmission explains the synaptic fatigue observed at many central synapses and the obligatory recovery periods between bursts of high-frequency firing"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.512822,
    "y": 0.598934,
    "z": 0.490799,
    "source_article": "synaptic vesicle recycling",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "synaptic vesicle recycling",
      "kiss-and-run",
      "clathrin-mediated endocytosis",
      "bulk endocytosis"
    ]
  },
  {
    "id": "06ad47e3bd9c3eae",
    "question_text": "The perineuronal net (PNN) is an extracellular matrix structure that surrounds specific neurons. What function does the PNN serve, and how does its formation relate to critical period plasticity?",
    "options": {
      "A": "Perineuronal nets are found equally and uniformly on every neuron type throughout the brain with no selectivity for any particular cell class, neurotransmitter phenotype, or cortical layer. The PNN matrix is deposited at equal density around excitatory pyramidal neurons, inhibitory interneurons, neuromodulatory neurons, and glial cells alike. The claim that PNNs preferentially surround fast-spiking parvalbumin-positive interneurons is based on sampling bias in early immunohistochemical studies that used antibodies with inadvertent selectivity for parvalbumin-expressing cells, and more comprehensive modern analyses using unbiased mass spectrometry-based proteomics have demonstrated uniform PNN distribution",
      "B": "Perineuronal nets are artifacts of histological fixation and staining procedures that do not exist in living brain tissue. The lattice-like structures observed in Wisteria floribunda agglutinin (WFA)-stained tissue sections are produced by chemical cross-linking of normally diffuse extracellular matrix components during aldehyde fixation, creating an artificial condensation of glycoproteins around high-activity neurons that generates spurious staining patterns. In vivo two-photon imaging of the extracellular space in awake behaving animals has never revealed any PNN-like structures in living cortex, confirming that they are fixation artifacts without any functional significance",
      "C": "Perineuronal nets provide exclusively mechanical protection against physical brain trauma, cushioning neurons during impacts and preventing axonal shearing during rapid head acceleration and deceleration events. PNNs have no role whatsoever in regulating synaptic plasticity, critical period timing, memory consolidation, or any other neural circuit function. Their composition of proteoglycans and hyaluronan gives them shock-absorbing viscoelastic properties similar to articular cartilage, and they are concentrated around the most mechanically vulnerable neurons in cortical areas that experience the greatest physical deformation during traumatic head impacts",
      "D": "PNNs are composed of chondroitin sulfate proteoglycans (CSPGs), hyaluronan, tenascin-R, and link proteins that condense around fast-spiking parvalbumin-positive (PV+) interneurons during postnatal development. Their formation coincides with critical period closure — the transition from highly plastic juvenile circuits to stable adult circuits. PNNs physically restrict synaptic remodeling by preventing new synapse formation and stabilizing existing ones. Enzymatic degradation of PNNs (chondroitinase ABC) reopens critical period-like plasticity in adult cortex, providing a potential therapeutic target for recovery from amblyopia and spinal cord injury"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.503943,
    "y": 0.55858,
    "z": 0.455433,
    "source_article": "perineuronal nets",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "perineuronal nets",
      "critical period plasticity",
      "PV+ interneurons",
      "chondroitin sulfate proteoglycans"
    ]
  },
  {
    "id": "e372e6f3703c7a54",
    "question_text": "Dendrites were traditionally considered passive cables, but active dendritic spikes have been discovered in many neuron types. What is the functional significance of dendritic sodium and calcium spikes for neural computation?",
    "options": {
      "A": "Dendritic spikes allow individual dendritic branches to act as semi-independent computational units — local regenerative events (Na+ and Ca2+ spikes) amplify clustered synaptic inputs on the same branch, enabling coincidence detection and nonlinear input transformations that dramatically expand a single neuron's computational repertoire beyond simple weighted summation",
      "B": "Dendritic spikes have absolutely no effect on neural computation whatsoever and are purely epiphenomenal byproducts of passive electrical signal propagation through the dendritic tree — they do not amplify synaptic inputs, do not enable coincidence detection, do not contribute to nonlinear input transformations, and do not expand a neuron's computational repertoire beyond the simplest possible weighted linear summation model",
      "C": "Dendritic sodium and calcium spikes occur exclusively in invertebrate neurons such as those found in the squid giant axon, Aplysia abdominal ganglion, and Drosophila motor neurons, and they have never been observed, recorded, or even theoretically predicted to occur in any mammalian cortical neuron, hippocampal pyramidal cell, cerebellar Purkinje cell, or any other vertebrate central nervous system neuron type",
      "D": "Dendritic spikes decrease the computational capacity of neurons by causing all synaptic inputs arriving at any location on the entire dendritic tree to be treated identically and uniformly regardless of their spatial arrangement, temporal pattern, dendritic branch location, or distance from the soma — active dendritic properties eliminate all location-dependent processing that would otherwise exist in a passive cable model"
    },
    "correct_answer": "A",
    "difficulty": 1,
    "x": 0.52458,
    "y": 0.58593,
    "z": 0.234419,
    "source_article": "dendritic spikes",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "dendritic spikes",
      "dendritic computation",
      "active dendrites"
    ]
  },
  {
    "id": "d69d7b32ac25b5cf",
    "question_text": "Gap junctions (electrical synapses) connect neurons via connexin hemichannels that allow direct ionic current flow. What functional property do gap junctions provide that chemical synapses cannot?",
    "options": {
      "A": "Gap junctions provide bidirectional, virtually instantaneous electrical coupling between neurons — current flows directly from cytoplasm to cytoplasm with no synaptic delay, enabling rapid synchronization of connected neurons' membrane potentials, which is critical for generating precisely coordinated oscillatory activity in interneuron networks and for synchronizing metabolic states across coupled cell populations",
      "B": "Gap junctions are slower than chemical synapses and cannot transmit signals faster than diffusion",
      "C": "Gap junctions exist only between glial cells and never link neurons in any brain region",
      "D": "Gap junctions transmit only inhibitory signals and cannot support any form of excitatory coupling"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.505485,
    "y": 0.631822,
    "z": 0.217277,
    "source_article": "gap junctions",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "gap junctions",
      "electrical synapses",
      "neural synchronization"
    ]
  },
  {
    "id": "4dd6f03783ef1ae4",
    "question_text": "Endocannabinoids are retrograde signaling molecules released from postsynaptic neurons that act on presynaptic CB1 receptors. What role does this retrograde signaling play in synaptic regulation?",
    "options": {
      "A": "Endocannabinoids are synthesized and released from the postsynaptic neuron only when it is completely silent, inactive, and hyperpolarized well below firing threshold — strong postsynaptic depolarization, action potential firing, calcium influx, and all other forms of neural activity completely suppress endocannabinoid synthesis and release, meaning these retrograde messengers signal exclusively during periods of quiescence rather than activity",
      "B": "Endocannabinoids serve exclusively as neurotrophic growth factors for axonal development and dendritic branching during embryonic nervous system formation, and they have absolutely no role in regulating neurotransmitter release, modulating synaptic transmission, mediating short-term or long-term synaptic plasticity, or any other aspect of mature synaptic function in the adult brain under any physiological or pathological conditions whatsoever",
      "C": "Endocannabinoid retrograde signaling allows postsynaptic neurons to regulate their own inputs — when the postsynaptic neuron is strongly depolarized, it synthesizes and releases endocannabinoids that travel backward across the synapse to activate presynaptic CB1 receptors, suppressing further neurotransmitter release and thereby implementing a negative feedback mechanism (depolarization-induced suppression of inhibition/excitation)",
      "D": "Endocannabinoids act only on postsynaptic receptors and never signal retrogradely to the presynaptic terminal"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.53503,
    "y": 0.603498,
    "z": 0.364202,
    "source_article": "endocannabinoid signaling",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "endocannabinoid signaling",
      "retrograde messengers",
      "DSI/DSE"
    ]
  },
  {
    "id": "f77edce430c0ccbe",
    "question_text": "Neurotrophins (NGF, BDNF, NT-3, NT-4) are signaling molecules critical for neural survival and plasticity. What is the 'neurotrophic hypothesis' and how does BDNF specifically influence synaptic plasticity in the adult brain?",
    "options": {
      "A": "Neurotrophins are released exclusively and only during the embryonic developmental period and have absolutely no function whatsoever in the adult brain — once neural circuits are established during development, BDNF, NGF, NT-3, and NT-4 are completely downregulated and play no role in adult synaptic plasticity, long-term potentiation, dendritic remodeling, spine morphogenesis, memory formation, or any other form of experience-dependent neural modification in the mature nervous system",
      "B": "BDNF exclusively suppresses and weakens synaptic transmission at every single synapse where it acts in the brain, and it uniformly and completely inhibits the induction of any form of long-term potentiation — it has absolutely no role in facilitating synaptic strengthening, promoting dendritic growth and branching processes, supporting spine morphogenesis and stabilization, enabling protein synthesis-dependent late-LTP, or any other form of synaptic enhancement or neural plasticity in any brain region at any age",
      "C": "All four neurotrophins (nerve growth factor, brain-derived neurotrophic factor, neurotrophin-3, and neurotrophin-4) are completely identical proteins encoded by the exact same single gene that share the identical amino acid sequence, identical three-dimensional protein folding structure, identical receptor binding profile and binding affinity constants, identical downstream intracellular signaling cascades, identical target cell populations, and identical developmental and adult expression patterns and physiological functions",
      "D": "The neurotrophic hypothesis proposes that developing neurons compete for limited quantities of target-derived trophic factors, and those that fail to obtain sufficient support undergo apoptosis — in the adult brain, BDNF acts as an activity-dependent modulator of synaptic strength, being released in response to neural activity and facilitating LTP induction, dendritic growth, spine morphogenesis, and the conversion of early-LTP to late-LTP through protein synthesis signaling"
    },
    "correct_answer": "D",
    "difficulty": 2,
    "x": 0.545918,
    "y": 0.557519,
    "z": 0.431708,
    "source_article": "neurotrophic hypothesis",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "neurotrophic hypothesis",
      "BDNF",
      "activity-dependent plasticity"
    ]
  },
  {
    "id": "61a05b13f9d3987b",
    "question_text": "Wallerian degeneration describes the stereotyped process of axon degeneration distal to an injury site. What are its key stages, and what is the surprising finding about its molecular mechanism?",
    "options": {
      "A": "Following axonal injury, the distal segment undergoes a rapid, active self-destruction program — the axon initially remains electrically excitable for 1-2 days, then undergoes rapid granular fragmentation mediated by an active molecular program involving SARM1 (a NAD+ hydrolase), followed by Schwann cell/macrophage clearance of debris, demonstrating that axon degeneration is an actively executed process rather than passive wasting",
      "B": "Following axonal injury, the distal segment immediately and passively withers away through simple metabolic starvation due to disconnection from the cell body — there is no active molecular self-destruction program, no involvement of SARM1 or NAD+ depletion, no organized fragmentation sequence, no Schwann cell response, no macrophage infiltration, and no phagocytic clearance mechanism, just a slow passive decay process identical to tissue necrosis in any other organ system",
      "C": "Wallerian degeneration affects only the proximal segment of a severed axon (the portion still connected to the cell body and soma), while the distal segment that is disconnected from the cell body remains completely intact, electrically excitable, and functionally normal indefinitely without any degradation, fragmentation, clearance by surrounding glial cells, or infiltrating immune cells at any time point following the initial injury",
      "D": "Axons cannot degenerate and all neural injuries are permanent without any cellular response or cleanup mechanism"
    },
    "correct_answer": "A",
    "difficulty": 3,
    "x": 0.471222,
    "y": 0.602455,
    "z": 0.886858,
    "source_article": "Wallerian degeneration",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "Wallerian degeneration",
      "SARM1",
      "active axon degeneration"
    ]
  },
  {
    "id": "15eb99f2c9fde9fe",
    "question_text": "Axonal transport is essential for moving proteins, organelles, and signaling molecules between the soma and synaptic terminals. What are the two molecular motors responsible for anterograde and retrograde transport, and why is disruption of transport pathogenic?",
    "options": {
      "A": "All axonal transport uses only diffusion with no molecular motors",
      "B": "Kinesin motors transport cargo anterogradely (soma to terminal) along microtubules, while dynein motors transport cargo retrogradely (terminal to soma) — disruption of axonal transport is pathogenic because it prevents delivery of synaptic vesicle precursors and mitochondria to terminals and blocks retrograde signaling of survival factors like neurotrophins, contributing to axonal degeneration in diseases such as ALS, Alzheimer's, and Huntington's",
      "C": "Both anterograde and retrograde transport use the same motor (actin) with no distinction between directions",
      "D": "Shallow processing of surface-level perceptual features such as letter font, case, ink color, and visual appearance always produces substantially better and more durable long-term memory than deep semantic processing involving meaningful elaboration, self-referential encoding, categorical organization, or relational processing, because surface-level perceptual features create more distinctive, more stable, more accessible, and more interference-resistant memory traces at every retention interval ever tested in any paradigm"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.450298,
    "y": 0.629383,
    "z": 0.744585,
    "source_article": "axonal transport",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "axonal transport",
      "kinesin",
      "dynein",
      "neurodegeneration"
    ]
  },
  {
    "id": "b8e29f1cfd7a5cc6",
    "question_text": "The cortex is organized into six layers with distinct cell types and connectivity patterns. What is the canonical cortical microcircuit, and how do inputs and outputs map onto specific layers?",
    "options": {
      "A": "All six cortical layers receive completely identical thalamic inputs, process information in exactly the same way, and project to precisely the same downstream targets with absolutely no laminar specialization, no layer-specific connectivity patterns, no differential cell type distribution, and no functional differences between superficial layers II/III and deep layers V/VI in terms of their inputs, outputs, or computational roles within the canonical cortical microcircuit",
      "B": "Thalamic sensory inputs arrive exclusively in layer I (the molecular layer) of the cerebral cortex, which contains the primary thalamocortical recipient neurons, and all cortical output to subcortical structures, other cortical areas, the spinal cord, brainstem motor nuclei, and the thalamus itself originates exclusively from layer VI, with layers II through V serving no input or output function and containing only passive support cells",
      "C": "Thalamic inputs arrive primarily in layer IV (internal granular layer), which projects to superficial layers II/III for local and corticocortical processing, while layer V projects to subcortical targets (striatum, brainstem, spinal cord) and layer VI projects back to the thalamus — this stereotyped laminar organization creates a canonical processing circuit that is conserved across cortical areas despite functional specialization",
      "D": "The six-layer laminar organization of the cerebral cortex is found only in the primary visual cortex (V1/area 17) and is completely absent from all other cortical areas including auditory cortex, somatosensory cortex, motor cortex, prefrontal cortex, temporal association cortex, and parietal association cortex — these non-visual areas lack any discernible laminar structure and contain neurons arranged in a completely random and unorganized fashion"
    },
    "correct_answer": "C",
    "difficulty": 2,
    "x": 0.512982,
    "y": 0.53021,
    "z": 0.386341,
    "source_article": "cortical layers",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "cortical layers",
      "canonical microcircuit",
      "laminar organization"
    ]
  },
  {
    "id": "e6fb675bd746a80b",
    "question_text": "Central pattern generators (CPGs) are neural circuits that produce rhythmic motor patterns without sensory feedback or descending commands. What is the minimal circuit mechanism that can generate rhythmic alternating activity?",
    "options": {
      "A": "Central pattern generators require continuous moment-to-moment sensory feedback from muscle spindles, Golgi tendon organs, joint receptors, and cutaneous mechanoreceptors to produce any rhythmic motor output — without this proprioceptive and tactile feedback, CPG circuits are completely incapable of generating even a single cycle of rhythmic alternating activity, as the neural circuitry contains no intrinsic oscillatory mechanism and relies entirely on peripheral input for pattern generation",
      "B": "A single isolated neuron with absolutely no synaptic connections to any other neuron is capable of generating all known rhythmic motor patterns including locomotion, respiration, mastication, and swallowing through purely intrinsic membrane properties alone — no network interactions, no reciprocal inhibition, no half-center oscillator architecture, and no population-level dynamics of any kind are needed for the generation of complex rhythmic motor behaviors in any vertebrate species",
      "C": "Rhythmic locomotor behavior is generated entirely by the skeletal muscles and connective tissues of the limbs themselves through their intrinsic mechanical resonance properties, with no neural circuit involvement, no motor neuron patterning, no central pattern generator, no spinal cord circuitry, and no descending brain commands contributing to the production or timing of any rhythmic movement pattern in any animal",
      "D": "Half-center oscillators — two reciprocally inhibiting neuron groups where each group suppresses the other, combined with a mechanism for escape from inhibition (such as spike-frequency adaptation, post-inhibitory rebound, or synaptic depression) — create alternating bursts of activity that underlie locomotion, respiration, and other rhythmic behaviors without requiring patterned input"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.49753,
    "y": 0.569743,
    "z": 0.544767,
    "source_article": "central pattern generators",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "central pattern generators",
      "half-center oscillators",
      "rhythmic circuits"
    ]
  },
  {
    "id": "4fc648380fb167d5",
    "question_text": "Ion channel diversity is remarkable — a single neuron may express dozens of different channel types. What principle explains why neurons express such a diverse repertoire of ion channels rather than relying on just a few types?",
    "options": {
      "A": "Different ion channel types have distinct voltage dependencies, kinetics, ion selectivities, and modulation properties — this diversity enables neurons to generate the specific firing patterns (tonic, bursting, fast-spiking, accommodating, etc.) required for their circuit function, with the precise ratio of channel expression determining a neuron's computational identity, and different cell types using different channel cocktails to achieve their characteristic electrophysiological signatures",
      "B": "All ion channels expressed in neurons are functionally identical and completely interchangeable with no differences in voltage dependence, activation kinetics, inactivation kinetics, ion selectivity, conductance magnitude, pharmacological sensitivity, modulation by intracellular signaling cascades, temperature sensitivity, or any other biophysical property — replacing one channel type with any other would have absolutely no measurable effect on neuronal firing patterns, excitability, or circuit function",
      "C": "Ion channel diversity is a phenomenon that exists exclusively and only in invertebrate neurons such as those found in the sea slug Aplysia californica, the squid giant axon preparation, the lobster stomatogastric ganglion neural circuits, and the fruit fly Drosophila melanogaster, while mammalian neurons express only one single type of voltage-gated sodium channel and one single type of voltage-gated potassium channel with no molecular diversity, no alternative splicing variants, no subfamily members, and no differential expression",
      "D": "Ion channel diversity exists only in invertebrates and mammalian neurons express only one type of sodium and one type of potassium channel"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.495085,
    "y": 0.616921,
    "z": 0.405312,
    "source_article": "ion channel diversity",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "ion channel diversity",
      "firing patterns",
      "cell-type identity"
    ]
  },
  {
    "id": "e2a7ee908ac2a547",
    "question_text": "The neuromuscular junction uses acetylcholine, but central synapses use a wide variety of neurotransmitters. What is Dale's principle, and how has the modern understanding of co-transmission modified it?",
    "options": {
      "A": "Dale's principle states that each anatomically defined brain region uses exactly one specific neurotransmitter that is shared identically by every single neuron located within that region's boundaries — all neurons in a given brain area release the exact same transmitter regardless of their cell type, projection target, or functional role, and the transmitter identity of any individual neuron can be perfectly predicted from its anatomical location alone with no exceptions",
      "B": "Dale's principle (as modernized by Eccles) states that a neuron releases the same transmitter(s) at all of its synaptic terminals — but co-transmission research has shown that most neurons release multiple transmitters (classical transmitter plus neuropeptides, or GABA plus glycine), meaning the principle applies to consistency across terminals of one neuron rather than one-transmitter-per-neuron, and the ratio of co-released transmitters can itself be activity-dependent",
      "C": "Co-transmission (the simultaneous release of two or more different neurotransmitters from a single neuron at a single axon terminal) has never been observed in any preparation, any species, any brain region, or any experimental paradigm in the entire history of neuroscience research — every neuron in both the central and peripheral nervous system releases only one single neurotransmitter molecule at a time, with no co-release of neuropeptides, purines, gases, or any other signaling molecule ever",
      "D": "Dale's principle applies only to invertebrate nervous systems and has no relevance to mammalian neurobiology"
    },
    "correct_answer": "B",
    "difficulty": 3,
    "x": 0.512201,
    "y": 0.622713,
    "z": 0.395378,
    "source_article": "Dale's principle",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "Dale's principle",
      "co-transmission",
      "neurotransmitter release"
    ]
  },
  {
    "id": "2eb20646284560e2",
    "question_text": "Synaptic tagging and capture is a model explaining how synapse-specific late long-term potentiation (L-LTP) can occur when plasticity-related proteins (PRPs) are synthesized in the soma. What is the 'tag' and how does capture work?",
    "options": {
      "A": "The synaptic tag is set by physically removing weak, inactive synapses from the neuron's dendritic tree through rapid pruning and retraction of the entire dendritic spine and postsynaptic density — tagging is not a molecular marking process that allows subsequent protein capture but rather a destructive elimination process that permanently deletes the synapse, reducing the total number of synaptic connections on the neuron rather than selectively strengthening particular synapses through late-LTP consolidation",
      "B": "Synaptic tagging involves physically removing weak synapses from the neuron",
      "C": "The synaptic tag is a transient molecular mark set at a recently activated synapse — strong stimulation of one synapse triggers somatic protein synthesis of plasticity-related proteins that are shipped cell-wide, but only tagged synapses 'capture' these proteins and convert early-LTP to late-LTP, explaining how synapse specificity is maintained despite cell-wide protein distribution, and allowing a weakly stimulated synapse to benefit from a strongly stimulated synapse on the same neuron",
      "D": "Capture refers to the presynaptic neuron capturing neurotransmitter from the synaptic cleft"
    },
    "correct_answer": "C",
    "difficulty": 4,
    "x": 0.563963,
    "y": 0.592149,
    "z": 0.627504,
    "source_article": "synaptic tagging",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "synaptic tagging",
      "late-LTP",
      "protein capture"
    ]
  },
  {
    "id": "1c3910d723b033bb",
    "question_text": "The neural crest is a transient embryonic cell population that gives rise to an extraordinary range of derivatives. What distinguishes neural crest cells from other progenitor populations, and what neurobiological structures do they form?",
    "options": {
      "A": "Neural crest cells arise exclusively from within the central neural tube itself rather than at the border of the neural plate and epidermis, and they produce only neurons and glia of the central nervous system including the brain and spinal cord — they have absolutely no peripheral derivatives, do not undergo epithelial-to-mesenchymal transition, do not migrate from their site of origin, and do not contribute to the peripheral nervous system, melanocytes, craniofacial skeleton, or adrenal medulla",
      "B": "The neural crest is a permanent anatomical structure that persists throughout adult life and continuously produces new neurons, glia, and connective tissue cells at a constant rate from birth through old age — it is not a transient embryonic cell population but rather a lifelong stem cell niche that remains active and generates new neural crest-derived cells indefinitely, functioning as the primary source of adult neurogenesis throughout the entire nervous system",
      "C": "Neural crest is a permanent adult structure that continuously produces new neurons throughout life",
      "D": "Neural crest cells arise at the border of the neural plate and epidermis during neurulation, then undergo epithelial-to-mesenchymal transition and migrate extensively throughout the embryo — they give rise to the entire peripheral nervous system (sensory, autonomic, and enteric neurons and glia), melanocytes, craniofacial skeleton, and adrenal medulla, making them the most versatile and migratory progenitor population in vertebrate development"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.435939,
    "y": 0.541644,
    "z": 0.378115,
    "source_article": "neural crest",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "neural crest",
      "PNS development",
      "epithelial-mesenchymal transition"
    ]
  },
  {
    "id": "c20b805766b53985",
    "question_text": "Nociception (pain signaling) involves distinct fiber types with different properties. What distinguishes Aδ fibers from C fibers in pain transmission, and how does the gate control theory explain modulation of pain perception?",
    "options": {
      "A": "Aδ fibers are thinly myelinated and conduct sharp, well-localized 'first pain' rapidly, while C fibers are unmyelinated and conduct dull, diffuse 'second pain' slowly — the gate control theory (Melzack & Wall, 1965) proposes that large-diameter mechanoreceptor (Aβ) fiber activity inhibits pain transmission at the spinal cord dorsal horn via inhibitory interneurons, explaining why rubbing an injury reduces pain by 'closing the gate' to nociceptive signals",
      "B": "Both Aδ and C fibers transmit pain at identical speeds with no difference in pain quality or timing",
      "C": "The gate control theory proposes that all pain signals bypass the spinal cord and travel directly to the cortex",
      "D": "C fibers are the fastest conducting fibers in the nervous system, faster than any myelinated fiber type"
    },
    "correct_answer": "A",
    "difficulty": 2,
    "x": 0.482358,
    "y": 0.6143,
    "z": 0.40724,
    "source_article": "nociception",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "nociception",
      "Aδ vs C fibers",
      "gate control theory"
    ]
  },
  {
    "id": "721a03fdd9339a8f",
    "question_text": "Neuromodulators (dopamine, serotonin, norepinephrine, acetylcholine) differ fundamentally from fast neurotransmitters (glutamate, GABA) in their mode of action. What is the key distinction in how neuromodulators influence neural circuits?",
    "options": {
      "A": "Neuromodulators including dopamine, serotonin, norepinephrine, and acetylcholine operate through completely identical mechanisms as fast neurotransmitters like glutamate and GABA, with absolutely no difference in timescale of action, receptor type, downstream signaling cascade, mode of release, spatial specificity, or effect on target neuron properties — metabotropic and ionotropic receptor signaling are functionally identical, and modulation versus transmission is a distinction without any real physiological difference",
      "B": "Neuromodulators act through metabotropic (G-protein-coupled) receptors to alter the intrinsic excitability, synaptic efficacy, and gain of neurons over slow timescales (seconds to minutes) — rather than directly opening ion channels for fast point-to-point transmission, they reconfigure the operating state of entire circuits by modifying ion channel properties, synaptic plasticity rules, and network dynamics, enabling the same anatomical circuit to produce different outputs depending on neuromodulatory state",
      "C": "Neuromodulators act only during sleep and have no function during waking behavior",
      "D": "Fast neurotransmitters like glutamate act more slowly than neuromodulators like dopamine"
    },
    "correct_answer": "B",
    "difficulty": 1,
    "x": 0.532247,
    "y": 0.605889,
    "z": 0.356743,
    "source_article": "neuromodulation",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "neuromodulation",
      "metabotropic receptors",
      "circuit reconfiguration"
    ]
  },
  {
    "id": "52d4b10e738f0f52",
    "question_text": "The suprachiasmatic nucleus (SCN) is the master circadian pacemaker. What molecular mechanism generates the ~24-hour oscillation, and how does the SCN synchronize peripheral clocks throughout the body?",
    "options": {
      "A": "Muscle spindles and Golgi tendon organs encode completely identical proprioceptive information about the musculoskeletal system and are fully functionally interchangeable sensory receptors — both detect exactly the same aspects of muscle length, both detect the exact same aspects of muscle tension, both detect rate of stretch, and both signal through the same afferent fiber types with the same conduction velocities and the same central projection patterns, providing entirely redundant information",
      "B": "All proprioceptors responsible for detecting body position, joint angle, muscle length, and limb movement speed are located exclusively in the skin surface and joint capsules, with absolutely no specialized sensory receptors located within the muscle belly, muscle spindle organ, musculotendinous junction, or any other intramuscular or tendinous structure — proprioceptive information comes entirely from cutaneous and articular mechanoreceptors rather than from any receptor embedded within muscles or tendons",
      "C": "The SCN produces circadian rhythms through transcription-translation feedback loops (TTFLs) — CLOCK/BMAL1 activate transcription of Period/Cryptochrome genes whose protein products accumulate, form complexes, and inhibit their own transcription, creating an autonomous ~24h oscillation that is entrained to light via retinohypothalamic tract input, with the SCN synchronizing peripheral tissue clocks through neural projections, hormonal signals (cortisol, melatonin), and body temperature rhythms",
      "D": "All cells in the body have identical clock gene expression with no hierarchy and no master pacemaker"
    },
    "correct_answer": "C",
    "difficulty": 3,
    "x": 0.506393,
    "y": 0.578876,
    "z": 0.624077,
    "source_article": "circadian rhythms",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "circadian rhythms",
      "SCN",
      "transcription-translation feedback loops"
    ]
  },
  {
    "id": "0f399ac45d2535ec",
    "question_text": "Oligodendrocytes in the CNS and Schwann cells in the PNS both produce myelin, but they differ in important ways. What is a key structural and regenerative difference between these two myelinating glia?",
    "options": {
      "A": "There is absolutely no structural, functional, developmental, or regenerative difference between oligodendrocytes and Schwann cells — they are the exact same cell type simply given different names based on their anatomical location in the CNS versus PNS, with identical gene expression profiles, identical myelination patterns, identical numbers of axon segments wrapped, identical inhibitory molecule expression, and identical capacity to support or prevent axonal regeneration after injury",
      "B": "Both cell types myelinate exactly one axon segment and produce identical regenerative environments",
      "C": "Schwann cells myelinate CNS axons and oligodendrocytes myelinate PNS axons",
      "D": "A single oligodendrocyte myelinates multiple axon segments (up to ~50 internodes on different axons), while each Schwann cell wraps a single internode on one axon — critically, Schwann cells support robust peripheral nerve regeneration by forming tubes (bands of Büngner) that guide regrowing axons, while oligodendrocytes create an inhibitory environment (Nogo, MAG) that limits CNS axon regeneration after injury"
    },
    "correct_answer": "D",
    "difficulty": 4,
    "x": 0.41,
    "y": 0.575932,
    "z": 0.277226,
    "source_article": "myelinating glia",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "myelinating glia",
      "oligodendrocytes vs Schwann cells",
      "CNS regeneration failure"
    ]
  },
  {
    "id": "aa82fe10e5e21960",
    "question_text": "Metaplasticity refers to plasticity of synaptic plasticity itself — the activity history of a synapse influences its subsequent capacity for LTP or LTD. How does this relate to the BCM sliding threshold and what biological function does it serve?",
    "options": {
      "A": "Metaplasticity implements the BCM sliding threshold at the molecular level — prior strong activity raises the LTP threshold (making subsequent LTP harder and LTD easier), while prior low activity lowers it (making LTP easier), primarily through activity-dependent changes in NMDA receptor subunit composition (GluN2A/GluN2B ratio) and CaMKII autophosphorylation state, serving to maintain synaptic weights within a functional range and prevent saturation",
      "B": "Metaplasticity means that the capacity of a synapse for long-term potentiation or long-term depression is completely random and unpredictable with absolutely no dependence on the synapse's prior activity history, the postsynaptic neuron's recent firing rate, NMDA receptor subunit composition, CaMKII phosphorylation state, or any other molecular or physiological variable — each plasticity induction event is entirely independent of all previous events at that synapse",
      "C": "Metaplasticity occurs only in developing brains and has no function in adult neural circuits",
      "D": "The BCM theory and metaplasticity are unrelated concepts from different fields of study"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.582906,
    "y": 0.570096,
    "z": 0.378642,
    "source_article": "metaplasticity",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "metaplasticity",
      "BCM theory",
      "NMDA receptor regulation"
    ]
  },
  {
    "id": "e8570627a4e9079a",
    "question_text": "The blood-brain barrier is formed by specialized endothelial cells with tight junctions. How do nutrients essential for brain function, such as glucose and amino acids, cross this barrier despite its restrictive nature?",
    "options": {
      "A": "All nutrients cross the BBB by simple passive diffusion through the lipid bilayer without any transporters",
      "B": "Glucose and amino acids cross the BBB via specific transporter proteins — GLUT1 (glucose transporter 1) carries glucose through facilitated diffusion across endothelial cell membranes, while LAT1 (large neutral amino acid transporter 1) carries essential amino acids, and transferrin receptors mediate iron uptake through receptor-mediated transcytosis, demonstrating that the BBB is selectively permeable rather than absolutely impermeable",
      "C": "Nutrients cannot cross the BBB and the brain relies entirely on stored energy reserves from birth",
      "D": "The BBB has large pores that allow free passage of all blood-borne substances including pathogens and toxins"
    },
    "correct_answer": "B",
    "difficulty": 2,
    "x": 0.455987,
    "y": 0.586031,
    "z": 0.397101,
    "source_article": "blood-brain barrier transport",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "blood-brain barrier transport",
      "GLUT1",
      "selective permeability"
    ]
  },
  {
    "id": "c4c2afc9522e66dd",
    "question_text": "Hebbian plasticity requires coincident pre- and postsynaptic activity. What is the role of the NMDA receptor as a molecular coincidence detector in LTP induction?",
    "options": {
      "A": "The NMDA receptor is not involved in long-term potentiation, synaptic plasticity, or learning and memory of any kind — it plays absolutely no role in coincidence detection, Hebbian plasticity induction, calcium signaling at synapses, spine morphological changes, or any other form of activity-dependent synaptic modification in the hippocampus, cortex, amygdala, cerebellum, or any other brain region in any species at any developmental stage",
      "B": "NMDA receptors open in response to postsynaptic membrane depolarization alone with absolutely no requirement for presynaptic glutamate binding, ligand activation, or any form of neurotransmitter release — the channel is a purely voltage-gated conductance that detects only postsynaptic activity, making it incapable of serving as a coincidence detector for simultaneous pre- and postsynaptic activity as proposed by Hebb's rule of associative learning",
      "C": "The NMDA receptor is unique because it requires two simultaneous conditions to open: glutamate binding (indicating presynaptic activity) AND postsynaptic depolarization (to relieve the Mg2+ block of the channel pore) — only when both conditions are met does Ca2+ flow through the channel, triggering intracellular signaling cascades that strengthen the synapse, making the NMDA receptor a molecular implementation of Hebb's rule",
      "D": "The magnesium block of the NMDA receptor channel pore is completely permanent and irreversible under all physiological conditions — no amount of postsynaptic membrane depolarization, no concentration of extracellular magnesium, no modulatory signal, and no experimental manipulation can ever relieve the Mg2+ block to allow calcium ions to flow through the NMDA receptor channel, making the receptor permanently non-functional after its initial assembly in the membrane"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.59,
    "y": 0.593805,
    "z": 0.427997,
    "source_article": "NMDA receptor",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "NMDA receptor",
      "coincidence detection",
      "LTP mechanism"
    ]
  },
  {
    "id": "515e88e2a13b8435",
    "question_text": "Proprioception — the sense of body position and movement — relies on specialized mechanoreceptors in muscles and joints. What are muscle spindles and Golgi tendon organs, and what distinct information do they encode?",
    "options": {
      "A": "Muscle spindles and Golgi tendon organs encode identical information and are functionally interchangeable",
      "B": "Proprioceptors exist only in the skin and joints, with no receptors located within muscles or tendons",
      "C": "Proprioception is entirely visual — the body uses only eyesight to determine limb position with no somatosensory contribution",
      "D": "Muscle spindles are intrafusal fiber receptors that detect muscle length and rate of length change (stretch), with Ia afferents signaling dynamic stretch velocity and II afferents signaling static length — while Golgi tendon organs in the musculotendinous junction detect muscle tension (force) via Ib afferents, providing complementary information about position (spindles) and force (GTOs) that together enable accurate proprioceptive awareness and motor control"
    },
    "correct_answer": "D",
    "difficulty": 3,
    "x": 0.461852,
    "y": 0.61574,
    "z": 0.509871,
    "source_article": "proprioception",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "proprioception",
      "muscle spindles",
      "Golgi tendon organs"
    ]
  },
  {
    "id": "c0dadaa252b10b6d",
    "question_text": "The complement system, traditionally associated with peripheral immunity, has been found to play a surprising role in the developing brain. What is 'complement-mediated synaptic pruning' and why is its dysregulation pathologically significant?",
    "options": {
      "A": "Complement proteins (C1q, C3) tag weak or inappropriate synapses for elimination by microglia during developmental refinement — this process is essential for sculpting mature neural circuits from an initial overabundance of connections, but aberrant complement-mediated pruning in the adult brain has been implicated in excessive synapse loss in Alzheimer's disease, schizophrenia, and frontotemporal dementia, suggesting that reactivation of developmental pruning mechanisms contributes to neurodegeneration",
      "B": "The complement system has absolutely no function of any kind anywhere in the brain or central nervous system and operates exclusively in peripheral blood plasma, lymph nodes, the spleen, and other peripheral immune tissues and organs — complement proteins C1q, C3, C3b, iC3b, C4, and all of their downstream effector molecules are never expressed by any cell type within the central nervous system, are never deposited on synaptic membranes, and play absolutely no role in developmental synaptic pruning or neurodegeneration",
      "C": "Complement proteins C1q, C3, and all of their downstream signaling cascades and effector molecules exclusively promote new synapse formation, structural stabilization, functional maturation, growth, and long-term strengthening with absolutely no role whatsoever in synapse elimination, tagging for microglial removal, or facilitating phagocytosis of synaptic structures — the complement system in the brain acts solely as a powerful synaptogenic factor that increases total synaptic connection number throughout development",
      "D": "Synaptic pruning during brain development is performed entirely and exclusively by astrocytes acting alone through their perisynaptic processes, with absolutely no involvement of microglia, complement proteins, or any component of the innate or adaptive immune system — microglia are completely passive bystander cells in both the developing and mature adult brain that do not phagocytose synapses, do not respond to complement tagging, and do not contribute to any aspect of circuit refinement at any developmental stage"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.523294,
    "y": 0.51,
    "z": 0.315502,
    "source_article": "complement system",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "complement system",
      "synaptic pruning",
      "microglia"
    ]
  },
  {
    "id": "c318f3813162fd63",
    "question_text": "Channelopathies are diseases caused by mutations in ion channel genes. What is the molecular mechanism linking SCN1A sodium channel mutations to Dravet syndrome (severe myoclonic epilepsy of infancy)?",
    "options": {
      "A": "SCN1A sodium channel mutations cause Dravet syndrome by increasing inhibition throughout the brain, making all neurons substantially less excitable and thereby preventing the generation of seizures — loss-of-function mutations in Nav1.1 channels uniformly reduce the firing capacity of both excitatory pyramidal neurons and inhibitory interneurons to exactly the same degree, producing a balanced reduction in network activity that results in hypoexcitability rather than the hyperexcitability and seizures actually observed clinically",
      "B": "SCN1A mutations cause Dravet syndrome because they primarily affect inhibitory interneurons — loss-of-function mutations in the Nav1.1 sodium channel reduce interneuron excitability more than excitatory neuron excitability (because interneurons rely more heavily on Nav1.1), leading to disinhibition of excitatory circuits and resulting in seizures, demonstrating the counterintuitive principle that loss of sodium channel function can cause hyperexcitability through preferential impairment of inhibition",
      "C": "Dravet syndrome is not caused by any ion channel gene mutation, any genetic variant, or any form of channelopathy of any kind whatsoever — it results exclusively and entirely from gross structural brain malformations including focal cortical dysplasia, periventricular and subcortical neuronal heterotopia, bilateral polymicrogyria, and severely abnormal neuronal migration patterns that disrupt normal cortical circuit architecture and predispose to recurrent intractable seizures through purely structural mechanisms",
      "D": "All sodium channel mutations regardless of which specific channel subtype is affected (Nav1.1, Nav1.2, Nav1.3, Nav1.5, Nav1.6, Nav1.7, Nav1.8, or Nav1.9) cause completely identical clinical syndromes with exactly the same seizure types, exactly the same age of onset, the same clinical severity and prognosis, the same cognitive and developmental outcomes, and the same pharmacological response to every antiepileptic medication — there is absolutely no phenotype-genotype correlation in any sodium channelopathy"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.508758,
    "y": 0.606005,
    "z": 0.678298,
    "source_article": "channelopathies",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "channelopathies",
      "Dravet syndrome",
      "inhibitory interneuron dysfunction"
    ]
  },
  {
    "id": "1e5233232c2ac15a",
    "question_text": "Neurotransmitter transporters on the presynaptic membrane terminate synaptic signaling by reuptaking released transmitter. Why are these transporters the targets of many psychoactive drugs, and what happens when reuptake is blocked?",
    "options": {
      "A": "Blocking reuptake decreases transmitter concentration in the synapse and reduces signaling strength",
      "B": "Reuptake transporters are not targets of any known psychoactive drug",
      "C": "Blocking reuptake transporters increases transmitter concentration and duration of action in the synaptic cleft — SSRIs block serotonin reuptake (treating depression), cocaine blocks dopamine/norepinephrine reuptake (producing euphoria and addiction), and methylphenidate blocks dopamine/norepinephrine reuptake (treating ADHD), demonstrating that the timing and concentration of neurotransmitter clearance is a critical control point for modulating synaptic signaling strength and duration",
      "D": "All neurotransmitters are cleared exclusively by enzymatic degradation with no reuptake mechanism"
    },
    "correct_answer": "C",
    "difficulty": 1,
    "x": 0.547137,
    "y": 0.621556,
    "z": 0.495955,
    "source_article": "neurotransmitter reuptake",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "neurotransmitter reuptake",
      "SSRIs",
      "drug mechanisms"
    ]
  },
  {
    "id": "c97fe257b901e50e",
    "question_text": "The discovery of mirror neurons in macaque premotor cortex sparked enormous interest and debate. What do mirror neurons do, and what is the main scientific criticism of their proposed role in understanding others' actions?",
    "options": {
      "A": "Mirror neurons fire both when a macaque monkey performs a goal-directed action and when it observes the same action performed by another individual — they were initially proposed as the neural basis for action understanding, imitation learning, and empathy, but the principal scientific criticism is that correlational firing during observation does not prove these neurons are causally necessary for understanding the meaning of others' actions, since the observed activity might instead reflect motor preparation, sensory prediction, learned associations, or statistical regularities",
      "B": "Mirror neurons have been found exclusively in human brains through non-invasive neuroimaging techniques such as functional magnetic resonance imaging and electroencephalography, and they have never been directly recorded or identified using single-unit electrophysiology in any non-human primate species whatsoever including macaque monkeys — the original discovery by Rizzolatti and colleagues in Parma was based entirely on human neuroimaging data rather than on direct single-neuron recordings from the macaque premotor cortex",
      "C": "Mirror neurons are located exclusively in the visual cortex and respond only to visual stimuli",
      "D": "Mirror neurons fire both when an animal performs an action and when it observes the same action performed by another — they were proposed as the neural basis for action understanding, imitation, and empathy, but the main criticism is that correlational firing during observation doesn't prove the neurons are necessary for understanding (they might reflect motor preparation, prediction, or learned associations rather than genuine comprehension of others' intentions)"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.515418,
    "y": 0.571108,
    "z": 0.461672,
    "source_article": "mirror neurons",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "mirror neurons",
      "action understanding",
      "correlation vs causation"
    ]
  },
  {
    "id": "cce36098b89c0884",
    "question_text": "Astrocyte calcium signaling can modulate synaptic transmission through gliotransmitter release. What is the 'tripartite synapse' concept, and what evidence supports (and challenges) the idea that astrocytes actively regulate synaptic function?",
    "options": {
      "A": "The tripartite synapse concept holds that astrocytic processes wrapping synapses form a functional third partner beyond the pre- and postsynaptic neurons — astrocytes detect synaptic activity via neurotransmitter receptors, exhibit intracellular Ca2+ elevations, and release gliotransmitters (glutamate, D-serine, ATP) that modulate synaptic transmission and plasticity, though challenges include debate over whether IP3-mediated Ca2+ signals are fast enough to modulate individual synaptic events versus slower tonic regulation",
      "B": "The tripartite synapse concept has been universally rejected because astrocytes have no detectable calcium signals",
      "C": "Astrocytes are completely passive cells that provide only structural scaffolding with no signaling capability",
      "D": "Gliotransmission occurs only in vitro and has never been demonstrated in intact brain tissue"
    },
    "correct_answer": "A",
    "difficulty": 5,
    "x": 0.562352,
    "y": 0.593369,
    "z": 0.126789,
    "source_article": "tripartite synapse",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "tripartite synapse",
      "gliotransmission",
      "astrocyte calcium signaling"
    ]
  },
  {
    "id": "06ade23040ad53ef",
    "question_text": "Neuronal migration during cortical development follows a precisely orchestrated pattern. What is the 'inside-out' rule of cortical layer formation, and what happens when migration is disrupted?",
    "options": {
      "A": "Cortical layers are built in an outside-in sequence during embryonic development, with the most superficial layers (layers I and II) being formed first by the earliest-born neurons, and progressively deeper layers (III, IV, V, and VI) being formed by later-born neurons that settle beneath the existing cells without migrating past them — this means the deepest layer VI contains the youngest neurons and the most superficial layer II contains the oldest neurons, which is the exact reverse of the actual inside-out developmental sequence",
      "B": "Cortical layers are built in an inside-out sequence — the earliest-born neurons form the deepest layers (V, VI), while later-born neurons migrate past existing cells to form progressively more superficial layers (IV, III, II), using radial glia as scaffolds — disruption of this process (e.g., mutations in reelin, LIS1/PAFAH1B1) causes lissencephaly (smooth brain without normal gyration), periventricular heterotopia, or other cortical malformations associated with epilepsy and intellectual disability",
      "C": "All cortical neurons are born in their final position and no migration occurs during brain development",
      "D": "Migration disorders have no clinical consequences and the brain functions normally without proper layering"
    },
    "correct_answer": "B",
    "difficulty": 4,
    "x": 0.484696,
    "y": 0.537865,
    "z": 0.65421,
    "source_article": "cortical migration",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "cortical migration",
      "inside-out rule",
      "lissencephaly"
    ]
  },
  {
    "id": "67ce3a28565250d1",
    "question_text": "Autophagy is a cellular self-digestion process that degrades damaged organelles and aggregated proteins. Why is neuronal autophagy particularly critical, and what happens when it fails?",
    "options": {
      "A": "Autophagy is not needed in neurons because they never accumulate damaged proteins or organelles",
      "B": "Neurons are uniquely dependent on autophagy because they are post-mitotic cells that cannot dilute toxic protein aggregates through cell division, they are extremely long-lived (often surviving the entire lifespan of the organism), and they have enormous cytoplasmic volumes in their axons and dendrites requiring constant organelle quality control — but autophagy deficiency paradoxically enhances rather than impairs neuronal survival by preserving all cellular components including damaged ones indefinitely",
      "C": "Neurons are uniquely dependent on autophagy because they are post-mitotic (cannot dilute toxic aggregates through cell division), extremely long-lived, and have enormous cytoplasmic volumes in axons and dendrites requiring constant organelle quality control — failure of neuronal autophagy leads to accumulation of protein aggregates (tau, α-synuclein, huntingtin) and damaged mitochondria, directly contributing to Alzheimer's, Parkinson's, and Huntington's disease pathogenesis",
      "D": "Autophagy deficiency enhances neuronal survival by preserving all cellular components indefinitely"
    },
    "correct_answer": "C",
    "difficulty": 5,
    "x": 0.464775,
    "y": 0.593,
    "z": 0.752733,
    "source_article": "autophagy",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "autophagy",
      "neurodegeneration",
      "protein aggregation"
    ]
  },
  {
    "id": "6e2fb8231e1c96b0",
    "question_text": "The concept of 'critical periods' in neurodevelopment describes time windows during which experience has maximal impact on circuit formation. What molecular mechanisms open and close critical periods, using the visual system as a model?",
    "options": {
      "A": "Critical periods do not exist and the brain is equally plastic at all ages with no developmental windows",
      "B": "The visual cortex has no critical period and is equally modifiable by monocular deprivation at any age",
      "C": "Critical periods are determined entirely by the age of excitatory neurons with no involvement of inhibitory circuits",
      "D": "Critical periods are opened by the maturation of GABAergic inhibition (specifically parvalbumin-positive interneurons) and closed by molecular 'brakes' including perineuronal nets (extracellular matrix structures wrapping PV+ interneurons), myelin-associated inhibitors (Nogo receptor signaling), and epigenetic changes — these mechanisms explain why monocular deprivation causes amblyopia only during the critical period, and their removal in adults can partially reopen plasticity"
    },
    "correct_answer": "D",
    "difficulty": 5,
    "x": 0.527393,
    "y": 0.543751,
    "z": 0.575553,
    "source_article": "critical periods",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "critical periods",
      "PV interneurons",
      "perineuronal nets"
    ]
  },
  {
    "id": "bfeda31def613729",
    "question_text": "The enteric nervous system (ENS) can function autonomously, but it communicates bidirectionally with the CNS via the vagus nerve. What is the significance of the 'gut-brain axis' for CNS function?",
    "options": {
      "A": "The vagus nerve carries predominantly afferent (gut-to-brain) signals — approximately 80-90% of vagal fibers are sensory, transmitting information about gut microbiome metabolites, immune status, nutrient sensing, and enteroendocrine signals to brainstem nuclei (NTS) that influence mood, cognition, and behavior, providing a biological basis for how gut dysbiosis can affect anxiety, depression, and neuroinflammation through both neural and humoral pathways",
      "B": "The gut has no neural connection to the brain and communication occurs only through the bloodstream",
      "C": "The vagus nerve is purely motor and carries no sensory information from the gut to the brain",
      "D": "The gut-brain axis affects only digestion and has no influence on mood, cognition, or behavior"
    },
    "correct_answer": "A",
    "difficulty": 4,
    "x": 0.425998,
    "y": 0.5788,
    "z": 0.203304,
    "source_article": "gut-brain axis",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "gut-brain axis",
      "vagus nerve",
      "enteric-CNS communication"
    ]
  },
  {
    "id": "b31b449aa834f4cd",
    "question_text": "Epigenetic mechanisms (DNA methylation, histone modifications) regulate gene expression in neurons without altering the DNA sequence. How do epigenetic modifications contribute to long-term memory storage?",
    "options": {
      "A": "Epigenetic modifications in neurons are completely static after birth and cannot be altered by experience",
      "B": "Epigenetic mechanisms contribute to long-term memory by providing a stable molecular substrate for persistent changes in gene expression — learning triggers DNA methyltransferase activity and histone acetylation/methylation changes at specific gene loci (including BDNF, reelin, and memory suppressor genes), creating lasting transcriptional programs that maintain synaptic modifications long after the initial signaling cascades have dissipated, potentially explaining how memories can persist for a lifetime despite molecular turnover",
      "C": "Epigenetic modifications only affect non-neuronal cells and have no role in memory or neural plasticity",
      "D": "Memory is stored entirely by changes in DNA sequence through somatic mutations, not through epigenetic mechanisms"
    },
    "correct_answer": "B",
    "difficulty": 5,
    "x": 0.52654,
    "y": 0.564785,
    "z": 0.670084,
    "source_article": "epigenetics",
    "domain_ids": [
      "neurobiology",
      "neuroscience"
    ],
    "concepts_tested": [
      "epigenetics",
      "memory consolidation",
      "chromatin remodeling"
    ]
  }
]